Repository: openstack-kr/knu_i18n_2025
Catalog: validate/sample_*.po
Languages: cn, ja, ru

source: Fixed cross-policy object copies. Previously, copied data would always be written using the source container's policy. Now, the destination container's policy will be used, avoiding availability issues and unnecessary container-reconciler work.
cn: 修复了跨策略对象复制的问题。以前，复制的数据始终使用源容器的策略进行写入。现在将使用目标容器（destination container）的策略，以避免可用性问题和不必要的容器（container）协调器工作。
ja: ポリシーをまたぐオブジェクトコピーの問題を修正しました。以前はコピーされたデータが常にソースコンテナーのポリシーを使用して書き込まれていましたが、現在は宛先コンテナーのポリシーが使用されるようになり、可用性の問題や不要なコンテナーリコンシライラの作業を回避します。
ru: Исправлена проблема с копированием объектов между различными политиками. Ранее данные всегда записывались с использованием политики исходного контейнера (container). Теперь используется политика целевого контейнера (destination container), что позволяет избежать проблем с доступностью и ненужной работы согласователя контейнеров.

source: Fixed deadlock when logging from a tpool thread.
cn: 修复了在 tpool 线程记录日志时可能发生的死锁问题。
ja: tpool スレッドからのログ出力時に発生していたデッドロックを修正しました。
ru: Исправлено взаимоблокирование, возникающее при записи логов из потока tpool.

source: Fixed deadlock when logging from a tpool thread. The object server runs certain IO-intensive methods outside the main pthread for performance. Previously, if one of those methods tried to log, this can cause a crash that eventually leads to an object server with hundreds or thousands of greenthreads, all deadlocked. The fix is to use a mutex that works across different greenlets and different pthreads.
cn: 修复了 tpool 线程记录日志时可能导致的死锁问题。对象存储（Object Storage service）为了性能，会在主线程之外运行部分 I/O 密集的方法。以前，当这些方法尝试写入日志时，可能导致崩溃，最终使对象服务器产生数百甚至数千个死锁的 greenthread。此修复通过使用可跨不同 greenlet 与 pthread 工作的互斥锁（mutex）解决。
ja: tpool スレッドからのログ出力時にデッドロックが発生する問題を修正しました。オブジェクトサーバーはパフォーマンス向上のため、一部の I/O 負荷の高いメソッドをメインスレッド外で実行します。以前はこれらのメソッドがログを出力しようとするとクラッシュが発生し、数百から数千の greenthread がデッドロックする状態になっていました。この修正では、異なる greenlet および pthread 間で動作するミューテックスを使用しています。
ru: Исправлено взаимоблокирование при записи логов из потока tpool. Сервер объектов (Object Storage service) выполняет некоторые методы с высокой I/O нагрузкой вне основного потока для повышения производительности. Ранее попытка таких методов записать лог могла привести к сбою и образованию сотен или тысяч «зелёных» потоков (greenthreads), находящихся во взаимной блокировке. Теперь используется мьютекс, работающий между различными greenlet и pthread потоками.

source: Fixed encoding issue in ssync where a mix of ascii and non-ascii metadata values would cause an error.
cn: 修复了 ssync 中编码问题：当元数据值中混合出现 ASCII 与非 ASCII 字符时会导致错误。
ja: ssync において、ASCII および非 ASCII のメタデータ値が混在するとエラーが発生する問題を修正しました。
ru: Исправлена ошибка кодирования в ssync, из-за которой смесь ASCII и не-ASCII значений метаданных вызывала сбой.

source: Fixed error where a container drive error resulted in double space usage on rest drives. When drive with container or account database is unmounted, the bug would create handoff replicas on all remaining drives, increasing the drive space used and filling the cluster.
cn: 修复了当容器驱动发生错误时导致其余磁盘空间被重复占用的问题。当包含容器（container）或账户数据库的驱动被卸载时，该缺陷会在所有剩余驱动上创建交接副本，从而增加磁盘空间使用并导致集群（cluster）被填满。
ja: コンテナドライブのエラーにより、残りのドライブで使用領域が二重に計上される問題を修正しました。コンテナまたはアカウントデータベースを含むドライブがアンマウントされた場合、バグによりすべての残りのドライブにハンドオフレプリカが作成され、ドライブの使用量が増加しクラスタが満杯になる問題が発生していました。
ru: Исправлена ошибка, при которой сбой диска контейнера (container) приводил к удвоенному использованию пространства на остальных дисках. Когда диск с базой данных контейнера или учётной записи был размонтирован, дефект создавал резервные копии (handoff replicas) на всех оставшихся дисках, что увеличивало использование пространства и заполняло кластер (cluster).

source: Fixed issue where bulk requests using xml and expect 100-continue would return a malformed HTTP response.
cn: 修复了使用 XML 并带有 100-continue 期望的批量请求（bulk requests）返回错误 HTTP 响应的问题。
ja: XML を使用し、100-continue を期待するバルクリクエストで不正な HTTP レスポンスが返される問題を修正しました。
ru: Исправлена ошибка, из-за которой массовые запросы (bulk requests), использующие XML и ожидающие 100-continue, возвращали некорректный HTTP-ответ.

source: Fixed listings for sharded containers.
cn: 修复了分片容器（sharded container）列表显示的问题。
ja: シャーディングされたコンテナーのリスト表示の問題を修正しました。
ru: Исправлено отображение списков для шардированных контейнеров (sharded containers).

source: Fixed logging of IP and port in the proxy-server; in particular, internal clients now correctly log about the replication IP/port.
cn: 修复了 proxy-server 中 IP 与端口的日志记录问题。尤其是内部客户端现在能正确记录复制（replication）IP/端口。
ja: proxy-server における IP およびポートのログ出力を修正しました。特に内部クライアントがレプリケーション用の IP/ポートを正しくログに記録するようになりました。
ru: Исправлена запись IP и порта в proxy-server. В частности, внутренние клиенты теперь корректно фиксируют IP/порт, используемые для репликации (replication).

source: Fixed multiple issues in s3api involving Multipart Uploads with non-ASCII names.
cn: 修复了 s3api 中与包含非 ASCII 名称的多部分上传（Multipart Upload）相关的多个问题。
ja: s3api において、非 ASCII 文字を含むマルチパートアップロードに関連する複数の問題を修正しました。
ru: Исправлены несколько ошибок в s3api, связанных с многочастичной загрузкой (Multipart Upload) файлов, имеющих имена с не-ASCII символами.

source: Fixed non-ASCII account metadata handling.
cn: 修复了处理包含非 ASCII 字符的账户元数据时出现的错误。
ja: 非 ASCII 文字を含むアカウントメタデータの処理を修正しました。
ru: Исправлена обработка метаданных учётных записей (account metadata), содержащих не-ASCII символы.

source: Fixed non-deterministic suffix updates in hashes.pkl where a partition may be updated much less often than expected.
cn: 修复了 hashes.pkl 中非确定性后缀更新的问题，该问题会导致分区（partition）的更新频率远低于预期。
ja: hashes.pkl において、予想よりも頻度が低くパーティションが更新される非決定的なサフィックス更新の問題を修正しました。
ru: Исправлены недетерминированные обновления суффиксов в файле hashes.pkl, из-за которых раздел (partition) обновлялся гораздо реже, чем ожидалось.

source: Fixed rare socket leak on range requests to erasure-coded objects.
cn: 修复了针对纠删码（erasure-coded）对象的范围请求（range request）中罕见的套接字泄漏问题。
ja: イレージャーコーディングオブジェクトへのレンジリクエストでまれに発生するソケットリークを修正しました。
ru: Исправлена редкая утечка сокета при выполнении запросов диапазона (range requests) к объектам с кодом коррекции ошибок (erasure-coded objects).

source: Fixed regression in consolidate_hashes that occured when a new file was stored to new suffix to a non-empty partition. This bug was introduced in 2.7.0 and could cause an increase in rsync replication stats during and after upgrade, due to inconsistent hashing of partition suffixes.
cn: 修复了 consolidate_hashes 中的回归问题：当在非空分区（partition）中以新后缀存储新文件时会触发该问题。该缺陷在 2.7.0 版本中引入，会由于分区后缀哈希不一致而导致在升级期间及之后 rsync 复制（replication）统计增加。
ja: consolidate_hashes において、非空のパーティションに新しいサフィックスでファイルを保存すると発生するリグレッションを修正しました。このバグは 2.7.0 で導入され、パーティションサフィックスのハッシュ不整合により、アップグレード中およびアップグレード後に rsync のレプリケーション統計値が増加する原因となっていました。
ru: Исправлен регресс в consolidate_hashes, возникавший при сохранении нового файла с новым суффиксом в непустом разделе (partition). Ошибка была введена в версии 2.7.0 и могла привести к увеличению статистики репликации (replication) rsync во время и после обновления из-за несовместимости хеширования суффиксов разделов.

source: Fixed regression in consolidate_hashes that occurred when a new file was stored to new suffix to a non-empty partition. This bug was introduced in 2.7.0 and could cause an increase in rsync replication stats during and after upgrade, due to inconsistent hashing of partition suffixes.
cn: 修复了 consolidate_hashes 的回归问题：在非空分区（partition）中新建文件时会触发该错误。此问题源于 2.7.0 版本，由于分区后缀哈希不一致，会导致在升级前后 rsync 复制统计增加。
ja: consolidate_hashes において、非空のパーティションに新しいサフィックスでファイルを保存すると発生するリグレッションを修正しました。この不具合は 2.7.0 で導入され、パーティションサフィックスのハッシュ不整合により、アップグレード中およびアップグレード後に rsync レプリケーション統計が増加する可能性がありました。
ru: Исправлен регресс в consolidate_hashes, возникавший при сохранении нового файла с новым суффиксом в непустом разделе (partition). Ошибка была добавлена в версии 2.7.0 и могла вызвать увеличение статистики репликации rsync во время и после обновления из-за некорректного хеширования суффиксов разделов.

source: Let clients request heartbeats during SLO PUTs by including the query parameter heartbeat=on.
cn: 允许客户端在执行 SLO PUT 操作时通过添加查询参数 heartbeat=on 请求心跳信号。
ru: Теперь клиенты могут запрашивать сигналы heartbeat во время выполнения SLO PUT, добавляя параметр запроса heartbeat=on.

source: Listing containers in accounts with json or xml now includes a last_modified time. This does not change any on-disk data, but simply exposes the value to offer consistency with the object listings on containers.
cn: 现在使用 JSON 或 XML 列出账户下的容器（container）时会包含 last_modified 时间。该更改不会修改磁盘上的数据，只是为了与容器中的对象列表保持一致。
ru: Теперь при выводе списка контейнеров (container) в учетных записях с использованием JSON или XML добавляется время last_modified. Это изменение не затрагивает данные на диске, а только обеспечивает согласованность со списками объектов (object) в контейнерах.

source: Lock timeouts in the container updater are now logged at INFO level, not ERROR.
cn: 容器（container）更新器中的锁定超时（lock timeout）现在记录为 INFO 级别，而不是 ERROR。
ja: コンテナーアップデーターにおけるロックタイムアウトが、ERROR レベルではなく INFO レベルでログ記録されるようになりました。
ru: Истечения времени ожидания блокировки (lock timeout) в обновляющем контейнере (container updater) теперь записываются с уровнем INFO, а не ERROR.

source: Log correct status code for conditional requests.
cn: 修复了条件请求（conditional request）日志记录中的状态码错误问题，现在能够正确记录状态码。
ja: 条件付きリクエストに対して正しいステータスコードをログに記録するようになりました。
ru: Исправлено логирование кода состояния (status code) для условных запросов (conditional requests) — теперь записывается правильное значение.

source: Log deprecation warning for allow_versions in the container server config. Configure the versioned_writes middleware in the proxy server instead. This option will be ignored in a future release.
cn: 在容器（container）服务器配置中为 allow_versions 记录弃用警告。请改为在代理服务器（proxy server）中配置 versioned_writes 中间件（middleware）。此选项将在未来的版本中被忽略。
ru: Добавлено предупреждение об устаревании параметра allow_versions в конфигурации контейнерного сервера (container server). Вместо этого настройте middleware versioned_writes на прокси-сервере (proxy server). Данный параметр будет проигнорирован в будущих выпусках.

source: Log deprecation warnings for run_pause. This setting was deprecated in Swift 2.4.0 and is replaced by interval. It may be removed in a future release.
cn: 记录 run_pause 的弃用警告。此设置在 Swift 2.4.0 中已被弃用，并由 interval 参数取代。该选项可能会在将来的版本中被删除。
ru: Добавлено предупреждение об устаревании параметра run_pause. Эта настройка была объявлена устаревшей в Swift 2.4.0 и заменена на параметр interval. В будущем релизе она может быть удалена.

source: Log formats are now more configurable and include support for anonymization. See the log_msg_template option in proxy-server.conf and the Swift documentation <https://docs.openstack.org/swift/latest/logs.html#proxy-logs>__ for more information.
cn: 日志格式现在更加可配置，并增加了匿名化支持。详情请参阅 proxy-server.conf 文件中的 log_msg_template 选项以及 Swift 文档 <https://docs.openstack.org/swift/latest/logs.html#proxy-logs>。
ru: Форматы журналов (log formats) теперь более настраиваемы и поддерживают анонимизацию. Подробнее см. параметр log_msg_template в proxy-server.conf и документацию Swift: <https://docs.openstack.org/swift/latest/logs.html#proxy-logs>.

source: Log progress per partition when relinking/cleaning up.
cn: 在重新链接（relink）或清理（cleanup）过程中，记录每个分区（partition）的进度日志。
ja: 再リンクやクリーンアップの際に、パーティションごとの進捗をログに出力するようになりました。
ru: Теперь при повторной привязке (relink) или очистке (cleanup) ведется журнал прогресса для каждого раздела (partition).

source: Log the correct request type of a subrequest downstream of copy.
cn: 在 copy 操作下游的子请求（subrequest）中记录正确的请求类型（request type）。
ja: コピー処理の下流にあるサブリクエストの正しいリクエストタイプをログに記録するようになりました。
ru: Исправлено логирование типа запроса (request type) подзапроса (subrequest), выполняемого после операции копирования (copy).

source: Logging improvements
cn: 日志系统的改进。
ja: ログ機能の改善
ru: Улучшения системы журналирования.

source: Lower bounds of dependencies have been updated to reflect what is actually tested.
cn: 更新了依赖项（dependency）的下限版本，以反映实际测试过的环境。
ja: 依存関係の下限バージョンが、実際にテストされた環境を反映するように更新されました。
ru: Минимальные версии зависимостей (dependencies) были обновлены, чтобы соответствовать реально протестированным версиям.

source: Make allowable clock skew configurable, with a default value of 15 minutes to match AWS. Note that this was previously hardcoded at 5 minutes; operators may want to preserve the prior behavior by setting allowable_clock_skew = 300 in the [filter:s3api] section of their proxy-server.conf.
cn: 允许配置时钟偏差（clock skew），默认值为 15 分钟，与 AWS 保持一致。此前该值固定为 5 分钟；如希望保留旧行为，可在 proxy-server.conf 的 [filter:s3api] 部分设置 allowable_clock_skew = 300。
ru: Теперь допустимую рассинхронизацию часов (clock skew) можно настраивать. Значение по умолчанию — 15 минут, как в AWS. Ранее параметр был зафиксирован на уровне 5 минут. Чтобы сохранить прежнее поведение, можно установить allowable_clock_skew = 300 в разделе [filter:s3api] файла proxy-server.conf.

source: Make mount_check option usable in containerized environments by adding a check for an ".ismount" file at the root directory of a device.
cn: 通过在设备根目录添加 “.ismount” 文件检查，使 mount_check 选项可在容器化（containerized）环境中使用。
ja: デバイスのルートディレクトリに「.ismount」ファイルがあるかを確認することで、コンテナ化環境でも mount_check オプションが使用できるようになりました。
ru: Параметр mount_check теперь можно использовать в контейнеризованных (containerized) средах — добавлена проверка наличия файла «.ismount» в корневом каталоге устройства.

source: Memcache client error-limiting is now configurable. See the error_suppression_* options in etc/memcache.conf-sample
cn: 现在可配置 Memcache 客户端的错误限制。请参阅 etc/memcache.conf-sample 文件中的 error_suppression_* 选项。
ru: Теперь можно настраивать ограничение ошибок клиента Memcache. См. параметры error_suppression_* в файле etc/memcache.conf-sample.

source: Metrics are now emitted for a variety of S3 error responses, in the form s3api.<status_int>.<error_class>[.<reason>]
cn: 现在针对多种 S3 错误响应生成指标（metrics），其格式为 s3api.<status_int>.<error_class>[.<reason>]。
ru: Теперь для различных ответов об ошибках S3 создаются метрики (metrics) в формате s3api.<status_int>.<error_class>[.<reason>].

source: Metrics are now emitted for whether databases used for cleaving were created or already existed, allowing a better understanding of the reason for handoffs in the cluster.
cn: 现在会输出用于分割（cleaving）的数据库是新建还是已存在的指标（metrics），以帮助更好地理解集群（cluster）中交接（handoff）的原因。
ja: 分割処理に使用されるデータベースが新規作成されたものか、既存のものかを示すメトリクスが出力されるようになり、クラスタ内でハンドオフが発生する理由をより理解しやすくなりました。
ru: Теперь создаются метрики, показывающие, была ли база данных, используемая для разделения (cleaving), вновь создана или уже существовала, что помогает лучше понимать причины передачи (handoff) в кластере (cluster).

source: Metrics improvements:
cn: 指标（metrics）改进：
ja: メトリクスの改善:
ru: Улучшения метрик (metrics):

source: Middleware features:
cn: 中间件（middleware）功能：
ja: ミドルウェアの新機能:
ru: Новые функции middleware:

source: Mirror X-Trans-Id to X-Openstack-Request-Id.
cn: 将 X-Trans-Id 镜像到 X-Openstack-Request-Id。
ja: X-Trans-Id を X-Openstack-Request-Id にミラーリングするようになりました。
ru: Теперь X-Trans-Id зеркалируется (mirror) в X-Openstack-Request-Id.

source: Upgrade liberasurecode on all proxy servers. Newly-written data will now use new fragments. Note that not-yet-upgraded proxies will not be able to read these newly-written fragments but will instead respond 500 Internal Server Error.
cn: 在所有代理服务器（proxy server）上升级 liberasurecode。新写入的数据将使用新的片段格式。未升级的代理无法读取这些新片段，而是会返回 “500 Internal Server Error”。
ru: На всех прокси-серверах (proxy servers) обновлена библиотека liberasurecode. Новые данные теперь записываются с использованием новых фрагментов. Обратите внимание, что не обновленные прокси не смогут читать эти новые фрагменты и будут возвращать «500 Internal Server Error».

source: Uploads to containers with object versioning enabled now require a Content-Length or Transfer-Encoding: chunked header, similar to other containers.
cn: 对于启用了对象版本控制（object versioning）的容器（container），现在上传操作必须包含 Content-Length 或 Transfer-Encoding: chunked 标头，与其他容器保持一致。
ru: Загрузки в контейнеры (containers), где включено управление версиями объектов (object versioning), теперь требуют наличия заголовка Content-Length или Transfer-Encoding: chunked, как и в других контейнерах.

source: Let clients request heartbeats during SLO PUTs by including the query parameter ``heartbeat=on``.
ja: クライアントが SLO PUT の実行中に ``heartbeat=on`` クエリパラメータを指定することでハートビートを要求できるようになりました。

source: Listing containers in accounts with json or xml now includes a `last_modified` time. This does not change any on-disk data, but simply exposes the value to offer consistency with the object listings on containers.
ja: JSON または XML 形式でアカウント内のコンテナーを一覧表示する際に、`last_modified` 時刻が含まれるようになりました。ディスク上のデータは変更されず、コンテナー内オブジェクトリストとの整合性を提供します。

source: Log deprecation warning for ``allow_versions`` in the container server config. Configure the ``versioned_writes`` middleware in the proxy server instead. This option will be ignored in a future release.
ja: コンテナーサーバー設定内の ``allow_versions`` に対する非推奨警告をログ出力するようになりました。代わりに proxy サーバーで ``versioned_writes`` ミドルウェアを設定してください。このオプションは将来のリリースで無視されます。

source: Log deprecation warnings for ``run_pause``. This setting was deprecated in Swift 2.4.0 and is replaced by ``interval``. It may be removed in a future release.
ja: ``run_pause`` 設定に関する非推奨警告をログ出力するようになりました。この設定は Swift 2.4.0 で非推奨となり、``interval`` に置き換えられています。将来のリリースで削除される可能性があります。

source: Log formats are now more configurable and include support for anonymization. See the ``log_msg_template`` option in ``proxy-server.conf`` and `the Swift documentation <https://docs.openstack.org/swift/latest/logs.html#proxy-logs>`__ for more information.
ja: ログ形式がより柔軟に設定可能になり、匿名化のサポートが追加されました。詳細については ``proxy-server.conf`` の ``log_msg_template`` オプションおよび `Swift ドキュメント <https://docs.openstack.org/swift/latest/logs.html#proxy-logs>`__ を参照してください。

source: Make allowable clock skew configurable, with a default value of 15 minutes to match AWS. Note that this was previously hardcoded at 5 minutes; operators may want to preserve the prior behavior by setting ``allowable_clock_skew = 300`` in the ``[filter:s3api]`` section of their proxy-server.conf.
ja: 許容クロックスキューを設定可能にしました。デフォルト値は AWS と一致する 15 分です。以前は 5 分に固定されていました。以前の動作を維持したい場合は、proxy-server.conf の ``[filter:s3api]`` セクションで ``allowable_clock_skew = 300`` を設定してください。

source: Memcache client error-limiting is now configurable. See the ``error_suppression_*`` options in etc/memcache.conf-sample
ja: Memcache クライアントのエラー制限が設定可能になりました。詳細は etc/memcache.conf-sample の ``error_suppression_*`` オプションを参照してください。

source: Metrics are now emitted for a variety of S3 error responses, in the form ``s3api.<status_int>.<error_class>[.<reason>]``
ja: さまざまな S3 エラーレスポンスに対して、形式 ``s3api.<status_int>.<error_class>[.<reason>]`` のメトリクスが出力されるようになりました。

source: Upgrade liberasurecode on all proxy servers. Newly-written data will now use new fragments. Note that not-yet-upgraded proxies will not be able to read these newly-written fragments but will instead respond ``500 Internal Server Error``.
ja: すべての proxy サーバーで liberasurecode をアップグレードしました。新しく書き込まれたデータは新しいフラグメント形式を使用します。アップグレードされていない proxy はこれらの新しいフラグメントを読み取れず、代わりに ``500 Internal Server Error`` を返します。

source: Uploads to containers with object versioning enabled now require a ``Content-Length`` or ``Transfer-Encoding: chunked`` header, similar to other containers.
ja: オブジェクトバージョニングが有効なコンテナーへのアップロードには、他のコンテナーと同様に ``Content-Length`` または ``Transfer-Encoding: chunked`` ヘッダーが必要になりました。
