Repository: openstack-kr/knu_i18n_2025
Catalog: po/i18n-docs-source-locale-*.po
Languages: ja, ko_kr, ru

source: Follow :doc:`the step <official_translator>` to register an ID in the translation website.
ko_kr: :doc:`official_translator <official_translator>`-step을 따르면 번역 웹사이트에 ID를 등록하십시오.
ru: Следуйте :doc:`шагу <официальный переводист>` для регистрации ID на tranglozhe.ru.

source: For a document in a stable branch, such as the installation guide for Liberty, you need to update the file ``doc-tools-check-languages.conf`` in the target stable branch directly.
ja: 安定化されたブランチのドキュメント、たとえばLibertyのインストールガイドに含まれるファイル``doc-tools-check-languages.conf``を直接、ターゲットの安定化されたブランチで更新する必要があります。
ko_kr: 정상적인 브랜치에 있는 문서, 예를 들어 리버티의 설치 가이드는, 목적브랜치를 직접적으로 ``doc-tools-check-languages.conf`` 파일을 업데이트해야 합니다.
ru: Для документа в стабильной ветке, например, установки Liberty, необходимо обновить файл ``doc-tools-check-languages.conf`` в целевой стабильной ветке напрямую.

source: For documentations, URL and a detail place would be great.
ja: ドキュメンテーションの場合、URLと詳細な場所が便利です。
ko_kr: 문서에 대한 정보와 URL 및รายละเอียด의 위치가 좋을 것입니다.
ru: Для документации, URL и детальный адрес будут полезны.

source: For each Python project in OpenStack, there is an automation job daily to download the translations in PO file to the "locale" folder under the source folder of each project. See :doc:`here <infra>`. It will generate a review request in Gerrit. After :doc:`review <reviewing-translation-import>`, the translation in PO file will be merged.
ko_kr: OpenStack에서 각 Python 프로젝트에 대해 일일로 PO 파일을 "locale" 폴더 하위의 소스 폴더에 tải하는 자동화 jobs가 있습니다. :doc:`여기 <infra>`를 확인하십시오. 이will generate a review request in Gerrit. After :doc:`reviewing-translation-import <reviewing-translation-import>`, the translation in PO file will be merged.
ru: Для каждого Python-проекта в OpenStack существует ежедневная автоматизированная задача по загрузке переводов из файла PO в папку "locale" под каждым проектом. See :doc:`here <infra>`. Она сгенерит запрос на обмен в Gerrit. После :doc:`review <reviewing-translation-import>`, перевод в файле PO будет объединен.

source: For each Python project in OpenStack, there is an automation job to extract the messages , generate PO template and upload to Zanata, which is triggered by the "commit" event. See :doc:`here <infra>`.
ko_kr: OpenStack에서 각 Python 프로젝트에 대해 "commit" 이벤트가 발생할 때, 메시지를 추출하고 PO 템플릿을 생성하고 Zanata에 업로드하는 자동화 jobs가 있습니다. :doc:`여기 <infra>`를 확인하십시오.
ru: Для каждого Python-проекта в OpenStack существует автоматизированная задача по вытащению сообщений, генерации шаблона для PO и загрузке в Zanata, которая активируется событием "коммит". See :doc:`here <infra>`.

source: For example, in case of nova,
ko_kr: 예를 들어 노바의 경우에
ru: Для примера, в случае nova,

source: For most of the Python projects, the preferred tools for I18N are gettext and babel. The gettext module provides internationalization (I18N) and localization (L10N) services for your Python modules and applications. Babel are a collection of tools for internationalizing Python applications.
ko_kr: 파이썬 프로젝트의 대부분에서 gettext 및 babel이 사용되는 것을 선호합니다. gettext 모듈은 파이썬 모듈과 애플리케이션에 국제화 (I18N)와 지역화 (L10N) 서비스를 제공합니다. babel은 파이썬 애플리케이션의 국제화 도구입니다.
ru: Для большинства Python-проектов preferred tools for I18N — gettext и babel. The gettext module provides internationalization (I18N) and localization (L10N) services for your Python modules and applications. Babel are a collection of tools for internationalizing Python applications.

source: For the dashboard, panel or form name.
ja: ダッシュボード、パネル、またはフォームの名前については、ご希望ください。
ko_kr: 대시보드, 패널 또는 형식 이름.
ru: Для десктоп-интерфейса, панели или формы name.

source: For translation of strings in Python files, only a few changes are needed inside a project.
ru: Для перевода строк в файлах Python требуется только несколько изменений внутри проекта.

source: Foundation membership was validated by calling a REST API in https://openstackid-resources.openstack.org
ko_kr: foundation membership가 https://openstackid-resources.openstack.org 의 REST API를 호출하여 유효화되었습니다.
ru: Верифицирована членство в фондe за помощью к REST API в https://openstackid-resources.openstack.org

source: Getting in touch
ja: お問い合わせ
ko_kr: 연락처
ru: Контакт

source: Glossary Management
ja: 辞書管理
ko_kr: 집합 관리
ru: Управление словарями

source: Glossary of your language
ja: あなたの言語の辞書
ko_kr: 어言어言
ru: Словарь вашего языка

source: Go to `Zanata server <https://translate.openstack.org/>`_
ja: Zanata サーバー <https://translate.openstack.org/> `_
ko_kr: Zanata 서버 <https://translate.openstack.org/>로 이동하십시오.
ru: Перейти на сервер Zanata <https://translate.openstack.org/>

source: Go to the :doc:`translation tools <tools>` page to understand the tools and scripts which support our translation platform.
ja: :doc:`翻訳ツール <tools>` ページを参照して、我们的翻訳プラットフォームをサポートするツールとスクリプトの理解を得ることができます。
ko_kr: :doc:`翻訳ツール <tools>` 페이지를 방문하여 우리의 번역 플랫폼을 지원하는 도구와 스크립트를 이해하십시오.
ru: Перейти на страницу переводческих инструментов <tools>

source: Handling documentation projects
ja: ドキュメントプロジェクトの処理
ko_kr: 문서 관리
ru: Обработка проектов документации

source: Handling horizon projects
ja: Horizon プロジェクトの処理
ru: Обработка проекта Horizon

source: Handling python projects
ja: Python プロジェクトの処理
ru: Обработка проектов Python

source: Handling translation bugs
ja: 翻訳のバグを処理する
ru: Обработка ошибок перевода

source: Handy links (always sort of on the agenda)
ru: Практичные ссылки (всегда на agenda)

source: Heleno Jimenez de la Cruz (id: heleno_jimenez) - Spanish (Mexico)
ja: ヘレノ Jiménez de la Cruz (id: heleno_jimenez) - スペイン
ru: Хелена Jimenez de la Cruz (id: heleno_jimenez) - испанский (Мексика)

source: Here is the check list for such case:
ja: これはそのようなケースのチェックリストです:
ko_kr: 이러한 경우에 대한 확인 목록입니다.
ru: Вот список для проверки такого случая:

source: How are translations handled?
ko_kr: 번역이 어떻게 처리되는가?
ru: Как обрабатываются переводы?

source: How can I report a bug?
ja: このバグを報告するにはどうすれば?
ko_kr: BUG를 보고 싶은 방법은 무엇인가?
ru: Как я могу отчетить о ошибке?

source: How to check translations
ja: 翻訳をチェックする方法
ko_kr: 번역 확인 방법
ru: Как проверить переводы

source: I18n Core Team
ko_kr: i18n Core 팀
ru: Корейский Core Team

source: I18n Mailing List Management
ko_kr: i18n 메일링 리스트 관리
ru: Управление почтой на почте I18N

source: I18n blueprints are listed also on `Launchpad <https://blueprints.launchpad.net/openstack-i18n>`__. In normal case a blueprint has an assignee and describes a larger course of a process.
ko_kr: i18n blueprint는 Launchpad <https://blueprints.launchpad.net/openstack-i18n>에도 liệt어져 있습니다. 일반적으로 blueprint에는 assignee가 있으며, 프로세스의 더 큰 경로를 설명합니다.
ru: Планы I18n также представлены на Launchpad <https://blueprints.launchpad.net/openstack-i18n>__. В обычном случае план имеет назначенного человеку и описывает более широкий курс процесса.

source: I18n team helps release activities on other projects if the projects have cross-project liaison on I18n team and upon request.
ko_kr: i18n 팀은 다른 프로젝트의 릴리스 활동을 도와줍니다. 이때는 프로젝트가 i18n 팀과 cross-project liaison이 있는 경우에만 가능합니다.
ru: Тeam по международной стандартизации помогает проведению активностей на других проектах при условии присутствия liaison на проекте в team по международной стандартизации и с согласия.

source: I18n team meeting
ja: I18n チーム会議
ko_kr: 국가 번역 팀 회의
ru: Совещание по международной стандартизации

source: IRC meeting commands
ja: IRC会議コマンド
ko_kr: IRC 회의 명령
ru: Команды IRC

source: IRC web client
ja: IRCウェブクライアント
ko_kr: IRC 웹 클라이언트
ru: Клиент IRC

source: If a bug reports translation errors of a certain language, it could be called **translation bug**. The translation bug should be fixed in the translation tool.
ja: 翻訳エラーのある特定言語について報告されたバグは、**翻訳バグ**と呼ばれます。翻訳バグを修正するには、翻訳ツールを修正する必要があります。
ko_kr: 번역 오류를 특정 언어에 대해 보고한 경우, 그것은 **번역 오류 버그**라고 불리우게 됩니다. 번역 오류 버그는 번역 도구에서修复해야 합니다.
ru: Если отчет об ошибке перевода содержит определенные языки, он может быть назван **багом перевода**. Баг перевода должен быть исправлен в инструменте перевода.

source: If a reported bug turns out to be bugs in a source project, You could help
ja: 報告されたバグがソースプロジェクト内にバグがある場合、助けてください
ko_kr: reported bug가 소스 프로젝트에 대한 버그일 경우, 도움이 될 수 있습니다.
ru: Если отчетный баг оказывается багом в исходном проекте, Вы можете помочь

source: If the repository is a GUI project, use the ``translation-jobs-master-stable`` template. Otherwise use the ``translation-jobs-master-only`` template.
ru: Если репозиторий является GUI-проектом, используйте шаблон ``translation-jobs-master-stable``. В противном случае используйте шаблон ``translation-jobs-master-only``.

source: If there is a translation bug on a stable version in Zanata, it is highly recommended to fix the same translation bug on the corresponding string in the master version.
ja: Zanata の安定版で翻訳エラーが発生している場合、同じ文字列の安定版とマスター版の両方で修正することを強くお勧めします。
ko_kr: Zanata의 안정적인 버전에서 번역 오류가 발생한 경우, 동일한 번역 오류를-master 버전의 corresponding string 에서修正하는 것이 strongly 추천됩니다.
ru: Если на стабильной версии Zanata есть баг перевода, highly recommended fix тот же переводный баг в соответствующую строку в версии master.

source: If you are a speaker of this language, you could help
ja: この言語を話す人ですか?助けてください
ko_kr: 이 언어를 nói는 사람이라면 도움이 될 수 있습니다.
ru: Если Вы говорите на этот язык, Вы можете помочь

source: If you are a translator of this language, you could help
ja: この言語を翻訳者としている場合は、助けてください
ko_kr: 이 언어를 번역하는 사람이라면 도움을 줄 수 있습니다.
ru: Если Вы переводчик этого языка, Вы можете помочь

source: If you are a translator or a person involved in I18n effort, you may be interested in triaging and fixing translation bugs :)
ja: この言語の翻訳者やI18n活動に携わっている人は、翻訳エラーのトライアウトと修正することを興味があります :)
ko_kr: 이18n effort에 참여하거나 번역자라면, 번역 오류를_triaging 및修正하는 것을 관심 있으실 것입니다.
ru: Если вы translator или человек, участвующий в effort I18n, может быть интересно оценивать и исправлять ошибки перевода :)

source: If you are lucky to use a same name for launchpad and Zanata IDs, you do not need to do the above. Stackalytics will find your statistics automatically.
ja: 同じ Launchpad ID と Zanata ID を使用する幸運な場合は、上記のステップを実行する必要はありません。Stackalytics は自動的に統計情報を見つけることができます。
ko_kr: 이름을 launchpad와 Zanata ID가 동일한 경우에 luckily 사용할 수 있습니다. Stackalytics는 자체 통계를 tự động적으로 찾습니다.
ru: Если вам повезло использовать один и тот же 이름 для launchpad и Zanata IDs, не нужно выполнять вышеуказанные действия. Stackalytics найдут ваши статистические данные автоматически.

source: If you are reviewing these translations, keep the following in mind:
ko_kr: 이 번역을 검토하는 경우 다음 점을 기억하세요:
ru: Если вы оцениваете эти переводы, помните следующие:

source: If you are unfamiliar with translations in OpenStack, read the `Project Team Guide on Internationalization and Translation <http://docs.openstack.org/project-team-guide/i18n.html>`_ first.
ja: OpenStack の翻訳について不明な点があれば、まずは `Internationalization and Translation <http://docs.openstack.org/project-team-guide/i18n.html>`_ を読んでください。
ko_kr: OpenStack의 번역에 unfamiliar한 경우, `Project Team Guide on Internationalization and Translation <http://docs.openstack.org/project-team-guide/i18n.html>`_을 읽어보세요.
ru: Если вы unfamiliar с переводами в OpenStack, прочитайте `Project Team Guide на Международную и переводную работу <http://docs.openstack.org/project-team-guide/i18n.html>`_ в первую очередь.

source: If you cannot find your local team, you can request to :ref:`create a local translation team <creating-lang-team>`.
ko_kr: local team을 찾지 못할 경우, :ref:`create a local translation team <creating-lang-team>`를 요청할 수 있습니다.
ru: Если вам не удалось найти вашу местную команду, вы можете просить :ref:`создать местный команду перевода <creating-lang-team>`.

source: If you encounter more complicated things including translation tool chains or something others, the most recommended way is to ask it in the I18n mailing list ``openstack-i18n@lists.openstack.org``. Of course, you can file a bug against a related project directly.
ja: 複雑な問題に直面した場合（例：翻訳ツールチェーンや他の人からのものなど）、I18n メーリングリスト ``openstack-i18n@lists.openstack.org`` に質問するのが最も推奨される方法です。当然、関連プロジェクトに対してバグを投げることもできます。
ko_kr: 이러한 복잡한 문제를 포함하여 번역 도구 链을 사용할 때, 가장 추천하는 방법은 openstack-i18n mailing list ``openstack-i18n@lists.openstack.org`` 에서 물어보는 것입니다. natürlich, 관련 프로젝트에 대한 버그를 직접 filing 할 수 있습니다.
ru: Если вы столкнетесь с более сложными проблемами, включая цепочки перевода или что-то другое, то наиболее рекомендованный способ — задать вопрос в списке рассылки I18n openstack-i18n@lists.openstack.org. Naturally, вы можете подать заявление об ошибке в связанном проекте напрямую.

source: If you have a machine running DevStack, there are two ways.
ja: DevStack を実行しているマシンがあれば、2 つの方法があります。
ko_kr: DevStack가-running한 기계가 있으면 두 가지 방법이 있습니다.
ru: Если у вас есть машина, running DevStack, есть два способа.

source: If you have any, don't hesitate to share it :)
ja: あなたのものがある場合は、ぜひ共有してください :)
ko_kr: 만약 어떤 것도 있으시면, 그들을 공유해 주세요 :)
ru: Если у вас есть что-то, не стесняйтесь поделиться :)

source: If you notice bad translations in a language, file a bug (see :ref:`reporting_translation_bugs`). Then the translation team will update the translation. We recommend to still import this change as is and import later the fix to not block other valid translations to merge.
ko_kr: 번역이 나쁜 것을 발견하면, :ref:`번역 오류 신고`를 확인하고 버그를 filing 해 보세요. 번역 팀은 번역을 업데이트하도록 하겠습니다. 이 변경 사항을 그대로.import하고, 이후의修正을 import하지 않도록 주의해 주시면, 다른 유효한 번역을 merge할 수 있습니다.
ru: Если вы заметили плохие переводы на каком-либо языке, подайте заявление об ошибке (просмотрите :ref:`reporting_translation_bugs`). Затем переводная группа обновит перевод. Мы рекомендуем все равно импортировать эту изменения в том виде и импортировать позже исправление, чтобы не блокировать другие допустимые переводы на merge.

source: If you visit `openstack-i18n launchpad <https://bugs.launchpad.net/openstack-i18n>`_, we can find **Report a bug** at the right-upper corner. Click to report a bug.
ko_kr: openstack-i18n launchpad <https://bugs.launchpad.net/openstack-i18n>`_에 방문하면, 오른쪽 상단에서 **Report a bug**를 찾을 수 있습니다. 이 버그를 신고하기 위해 클릭해 주세요.
ru: Если вы посетите <https://bugs.launchpad.net/openstack-i18n>, мы можем найти **Report a bug** в правом верхнем углу. Нажмите, чтобы подать заявление об ошибке.

source: If you want to create a language team and you want to be a coordinator, please follow below steps:
ko_kr: 이 언어 팀을 만들고 координ레이터가 되고 싶다면 아래 단계를 따르세요.
ru: Если вы хотите создать команду по языкам и стать координатором, пожалуйста, следуйте ниже шагам:

source: If you want to help fix I18n bugs of OpenStack, we can find them in the following places:
ko_kr: OpenStack의 I18n 오류를 고쳐帮助하고 싶다면, 다음 장소에서 찾을 수 있습니다:
ru: Если вы хотите помочь исправить ошибки internationalization OpenStack, мы можем найти их в следующих местах:

source: If you want to help to report bugs, add more wishlists, and improve them, you can report and fix bugs at `openstack-i18n in Launchpad <https://bugs.launchpad.net/openstack-i18n>`_. Mark bugs with a tag "tools".
ko_kr: I18n 오류를 보고 싶다면 wishlists를 추가하고 개선하여 bug를 보고 fixed 하세요. `openstack-i18n in Launchpad <https://bugs.launchpad.net/openstack-i18n>`_. bug에 "tools" 태그를 부여하세요.
ru: Если вы хотите сообщить об ошибках, добавить желаемые списки и улучшить их, вы можете сообщить и исправить ошибки на `openstack-i18n в Launchpad <https://bugs.launchpad.net/openstack-i18n>`_. Маркируйте ошибки тегом "tools".

source: If your Zanata ID is different from your launchpad ID, Stackalytics will not find your translation statistics. You need to let Stackalytics know your ID mappings. To do this, you need to add your user data into ``detault_data.json`` in `the Stackalytics repository <https://github.com/stackalytics/default_data/>`__.
ko_kr: Zanata ID가 launchpad ID와 다르면 Stackalytics는 번역 통계를 찾지 못합니다. Zanata ID mapping을 알려주어야 합니다. 이 것을 할 수는 `default_data.json`에 사용자 데이터를 추가하는 것입니다. <https://github.com/stackalytics/default_data/>`.
ru: Если ваш Zanata ID отличается от вашего launchpad ID, Stackalytics не найдет ваши статистики по переводам. Вы должны позволить Stackalytics знать о mappings ID. Для этого необходимо добавить данные пользователя в ``detault_data.json`` в `repository Stackalytics <https://github.com/stackalytics/default_data/>`_.

source: If your Zanata ID is not included in the translator list, you need to update the list to include your Zanata ID. Contact your language coordinator, email the i18n mailing list. You can also submit a patch to update the list by yourself (For detail, see :ref:`sync-translator-list`).
ko_kr: Zanata ID가 translator list에 포함되지 않으면, Zanata ID를 list에 추가해야 합니다. 언어 조정자와 연락하세요. 이메일을 보거나, :ref:`sync-translator-list`에 대한 세부 사항을 확인하여 스스로 패치-submit 하세요.
ru: Если ваш Zanata ID не включен в список переводчиков, вам нужно обновить список, чтобы включить ваш Zanata ID. Сंपरните с вашим координатором языка, отправьте email на почту i18n. Вы также можете подать patches для обновления списка (Для подробностей, см. :ref:`sync-translator-list`).

source: If your repository declares multiple python modules in ``packages`` entry in ``[files]`` section in ``setup.cfg``, the infra scripts run translation jobs for each python module.
ru: Если ваш репозиторий объявляет несколько модулей Python в разделе ``packages`` в секции ``[files]``, инфраструктурные скрипты выполняют переводы для каждого модуля Python.

source: If your repository structure is more complex, for example, with multiple python modules, or with both Django and Python projects, see :ref:`translation-setup-complex-case` as well.
ru: Если структура вашего репозитория сложна, например с несколькими моделями Python или с оба Django и Python проекты, посмотрите :ref:`translation-setup-complex-case` также.

source: Implements the first Zuul job (Syncing to Zanata) by executing `upstream_translation_update.sh <https://opendev.org/openstack/openstack-zuul-jobs/src/roles/prepare-zanata-client/files/upstream_translation_update.sh>`__
ru: Использует первый job Zuul (Синхронизация с Zanata) путем выполнения `upstream_translation_update.sh <https://opendev.org/openstack/openstack-zuul-jobs/src/roles/prepare-zanata-client/files/upstream_translation_update.sh>`__

source: Import latest translations
ja: インポート最新の翻訳
ko_kr: 최근 번역을.import
ru: Импорт последних переводов

source: In addition to IRC, I18n team communication takes place via a mailing list. The `Mailing List Administrator <http://lists.openstack.org/cgi-bin/mailman/admin/openstack-i18n>`__ is watching new subscribers, not allowed posts, and all the other things that come with the operation of such a list.
ko_kr: IRC 외에도 I18n 팀의 통신은 메일리스트를 통해 이루어집니다. `Mailing List Administrator <http://lists.openstack.org/cgi-bin/mailman/admin/openstack-i18n>`__는 새로운 구독자, 허용되지 않는 포스팅, 그리고 다른 모든 것에 대해 감시하고 있습니다.
ru: Кроме IRC, обмен информацией между i18n-командой происходит посредством почты. Администратор почты <http://lists.openstack.org/cgi-bin/mailman/admin/openstack-i18n>`__ наблюдает за новыми подписчиками, запрещенными публикациями и другими проблемами, связанными с operationом такой почты.

source: In most cases, a source project would be one of:
ja: ほとんどの場合、ソースプロジェクトは次のいずれかです。
ko_kr: 대부분의 경우, 소스 프로젝트는:
ru: В большинстве случаев источником проекта будет один из:

source: In such cases you can declare how each python module should be handled manually in ``setup.cfg``. Python modules declared in ``django_modules`` and ``python_modules`` are treated as Django project and Python project respectively. If ``django_modules`` or ``python_modules`` entry does not exist, it is interpreted that there are no such modules.
ru: В таких случаях вы можете указать, как каждый пайтон-модуль должен быть обрабатывался вручную в ``setup.cfg``. Пайтон-модули, зарегистрированные в ``django_modules`` и ``python_modules``, считаются Django проектом и Python проектом соответственно. Если ``django_modules`` или ``python_modules`` не существует, это означает, что таких модулей нет.

source: In the beginning of each cycle it is a good idea to think about goals for the project in the next months and establish a translation plan. Goals are maybe still left from the last cycle and are to be reviewed. New goals are to be defined on `PTG <https://www.openstack.org/ptg/>`__ or an equivalent event. Orient the team to the `OpenStack-wide goals <https://governance.openstack.org/tc/goals/>`__.
ko_kr: 각 주기를 시작할 때는 다음 달에 프로젝트를 위한 목표를 생각해 보고 번역 계획을 세우는 것이 좋습니다. 이전 주기에서 남은 목표가 있으면 다시 검토해야 합니다. 새로운 목표는 `PTG <https://www.openstack.org/ptg/>`__ 또는 equivalent 이벤트에서 정의해야 합니다. 팀을 `OpenStack-wide goals <https://governance.openstack.org/tc/goals/>`__에 orient합니다.
ru: В начале каждого цикла важно подумать об целях для проекта на следующие месяцы и создать план перевода. Цели могут быть оставшимися с предыдущего цикла и должны быть проверены. Новые цели должны быть определены на `PTG <https://www.openstack.org/ptg/>`__ или аналогичном событии. Ориентировать команду на `OpenStack-wide goals <https://governance.openstack.org/tc/goals/>`__.

source: Input a short introduction of yourself, including your name, as "Additional information", then click "Send message".
ja: あなたの名前を含む自己紹介を「追加情報」に短く入力し、「送信」ボタンをクリックしてください。
ko_kr: 자신의 이름과 함께 짧은 소개를 입력하세요. 'Additional information'로 입력하고 'Send message'를 클릭하세요.
ru: Вставьте краткую информацию о себе, включая ваше имя, в качестве "Дополнительная информация", затем нажмите «Отправить сообщение».

source: Internationalization (I18n) is essential to make OpenStack ubiquitous. The mission of OpenStack I18n team is to make OpenStack ubiquitously accessible to people of all language backgrounds, by enhancing OpenStack software internationalization, providing translation, maintaining a translation platform and managing translation process for better quality of outcomes.
ja: 国際化（I18n）は、オープンストックが世界的に利用できるようにするために不可欠です。オープンストック I18n チームの目標は、オープンストックソフトウェアの国際化を強化し、翻訳を提供し、翻訳プラットフォームを維持し、翻訳プロセスを管理して、より良質な結果を得ることです。
ko_kr: 국제화 (I18n)는 오픈 스텝을 전 세계적으로 사용할 수 있게 하는 것이 중요합니다. 오픈 스텝 I18n 팀의 목표는 오픈 스텝을 모든 언어 배경에 대한 사람들을 위한 전 세계적으로 접근하기를 목표로 하며, 오픈 스텝 소프트웨어 국제화, 번역 제공, 번역 플랫폼 관리 및 번역 프로세스 관리를 통해 mejor 결과를 얻는 데 도움이 됩니다.
ru: Международизация (I18n) является необходимым условием для того, чтобы OpenStack был ubiquitously. Миссия команды по международизации OpenStack — сделать OpenStack доступным для людей всех языковых backgrounds, расширив международную internacionalизацию OpenStack, предоставляя переводы, управлять платформой перевода и менять процесс перевода для лучшего качества результатов.

source: Is your Zanata ID different from your launchpad ID?
ja: あなたの Zanata ID は、Launchpad ID と異なるですか?
ko_kr: Zanata ID와 Launchpad ID가 다르면?
ru: Ваш ID Zanata отличается ли от вашего launchpad ID?

source: Is your Zanata ID included in the `translator list <https://opendev.org/openstack/i18n/src/tools/zanata/translation_team.yaml>`__?
ja: Zanata ID が翻訳者リスト <https://opendev.org/openstack/i18n/src/tools/zanata/translation_team.yaml> に含まれているか?
ko_kr: Zanata ID가 `translator list <https://opendev.org/openstack/i18n/src/tools/zanata/translation_team.yaml>`__에 포함되어 있는지 확인하세요?
ru: Входит ли ваш Zanata ID в список переводчиков <https://opendev.org/openstack/i18n/src/tools/zanata/translation_team.yaml>__?

source: It is a good idea to organize glossaries and initiate related discussion.
ko_kr: glossary를 조직하고 관련된 논의를 시작하는 것은 좋은 아이디어입니다.
ru: Добрая идея организовать словари и начать обсуждение.

source: It is highly recommended to include the following information.
ja: これらの情報を含めることを強くお勧めします。
ko_kr: 이 정보를 포함하는 것을 매우 추천합니다.
ru: Более чем рекомендуем включить следующие сведения.
