Repository: openstack-kr/knu_i18n_2025
Catalog: po/i18n-docs-source-locale-*.po
Languages: ja, ko_kr, ru

source: It is important to understand how an original string is used in the source code with contextual knowledge for better quality of translations. Unfortunately Zanata translation interface does not show where a target string is used in a source code correspondingly.
ko_kr: 원래 문자열을 소스 코드에 사용하는 방법을 이해하는 것이 중요합니다. 원문 문자열의 문맥적 지식으로 더 좋은 번역ุณภาพ를 얻을 수 있습니다. unfortunately Zanata 번역 인터페이스는 목표 문자열이 소스 코드에서 어떻게 사용되는지 표시하지 않습니다.
ru: Важно понять, как используется исходный текст в исходном коде с контекстной знакомостью для лучшего качества переводов. СадJA Zanata переводческий интерфейс не показывает, где используется цельный текст в исходном коде correspondingly.

source: Keep in mind to work with your `local user group <https://groups.openstack.org/>`_ and the `OpenStack Ambassadors <https://groups.openstack.org/ambassador-program>`_ to raise awareness and gather members :)
ko_kr: local user group <https://groups.openstack.org/>_을 사용하여 작업하고 오픈 스텝 아mbassadors <https://groups.openstack.org/ambassador-program>_과 함께 awareness를 높이고 멤버를 수집하십시오.
ru: Внимание, работайте с своей `группой местных пользователей <https://groups.openstack.org/>`_ и `OpenStack Ambassadors <https://groups.openstack.org/ambassador-program>`_, чтобы повышать осведомленность и собирать участников :)

source: Language Team
ja: 言語チーム
ru: Тeam по языкам

source: Language translation team
ja: 言語翻訳チーム
ru: Команда перевода языков

source: Launchpad I18n Core Team
ru: Команда Launchpad I18n Core

source: Launchpad bugs & blueprints
ru: Платформы Launchpad и blueprints

source: Launchpad bugs, Gerrit reviews, and broken Zuul jobs
ru: Пустые компоненты, Gerrit reviews и разрушенные jobs Zuul

source: Liberty cycle
ja: 自由のサイクル
ru: Сикл свободы

source: Mailing List: `openstack-i18n@lists.openstack.org <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-i18n>`_
ja: メールリスト: `openstack-i18n@lists.openstack.org <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-i18n>`_
ko_kr: 메일리스트: `openstack-i18n@lists.openstack.org <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-i18n>`_
ru: Почта: `openstack-i18n@lists.openstack.org <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-i18n>`_

source: Make sure to include a short introduction because it is the only information which language coordinators can use to determine your join request is valid or not.
ja: 短い紹介を含めるように注意してください。言語コーディネーターは、参加申請が有効かどうかを判断するための唯一の情報であるためです。
ko_kr: 가입 요청이 유효한지 확인하기 위해 언어 조정자들이 사용할 수 있는 유일한 정보는 짧은 소개를 포함해야 합니다.
ru: Убедитесь, что включите краткое представление, поскольку это единственная информация, которую координаторы языков могут использовать для определения того, является ли ваша заявка о присоединении допустимой или нет.

source: Managing a Language Team
ja: 言語チームの管理
ko_kr: 어言의 관리 팀
ru: Управление командой по переводу языка

source: Masaki Matsushita (id: mmasaki) - Japanese
ja: マサキ・マツシタ (id: mmasaki) - 日本人
ko_kr: 마사키 마츠시타 (id: mmasaki) - 일본어
ru: Масаки Мatsuшита (id: mmasaki) - Японский

source: Master glossary
ja: マスターグロサリー
ko_kr: 마스터 glossary
ru: Мастерская словаря

source: Meeting agenda
ja: ミーティング アグエンダ
ko_kr: 회견 일정
ru: Агenda собрания

source: Member (translator)
ja: メンバー (翻訳者)
ko_kr: 멤버 (번역자)
ru: Член (переводчик)

source: Missed translations. Missed translations might be caused by not extracting English strings from the source project, or be caused by real missed translations. If the translations are missed in two different languages, they are probably bugs in the source project. Or else, they are real missed translations.
ja: 不完全な翻訳。不完全な翻訳は、ソースプロジェクトから英語の文字列を抽出していないか、または実際に不完全な翻訳である可能性があります。 2 つの言語で翻訳が漏れた場合、それらはソースプロジェクトのバグである可能性があります。そうでない場合は、実際の不完全な翻訳です。
ru: Пропущенные переводы. Пропущенные переводы могут быть вызваны тем, что не извлекли английские строки из источного проекта, или вызваны реальными пропущенными переводами. Если переводы пропускаются в двух разных языках, они, скорее всего, являются ошибками в исходном проекте. Иначе, это реальные пропущенные переводы.

source: Mitaka cycle
ja: 明田サイクル
ko_kr: 미타카 사이클
ru: Цикл Митака

source: Monitoring translation jobs status
ja: 監視翻訳作業のステータスを確認
ko_kr: 번역 jobs 상태 확인
ru: Статус перевода задач по мониторингу

source: More complex cases
ru: Сложные случаи

source: More convenient way is to use **tox** like ``tox -e venv -- python <script-name>``.
ko_kr: tox와 같은 더 편리한 방법은 ``tox -e venv -- python <script-name>``을 사용하는 것입니다.
ru: Легче использовать **tox** как ``tox -e venv -- python <script-name>``.

source: More information on mailing list: http://lists.openstack.org/pipermail/openstack-i18n/2015-July/001220.html
ko_kr: 이메일 목록에 대한 추가 정보: http://lists.openstack.org/pipermail/openstack-i18n/2015-July/001220.html
ru: Информация о почте: http://lists.openstack.org/pipermail/openstack-i18n/2015-July/001220.html

source: More information: https://releases.openstack.org/ocata/schedule.html & https://ttx.re/splitting-out-design-summit.html
ru: Больше информации: https://releases.openstack.org/ocata/schedule.html & https://ttx.re/splitting-out-design-summit.html

source: Most teams have single approval for translation imports instead of two core reviewers.
ko_kr: 대부분의 팀은 번역.import를 한 번에 하나의 승인 instead of 두 개의 코어 리뷰어.
ru: Большинство команд имеют однозначную Approbation для импорта перевода вместо двух core reviewer.

source: Newton cycle
ja: ニュートンサイクル
ko_kr: 뉴턴 주기
ru: Цикл Newton

source: No detail data.
ja: 詳細データなし
ko_kr: รายละเอียด 데이터 none.
ru: Без деталей.

source: Nobody should change translation files (the `.po` files in the `locale` directory) besides the bot. The next automatic import will override any change again. Therefore, leave a ``-1`` vote on any such changes and point developer to this document.
ru: Никто не должен изменять файлы перевода (файлы `.po` в директории `locale`) кроме бота. Следующий автоматический импорт снова будет замечать любые изменения и их будет отменять. Поэтому оставляйте `-1` голос за любые такие изменения и указывайте разработчикам на этот документ.

source: Note that not all translation changes are the target for translation jobs. The goal is to have consistent translated programs, UIs, and documentation. There is not much sense if only a few lines are translated. The team has decided that files that have at least 75 percent of messages translated will be in the git repositories.
ko_kr: 포인트는 모든 번역 변경이 번역 일일 jobs의 표적이 아니라는 것을 주목하십시오. 목표는-consistent 번역된 프로그램, UI 및 문서를 가지고 싶습니다. 단지 몇 줄만 번역하면 의미가 없기 때문에. 팀은 75% 이상의 메시지를 번역한 파일이 git 리포지토리에 포함될 것이라고 결정했습니다.
ru: Примечание: не все изменения перевода являются целью для переводческих задач. Цель - иметь одинаковые переведенные программы, UI и документацию. Не имеет смысла если только несколько строк переводятся. Сборная группа решила, что файлы, в которых хотя бы 75% сообщений переведены, будут находиться в репозиториях Git.

source: Note that the infra scripts run the same test, so adding it to your project is optional.
ru: Примечание: скрипты в заданиях используют `zanata-cli <http://docs.zanata.org/en/release/client/>`__ для загрузки и pushes переводной информации.

source: Note that the scripts in the tasks use `zanata-cli <http://docs.zanata.org/en/release/client/>`__ to pull and push translation content.
ko_kr: task에 사용되는 스크립트는 `zanata-cli <http://docs.zanata.org/en/release/client/>`__를 통해 번역 내용을 가져오고 푸시합니다.
ru: Примечание: этот шаг только включает переводы, а фактические переводы выполняются командой i18n-командой и они должны расставлять приоритеты, какие проекты переводить.

source: Note that this is just enabling translations, the actual translations are done by the i18n team, and they have to prioritize which projects to translate.
ru: Примечание: это просто включение перевода, а фактические переводы выполняются командой i18n-командой и они должны расставлять приоритеты, какие проекты переводить.

source: Note that you need to log into Zanata to see your activity in the above pages.
ja: 注意: Zanata にログインして上記ページで活動を確認できます。
ko_kr: 위의 페이지에서 활동을 확인하려면 Zanata 로그인해야 합니다.
ru: Примечание: для просмотра своей активности в приведенных выше страницах необходимо зарегистрироваться на Zanata.

source: Note: the period is relative short because of release cycle change
ko_kr: 이 기간은 릴리스 사이클의 짧은 시간으로 인해 단축되었습니다.
ru: Примечание: период времени относительно короткий из-за изменения цикла выпуска

source: Now you can start your translation. You can actually become an OpenStack official translator by contributing translations. You can find :doc:`various ways of contributions <contributing>`.
ja: これから、翻訳を開始できます。実際には、貢献してオープンストックの公式翻訳者になることができます。貢献する方法については :doc:`various ways of contributions <contributing>` です。
ko_kr: 번역을 시작할 수 있습니다. 번역에 참여하여 오픈 스텝 공식 번역자가 될 수 있습니다. :doc:`various ways of contributions <contributing>`
ru: Теперь вы можете начать перевод. Вы можете стать официальным переводчиком OpenStack, contributing translations. Вы можете найти :doc:`различные способы участия <contributing>`.

source: Ocata cycle
ja: Ocata サーキル
ru: Цикл Ocata

source: Odd and even values are calculated based on `ISO week numbers <https://www.timeanddate.com/date/weeknumber.html>`_.
ja: 奇数と偶数の値は `ISO 週番号 <https://www.timeanddate.com/date/weeknumber.html>`_ に基づいて計算されます。
ko_kr: odd와 even 값은 `ISO 주간 번호 <https://www.timeanddate.com/date/weeknumber.html>`_에 따라 계산됩니다.
ru: Нечетные и четные значения рассчитываются на основе `ISO недельных номеров <https://www.timeanddate.com/date/weeknumber.html>`_.

source: Of course there is no need that team coordinators do all items. You can collaborate your team members and share ideas.
ko_kr: naturally there is no need that team coordinators do all items. You can collaborate your team members and share ideas.
ru: Нaturally, нет необходимости, чтобы координаторы команды выполняли все задачи. Вы можете сотрудничать с членами своей команды и делиться идеями.

source: Official OpenStack translator
ja: オープンストックの公式翻訳者
ko_kr: 공식 오픈 스텝 번역자
ru: Официальный переводчик OpenStack

source: On the other hand, translating stable version as upstream contribution is not encouraged after the translated strings are packaged with releases. The stable version will be closed earlier than or around EOL.
ja: 一方で、ステーブルバージョンの翻訳はアップストリームの貢献として翻訳された文字列をパッケージ化した後から推奨されません。ステーブルバージョンは EOL の前に閉じられます。
ko_kr: 다만, 안정 버전을 upstream의 기여로 간주하지 않는다. 안정 버전은 릴리스와 함께 번역된 문자를 패키징한 후에 더早거나 EOL과 같은 시기에 닫히게 됩니다.
ru: В то же время, перевод стабильной версии как contributor upstream не рекомендуется после того, как переведенные строки упакованы в выпуски. Стабильная версия будет закрыта раньше или вокруг конца жизни цикла.

source: Once you find location(s) of a string you would like to check, you can check more detail context where the string is used by looking at the code in the git repository. Zanata project and git repository are one-to-one relationship. If Zanata project name is ``<Zanata-project-name>``, the corresponding git repository location is ``https://opendev.org/openstack/<Zanata-project-name>/``. For example, if you are translating ``horizon``, the git repository is found at https://opendev.org/openstack/horizon/.
ko_kr: string을 확인하고 싶은 위치를 찾은 후, string이 사용되는 더 많은 세부 정보를 확인할 수 있습니다. Zanata 프로젝트와 corresponding git 리포지토리는 1:1 관계입니다. Zanata 프로젝트 이름이 ``<Zanata-project-name>`` 인 경우, corresponding git 리포지토리의 URL은 `https://opendev.org/openstack/<Zanata-project-name>/` 이다. 예를 들어, horizon 프로젝트의 경우, git 리포지토리는 https://opendev.org/openstack/horizon/ 에 위치합니다.
ru: Когда вы найдете местоположение(а) строки, которую вы хотите проверить, вы можете проверить более детальный контекст, где строка используется, смотря на код в репозитории Git. Проект Zanata и репозиторий Git имеют однозначную связь. Если имя проекта Zanata равно ``<Zanata-project-name>``, соответствующая местоположение репозитория находится в ``https://opendev.org/openstack/<Zanata-project-name>/``. Например, если вы переводите ``horizon``, репозиторий найден на https://opendev.org/openstack/horizon/.

source: One of main goals in I18n team is to incorporate translated strings into a new release so that more global users experience translated version of OpenStack. To accomplish this goal, some of team activities need to be aligned with a release schedule.
ko_kr: I18n 팀의 주요 목표는 OpenStack의 전역 사용자에게 translated string을 포함한 새로운 릴리즈를 제공하는 것입니다. 이를 달성하기 위해 일부 팀 활동이 릴리즈 sche줄과 일치해야 합니다.
ru: Одним из основных целей команды по переводу является включение переведенных строк в новую версию, чтобы обеспечить более глобальный опыт пользователей OpenStack. Чтобы достичь этого цели, некоторые действия команды должны быть синхронизированы с графиком выпуска.

source: One way is to update the horizon code only. The following shell script fetches the latest horizon code, compiles translation message catalogs and reloads the apache httpd server. Replace ``$BRANCH`` with an appropriate branch such as ``master``, ``stable/newton`` or ``stable/mitaka``.
ja: 一つの方法は、ホライオンコードのみを更新することです。以下のスクリプトが最新のホライオンコードを取得し、翻訳メッセージカタログをコンパイルし、アップルデートされたApache HTTPドサーの再起動を実行します。 `$BRANCH` を適切なブランチに置き換えます。たとえば ``master``、``stable/newton`` または ``stable/mitaka`` です。
ko_kr: string을 업데이트하는 방법은 하나 있습니다. 다음 셸 스크립트가 latest horizon code를 fetch, translation message catalogs를 컴파일하고 apache httpd server를 reload합니다. $BRANCH에 적절한 브랜치를 사용하세요. 예를 들어, `master`, `stable/newton` 또는 `stable/mitaka`와 같은 브랜치를 사용하세요.
ru: Одна из возможных способов — обновить только код горизонта. Следующий скрипт сheckает последнюю версию кода горизонта, собирает каталоги сообщений для перевода и перезагружает сервер httpd Apache.

source: Open a POT file you find and search a string you are interested in. Then you can find an entry like:
ja: POT ファイルをオープンして、検索したい文字列を見つけます。次に、エントリのようになります:
ko_kr: POT 파일을 열고 관심 있는 문자열을 검색하세요. 그 다음에는 similar entry가 나타납니다.
ru: Открыть файл POT, который вы нашли, и найти строку, которую вы хотите перевести. Затем вы можете найти запись в виде:

source: Open discussion
ko_kr: 토론 열기
ru: Открыть дискуссию

source: Open reviews I18n repository
ko_kr: I18n 리포지토리 review 열기
ru: Открыть отзывы по переводу репозитория I18n

source: OpenStack Dashboard
ja: OpenStack ダッシュボード
ko_kr: 오픈 스톡 Dashboard
ru: Дисплей OpenStack

source: OpenStack I18n Guide
ja: OpenStack I18n ガイド
ko_kr: 오픈 스토크 I18n Guide
ru: Гид по internationalization OpenStack

source: OpenStack I18n team
ja: OpenStack I18n チーム
ko_kr: OpenStack I18n 팀
ru: Команда internationalization OpenStack

source: OpenStack I18n team is a team to coordinate all language translations and cooperation with the I18n team and the development teams. I18n team usually has a working plan.
ko_kr: OpenStack I18n 팀은 모든 언어 번역 및 I18n 팀과 개발 팀의 협력을 조정하는 팀입니다. I18n 팀은 일반적으로 작업 계획을 가지고 있습니다.
ru: Команда internationalization OpenStack - это команда координации всех переводов языков и сотрудничества с командой internationalization и командами разработки. Команда internationalization обычно имеет рабочий план.

source: OpenStack I18n team uses `Launchpad <https://bugs.launchpad.net/openstack-i18n>`_ for the bug tracking.
ja: OpenStack I18n チームは、`Launchpad <https://bugs.launchpad.net/openstack-i18n>`_ を使用してバグトラッキングを行います。
ko_kr: OpenStack I18n 팀은 <https://bugs.launchpad.net/openstack-i18n>을 사용하여 버그 트래킹을 합니다.
ru: Команда internationalization OpenStack использует <https://bugs.launchpad.net/openstack-i18n> для отслеживания ошибок.

source: OpenStack I18n team: See :ref:`label-i18n-team-contact`
ja: OpenStack I18n チーム: :ref:`label-i18n-team-contact <i18n-team-contact>`
ko_kr: OpenStack I18n 팀: :ref:`label-i18n-team-contact`를 참조하십시오.
ru: Команда internationalization OpenStack: See :ref:`label-i18n-team-contact`

source: OpenStack documents are using RST format. The steps to translate RST documents include:
ko_kr: OpenStack 문서는 RST 형식으로 사용됩니다. RST 문서 번역의 단계는 다음과 같습니다.
ru: Документы OpenStack используют формат RST. Шаги по переводу документов в RST включают:

source: OpenStack uses Zanata as a translation platform. While most operations around the translation platform are automated, if you want to communicate with the translation platform manually, you can use `Zanata CLI <http://docs.zanata.org/en/release/client/>`__.
ja: OpenStackはZanataを翻訳プラットフォームとして使用しています。翻訳プラットフォームのほとんどの作業は自動化されていますが、翻訳プラットフォームとの直接的なコミュニケーションを手動で行したい場合は、`Zanata CLI <http://docs.zanata.org/en/release/client/>`__。
ko_kr: OpenStack는 Zanata를 번역 플랫폼으로 사용합니다. 번역 플랫폼의 대부분의 연산은 tự động화되지만, 번역 플랫폼과 직접 상호작용하고 싶다면 `Zanata CLI <http://docs.zanata.org/en/release/client/>`__.
ru: OpenStack использует Zanata как платформу перевода. Хотя большинство операций вокруг платформы перевода автоматизированы, если вы хотите общаться с платформой перевода вручную, можно использовать `Клиент Zanata <http://docs.zanata.org/en/release/client/>`__.

source: Or, more convenient way would be:
ko_kr: 또는 더 편리한 방법이 있습니다.
ru: Или, более удобный способ:

source: Original string or message is not correct.
ja: 元の文字列またはメッセージが正しくありません。
ko_kr: 원래 문자 또는 메시지는 올바르지 않습니다.
ru: Оригинальная строка или сообщение неверна.

source: Other projects supported with translation jobs
ru: Другие проекты поддерживаются с помощью переводных задач

source: POT files are no longer stored in git repositories. The change was made at the beginning of Newton development cycle [#]_.
ja: POTファイルはgitリポジトリに保存されていません。Newton開発サイクル開始時に変更が行われました [#]_.
ru: Файлы POT больше не хранятся в репозиториях git. Изменение было сделано в начале цикла разработки Newton [#]_.

source: Patch on governance repository: https://review.opendev.org/#/c/213989/ (`diff <https://opendev.org/openstack/governance/commit/a229d38469c5135af496d3c739695acbe1146a76>`__)
ru: Решение по правовому управлению: https://review.opendev.org/#/c/213989/ (`diff <https://opendev.org/openstack/governance/commit/a229d38469c5135af496d3c739695acbe1146a76>`__)

source: Patch on governance repository: https://review.opendev.org/#/c/281145/ (`diff <https://opendev.org/openstack/governance/commit/8b3c83f28102c7b47688fbaca970a52a76eb6de5>`__)
ru: Решение по правовому управлению: https://review.opendev.org/#/c/281145/ (`diff <https://opendev.org/openstack/governance/commit/8b3c83f28102c7b47688fbaca970a52a76eb6de5>`__)

source: Patch on governance repository: https://review.opendev.org/#/c/351480/ (`diff <https://opendev.org/openstack/governance/commit/3aa6cb3e52944f8bed250e0714c7373605b2ebc5>`__)
ru: Решение по правовому управлению: https://review.opendev.org/#/c/351480/ (`diff <https://opendev.org/openstack/governance/commit/3aa6cb3e52944f8bed250e0714c7373605b2ebc5>`__)

source: Patch on governance repository: https://review.opendev.org/#/c/417569/ (`diff <https://opendev.org/openstack/governance/commit/bd71cefff1302ed04fc21faac5cf967365a7d7c7>`__)
ko_kr: 정책 관리 리포지토리에 대한 패치: https://review.opendev.org/#/c/417569/ (`diff <https://opendev.org/openstack/governance/commit/bd71cefff1302ed04fc21faac5cf967365a7d7c7>`__)
ru: Решение по правовому управлению: https://review.opendev.org/#/c/417569/ (`diff <https://opendev.org/openstack/governance/commit/bd71cefff1302ed04fc21faac5cf967365a7d7c7>`__)

source: Patch on governance repository: https://review.opendev.org/483452
ja: governance repository のパッチ: https://review.opendev.org/483452
ko_kr: 정책 관리 리포지토리에 대한 패치: https://review.opendev.org/483452
ru: Обновление в области управления репозиторием: https://review.opendev.org/483452

source: Patch on governance repository: https://review.opendev.org/532982
ja: governance repository のパッチ: https://review.opendev.org/532982
ko_kr: 정책 관리 리포지토리에 대한 패치: https://review.opendev.org/532982
ru: Обновление в области управления репозиторием: https://review.opendev.org/532982

source: Patch on governance repository: https://review.opendev.org/586751
ja: governance repository のパッチ: https://review.opendev.org/586751
ko_kr: 정책 관리 리포지토리에 대한 패치: https://review.opendev.org/586751
ru: Обновление в области управления репозиторием: https://review.opendev.org/586751

source: Patch on governance repository: https://review.opendev.org/633398
ja: governance repository のパッチ: https://review.opendev.org/633398
ko_kr: 정책 관리 리포지토리에 대한 패치: https://review.opendev.org/633398
ru: Обновление в области управления репозиторием: https://review.opendev.org/633398

source: Period: 2015-08-01 to 2016-01-30
ja: 期間: 2015-08-01 ~ 2016-01-30
ko_kr: 시기: 2015-08-01 ~ 2016-01-30
ru: Период: 2015-08-01 - 2016-01-30

source: Period: 2016-02-01 to 2016-07-31
ja: 年月日: 2016/02/01 ～ 2016/07/31
ko_kr: 시기: 2016-02-01 ~ 2016-07-31
ru: Период: 2016-02-01 - 2016-07-31

source: Period: 2016-08-01 to 2017-01-05
ja: 年月日: 2016/08/01 ～ 2017/01/05
ko_kr: 시기: 2016-08-01 ~ 2017-01-05
ru: Период: 2016-08-01 - 2017-01-05

source: Period: 2017-01-06 to 2017-06-30
ja: 年月日: 2017/01/06 ～ 2017/06/30
ko_kr: 시기: 2017-01-06 ~ 2017-06-30
ru: Период: 2017-01-06 - 2017-06-30

source: Period: 2017-07-01 to 2018-01-10
ja: 年月日: 2017/07/01 ～ 2018/01/10
ko_kr: 시기: 2017-07-01 ~ 2018-01-10
ru: Период: 2017-07-01 - 2018-01-10

source: Period: 2018-01-11 to 2018-07-09
ja: 年月日: 2018/01/11 ～ 2018/07/09
ko_kr: 시기: 2018-01-11부터 2018-07-09까지
ru: Период: 2018-01-11 - 2018-07-09

source: Period: 2018-07-10 to 2019-01-25
ja: 期間： 2018年7月10日から 2019年1月25日
ko_kr: 시기: 2018-07-10부터 2019-01-25까지
ru: Период: 2018-07-10 до 2019-01-25

source: Period: from 2014-11-01 to 2015-07-16
ja: 期間： 2014年11月1日から 2015年7月16日
ko_kr: 시기: 2014-11-01부터 2015-07-16까지
ru: Период: с 2014-11-01 по 2015-07-16

source: Pike cycle
ja: ピークサイクル
ko_kr: 피크 사이클
ru: Цикл Пика

source: Previous meetings
ja: 前回の会議
ko_kr: 이전 회의
ru: Предыдущие встречи

source: Previously ``setup.cfg`` needed sections ``compile_catalog``, ``update_catalog``, and ``extract_messages`` and a ``babel.cfg`` file. These are not needed anymore and can be removed.
ru: Недостающие секции ``compile_catalog``, ``update_catalog``, и ``extract_messages`` и файл ``babel.cfg``. Эти секции больше не необходимы и можно их удалить.

source: Project Goals And Translation Plan
ko_kr: 프로젝트 목표 및 번역 계획
ru: Цели проекта и план перевода

source: Project configuration
ja: プロジェクト設定
ko_kr: 프로젝트 구성
ru: Конфигурация проекта

source: Project maintenance
ja: プロジェクトのメンテナンス
ko_kr: 프로젝트 유지 관리
ru: Обслуживание проекта

source: Projects affecting StringFreezes
ko_kr: Project이 StringFreeze에 영향을 미치는 것들
ru: Проекты, которые влияют на StringFreezes

source: Propose a change to the ``openstack/project-config`` repository including the following changes:
ru: Предложить изменения в репозитории ``openstack/project-config`` включая следующие изменения:

source: Pull translations from Zanata
ja: Zanataから翻訳を取得する
ko_kr: Zanata에서 번역을 pull하십시오
ru: Получить переводы из Zanata

source: Python Projects
ru: Проекты на Python

source: Python script to setup projects for Zanata
ja: Zanataにプロジェクトを設定するための Python スクリプトを作成する
ko_kr: Zanata를 위한 프로젝트 설정을 위한 Python 스크립트
ru: Скрипт Python для настройки проектов для Zanata

source: Queens cycle
ja: クイーンサイクル
ko_kr: 퀸스 사이클
ru: Цикл королев

source: ReactJS Projects
ko_kr: ReactJS 프로젝트
ru: Проекты на ReactJS

source: Register a user ID in Zanata
ja: ZanataにユーザーIDを登録する
ko_kr: Zanata에서 사용자 ID를 등록하세요.
ru: Регистрируйте ID пользователя в Zanata

source: Release Management
ko_kr: 리リース 관리
ru: Управление релизами

source: Replace ``$BRANCH`` with an appropriate branch such as ``master``, ``stable/newton`` or ``stable/mitaka``.
ja: $BRANCH の適切なブランチを ``master``、``stable/newton`` または ``stable/mitaka`` に置き換えください。
ko_kr: ``$BRANCH``을 적절한 브랜치와 같은 ``master``, ``stable/newton`` 또는 ``stable/mitaka``로 대체하세요.
ru: Замените ``$BRANCH`` на подходящую ветку, например ``master``, ``stable/newton`` или ``stable/mitaka``.
