Repository: openstack-kr/knu_i18n_2025
Catalog: po/i18n-docs-source-locale-*.po
Languages: ja, ko_kr, ru

source: (optional) Put your language name as bug tag.
ja: (オプション) 自分の言語名をバグタグとして入力してください。
ko_kr: (선택 사항) 언어 이름을 버그 태그로 입력하세요.
ru: (опционально) Введите имя вашего языка в качестве тэга ошибки.

source: **Make sure to include your English language name in a bug summary**. It is also suggested to write a bug summary in English. For example:
ja: **英語の言語名をバグサマリーに含めて、確かめることが重要です。** また、英語でバグサマリーを書くことを推奨します。例えば:
ko_kr: **영어 언어 이름을 버그 요약에 포함해 주세요. 또한 영어 버그 요약을 작성하는 것을 추천합니다. 예를 들어:
ru: **Соответствуйте включить ваше английское имя языка в описании ошибки**. Это также рекомендуется написать описание ошибки на английском языке. Например:

source: **tox** is available on PyPI and also available in various Linux distribution. ``pip install tox`` or ``apt-get install python-tox`` (in case of Ubuntu) installs **tox**.
ko_kr: **tox**은 PyPI에서 사용할 수 있으며 다양한 리눅스 배포판에서도 사용할 수 있습니다. ``pip install tox`` 또는 ``apt-get install python-tox`` (Ubuntu의 경우)로 **tox**를 설치합니다.
ru: **tox** доступен на PyPI и также доступен в различных Linux-версиях. ``pip install tox`` или ``apt-get install python-tox`` (в случае Ubuntu)(instаллирует)** tox**.

source: :doc:`Your language team <lang_team>` may have useful information to help our translation efforts including translation guidelines, priorities, communication tools and so on. It is worth visited. You can find your language team page at https://wiki.openstack.org/wiki/I18nTeam/team. If you have questions, you can contact your coordinators.
ja: :doc:`Your language team <lang_team>` は有用な情報を提供するために、翻訳ガイドライン、優先度、コミュニケーションツールなどを含むものがあります。 そのページは https://wiki.openstack.org/wiki/I18nTeam/team で見つけることができます。質問がある場合は、自分のコーディネーターに連絡してください。
ko_kr: :doc:`Your language team <lang_team>`가 유용한 정보를 제공하는 데 도움이 될 수 있으며 번역 efforts에 도움을 줄 수 있는 번역 지침, 우선순위, 통신 도구와 같은 것입니다. 그것은 worth 방문하도록합니다. 언어 팀 페이지는 https://wiki.openstack.org/wiki/I18nTeam/team에서 찾을 수 있습니다. 질문이 있으면 your coordinators와 연락해 주세요.
ru: :doc:`Ваш языковый команду <lang_team>` может иметь полезную информацию, чтобы помочь нашим усилиям по переводу включая руководство по переводу, приоритеты, инструменты связи и так далее. Это стоит посещения. Вы можете найти страницу вашего языкового команду на https://wiki.openstack.org/wiki/I18nTeam/team. Если у вас есть вопросы, вы можете связаться с координаторами.

source: :ref:`search`
ko_kr: search
ru: Поиск

source: A glossary file of your language is found at ``glossary/locale/<lang>/LC_MESSAGES/glossary.po`` in the i18n repository. The file is a usual PO file.
ko_kr: glossary/locale/<lang>/LC_MESSAGES/glossary.po
ru: Справочник языка находится в ``glossary/locale/<lang>/LC_MESSAGES/glossary.po`` в репозитории i18n. Файл является обычным PO-файлом.

source: A person who can proofread translations and mark them as reviewed (approved) or rejected.
ko_kr: proofreader
ru: Личность, которая может проверить переводы и отметить их как отредактированными (подтвержденными) или отклоненными.

source: A person who can submit translations.
ko_kr: translator
ru: Личность, которая может подать переводы.

source: A privileged member in a translation team who can help in team management tasks, such as approving new members and reviewing contributions to that language. We also have task coordinators for specific tasks.
ko_kr: team lead
ru: Правительствующий член группы перевода, который может помочь в задачах управления командой, таких как утверждение новых участников и проверка вклада для того языка. Мы также имеем координаторов задач для конкретных задач.

source: A series of tasks in OpenStack infrastructure is used to manage translation changes in Zanata. Without running the tasks, translation changes will not be reflected into OpenStack projects. This page explains how the infrastructure tasks run actual scripts as `Zuul <https://docs.openstack.org/infra/zuul/>`_ jobs and monitor the job status.
ko_kr: OpenStack infrastruture의 task 시리즈는 Zanata에서 번역 변경을 관리합니다. task를 실행하지 않으면 번역 변경은 OpenStack 프로젝트에 반영되지 않습니다. 이 페이지에서는 실제 스크립트가 `Zuul <https://docs.openstack.org/infra/zuul/>`_ jobs로 실행되고 job 상태를 모니터링하는 방법을 설명합니다.
ru: Серия задач в инфраструктуре OpenStack используется для управления изменениями перевода в Zanata. Без выполнения задач изменения перевода не будут отражены в проектах OpenStack. Эта страница объясняет, как инфраструктурные задачи запускают реальные скрипты как `Zuul <https://docs.openstack.org/infra/zuul/>`_ задачи и мониторят статус задач.

source: A template is a skeleton of static HTML files. In this case, the string is perhaps used in "Update" form in "Container" menu.
ko_kr: 템플릿은 정적 HTML 파일의 뼈대입니다. 이 경우, string은 "Container" 메뉴의 "Update" 형태의 string일 수 있습니다.
ru: Шаблон - это сkeleton статических файлов HTML. В этом случае строка, возможно, используется в «Обновление» форме в «Контейнерном» меню.

source: ATC Statistics in past releases
ko_kr: past releases의 ATC 통계
ru: Статистика ATC прошлых выпусков

source: ATC candidates are translators who has translated more than 200 words and reported their e-mail and name to language coordinators, and also signed ICLA.
ko_kr: ATC 후보자들은 200 단어 이상 번역을 완료하고 언어 조정자에게 이메일과 이름을 보고 ICLA를 서명한 번역가입니다.
ru: Кандидаты на ATC - переводчики, которые перевели более 200 слов и подали свою электронную почту и фамилию координаторам языка, а также подписались под ICLA.

source: ATC members of I18n project
ja: ATC メンバーのI18nプロジェクト
ko_kr: I18n 프로젝트의 ATC 구성원
ru: Члены проекта i18n

source: About this guide
ja: このガイドについて
ko_kr: 이 가이드에 대해 biết고 싶은 것
ru: Описание этой руководства

source: Add Translation Server Support
ru: Добавить поддержку сервера перевода

source: Add the jobs to your pipelines.
ru: Добавьте задачи в свои pipelines.

source: After the documents are translated and reviewed well, updating existing ``www/<lang>/index.html`` or creating a new language landing page is needed.
ko_kr: 문서가 잘 번역되고 검토된 후, 현재 www/<lang>/index.html 또는 새로운 언어 랜딩 페이지를 생성해야 합니다.
ru: После перевода и проверки документов, необходимо обновить существующие ``www/<lang>/index.html`` или создать новый лендинг для языка.

source: After the official release, translating master version is welcome for upstream translation contribution, but the original strings may be changed frequently due to upstream development on the projects.
ja: 公式リリース後は、上游翻訳の貢献がwelcomeですが、オリジナル文字列は頻繁に変更される可能性があります。上流開発で原因となるためです。
ko_kr: 공식 릴리스 이후, 원본 문자열이 자주 변경될 수 있기 때문에 업스트림 번역에 참여할 수 있습니다. 하지만 마스터 버전을 번역하는 것은 유용합니다.
ru: После официального выпуска, перевод master версии приветствуется для вклада в переводы upstream, но исходные строки могут быть изменены часто из-за разработки upstream на проектах.

source: After you edit the master glossary, ensure to reflect the change to all language glossary files. To do this, run the following command.
ja: マスター辞書を編集した後、すべての言語辞書ファイルに変更を反映することを確認してください。これを行うには、以下のコマンドを実行します。
ko_kr: 마스터 glossary를 편집한 후, 모든 언어 glossary 파일에 변경 사항을 반영하십시오. 이 작업을 수행하기 위해 다음 명령을 실행하세요.
ru: После редактирования мастерской словаря, убедитесь, что отражены изменения в всех файлах словарей языков. Чтобы сделать это, запустите следующий команд.

source: All upstream OpenStack documents in ``openstack-manuals`` and project repositories use ``master`` branch and can have stable branches depending on release models and maintaining documents in different project teams. Cross-project liaisons are strongly encouraged to communicate with I18n team so that I18n team can discuss and decide which stable documents are the target in I18n team and when translators start to translate stable documents.
ko_kr: openstack-manuals 및 프로젝트 리포지토리의 모든 상위 오픈 스텝 문서는 ``master`` 브랜치를 사용하고 릴리스 모델과 유지 관리하는 문서를 다른 프로젝트 팀에서 유지하는 경우 안정적인 브랜치는 사용할 수 있습니다. Cross-project liaisons은 강력히 I18n 팀과 통화하여 I18n 팀이 안정적인 문서를 목표로 discussing 및 결정하고, 번역자들이 안정적인 문서를 번역하기 시작할 때까지 discussion을 하도록 지시합니다.
ru: Все верхестранние документы OpenStack в ``openstack-manuals`` и репозиториях проекта используются ветку ``master`` и могут иметь стабильные ветки в зависимости от моделей выпуска и поддержания документов в разных командах проекта. Сочувствием кross-проектным лiaisонам strongly recommended communicate with I18n team, чтобы I18n team could discuss and decide which stable documents are the target in I18n team and when translators start to translate stable documents.

source: Also, release notes translations are only needed on master since release notes are published only from master, the translations get removed on stable branches.
ko_kr: 또한 릴리스 노트 번역은 only master에서만 필요하며 릴리스 노트는 only master에서만 출판됩니다. 안정적인 브랜치는 번역이 제거되므로, 릴리스 노트 번역은 master에서만 필요합니다.
ru: Кроме того, переводы заметок об обновлении доступны только на ветке ``master``, поскольку заметки об обновлении публикуются только из ``master``, а переведенные тексты удаляются на стабильных ветках.

source: Although each language team could follow the I18n team working plan, your team may also decide your own work items and priorities as a language team.
ko_kr: 각 언어 팀은 I18n 팀의 작업 계획을 따르기 위해 할 수 있지만, आपक은 또한 자신의 작업 항목과 우선순위를 결정할 수 있습니다. language 팀입니다.
ru: Хотя каждая команду языка может следовать плану I18n командой, ваша команда также может решить свои собственные задачи и приоритеты как команда языка.

source: Amandeep Singh Saini (jimidar) - Punjabi (India)
ja: Amandeep Singh Saini (jimidar) - インド (パunjABI)
ko_kr: Amandeep Singh Saini (jimidar) - 인도 (पंजाबी)
ru: Амандип Синг Синги (jimidar) - Пunjabi (Индия)

source: Another convenient way is to check dashboard translations is to run DevStack in your local environment. To run DevStack, you need to prepare ``local.conf`` file, but no worries. Several ``local.conf`` files are shared on the Internet and a minimum example is shown below. From our experience, you need a machine with two or four CPU cores, 8 GB memory and 20 GB disk to run DevStack comfortably. If you enable just major OpenStack projects, the machine requirement would be much smaller like 2~4GB memory.
ja: DevStack をローカル環境で実行することで、ダッシュボードの翻訳をチェックする別の便利な方法はあります。 DevStack を実行するには、``local.conf`` ファイルを準備する必要がありますが、心配する必要はありません。インターネット上では ``local.conf`` ファイルが複数共有されており、最小の例は以下に示されています。 そのうちのいくつかの ``local.conf`` ファイルは、DevStack のバージョンによって異なります。 また、DevStack のバージョンによっては、 ``local.conf`` ファイルが必要ありません。 DevStack を実行するには、2 つの CPU コア以上、8 GB メモリ、20 GB ディスクを使用する必要があります。 ただし、主な OpenStack プロジェクトのみを使用すると、メモリのサイズは 2~4 GB になります。
ko_kr: 다른 편리한 방법은 로컬 환경에서 DevStack를 실행하여 디스플레이 translation을 확인하는 것입니다. DevStack를 실행하려면 ``local.conf`` 파일을 준비해야 합니다. 그러나 keine Sorge. 여러 ``local.conf`` 파일이 인터넷에 공유되어 있으며 최소 예시가 아래와 같습니다. 우리의 경험에 따르면, 두 개 이상의 CPU 코어, 8 GB 메모리 및 20 GB 디스크를 사용하여 DevStack를 편안하게 실행할 수 있습니다. 단, 주요 오픈 스톡 프로젝트만을 활성화하면, 2~4GB 메모리가 sufficient합니다.
ru: Другой удобный способ проверить переводы на панели управления — запустить DevStack в местной среде. Чтобы запустить DevStack, необходимо подготовить файл ``local.conf``, но не беспокойтесь. Several ``local.conf`` files are shared on the Internet and a minimum example is shown below. From our experience, you need a machine with two or four CPU cores, 8 GB memory and 20 GB disk to run DevStack comfortably. If you enable just major OpenStack projects, the machine requirement would be much smaller like 2~4GB memory.

source: As a minimal check that the translation files that are imported are valid, you can add to your lint target (``pep8`` or ``linters``) a simple ``msgfmt`` test:
ru: Как минимальный проверый способ убедиться, что импортированные файлы переводов являются допустимыми, можно добавить к цели lint (``pep8`` или ``linters``) простой ``msgfmt`` тест:

source: As a translator, if reported bugs turns out beyond a translation bug, it is better to ask I18n team members via the mailing list or the IRC channel. They can handle such bugs.
ja: 翻訳者として、報告されたバグが翻訳上の問題である場合、I18n チームのメンバーにメールリストや IRCチャを通じて連絡するのがよいでしょう。 I18n チームはそのような問題を処理できます。
ko_kr: 翻訳者로서, báo cáo出的 lỗi가 전訳 오류가 아니라면, 이18n 팀의 멤버를 매일지나 또는 IRC 채널을 통해 hỏi하는 것이 좋습니다. 그들은 이러한 문제를 처리할 수 있습니다.
ru: Как translator, если отчетные ошибки оказываются за пределами переводной ошибки, лучшеask I18n team members via the mailing list or the IRC channel. They can handle such bugs.

source: As with I18n Core Team, the same things apply here. Launchpad I18n Core Team focuses on determining the importance of a translation and/or I18n bug and triaging bug priorities. You can find the member list on `Launchpad I18n Core Member list <https://launchpad.net/~openstack-i18n-core>`__.
ko_kr: I18n Core 팀과 마찬가지로, 여기에서도 동일한 것들이 적용됩니다. Launchpad I18n Core 팀은 번역의 중요도와/or 이18n 오류의 우선순위를 결정하고 bug 우선순위를_triaging합니다. Launchpad I18n Core 팀 멤버 목록은 <https://launchpad.net/~openstack-i18n-core>`__에서 확인할 수 있습니다.
ru: Как и с I18n Core Team, то же самое applies here. Launchpad I18n Core Team focuses on determining the importance of a translation and/or I18n bug and triaging bug priorities. You can find the member list on `Launchpad I18n Core Member list <https://launchpad.net/~openstack-i18n-core>`__.

source: Bugs in a source project
ja: ソースプロジェクト内のバグ
ko_kr: 원본 프로젝트의 오류
ru: Были найдены ошибки в исходном проекте

source: Bugs in tool chains
ja: ツールチェーン内のバグ
ko_kr: 도구 链에 대한 버그
ru: Ошибки в цепочках инструментов

source: Bugs in translated documents or dashboard are mainly classified into the following areas:
ja: 翻訳されたドキュメントまたはダッシュボードのバグは、以下の領域に分類されます:
ko_kr: 번역된 दस장이나 디스플레이의 버그는 다음 영역으로 mainly 분류됩니다.
ru: Ошибки в переведенных документах или дашборде в основном классифицируются в следующих областях:

source: Bugs to report English strings are hard to translate in your language. For example, translators cannot control the order of words, or a plural form is not supported. Usually, this kind of bugs are in the original strings and cannot be fixed just by changing the strings and more work is needed.
ja: 英語のストリングを報告するバグは、your languageで翻訳が難しいです。たとえば、翻訳者は単語の順序を制御できません。また、複数形はサポートされていません。通常、この種のバグは元の文字列にありますが、文字列のみを変更するだけで修正できないため、さらに多くの作業が必要です.
ko_kr: 영어 문자열을 번역하는 데 버그를 báo려할 때는 어렵습니다. 예를 들어, 번역자들은 단어의 순서를 제어할 수 없고, 복수형이 지원되지 않는 경우가 있습니다. 일반적으로 이러한 종류의 버그는 원본 문자열에あり, 단순히 문자열을 변경하면 해결되지 않기 때문에 더 많은 작업이 필요합니다.
ru: Ошибки, которые необходимо отчитывать на английские строки, трудно переводить на ваш язык. Например, переводчики не могут контролировать порядок слов, или не поддерживается множественное число. Usually, это kind of bugs находятся в исходных строках и не могут быть исправлены только изменением строк и требуется больше работы.

source: Building
ja: ビルド
ko_kr: 건설
ru: Строение

source: Building: Build HTML from RST documents and the translated results.
ko_kr: 건설: RST दस장에서 HTML을 건설하고 번역 결과를 사용합니다.
ru: Строение: Составление HTML из документов по RST и переведенных результатов.

source: Builds release notes in both the original (English) version and translated versions (if any).
ja: リリースノートを、元の英語版と翻訳されたバージョンの両方で作成します。
ko_kr: English 원본 버전과 번역된 버전(만약 존재한다면)에서 릴리스 노트를 생성합니다.
ru: Создает отчеты об выпуске в обоих вариантах - исходном (английском) и переведенном (если имеется).

source: CLI (command line interface)
ja: コマンドラインインターフェイス (CLI)
ko_kr: CLI (명령 줄 인터페이스)
ru: КLI (командная строка интерфейса)

source: Carries out the second Zuul job (Syncing into repos) by executing `propose_translation_update.sh <https://opendev.org/openstack/openstack-zuul-jobs/src/roles/prepare-zanata-client/files/propose_translation_update.sh>`__
ru: Выполняет вторую работу Zuul (Синхронизация в репозитории) путем выполнения `propose_translation_update.sh <https://opendev.org/openstack/openstack-zuul-jobs/src/roles/prepare-zanata-client/files/propose_translation_update.sh>`__

source: Check from time to time open reviews on `I18n repo <https://review.opendev.org/#/q/project:openstack/i18n+status:open>`__. In addition to the PTL, the core reviewers are responsible.
ko_kr: 시각적으로 열린 리뷰를 확인하여 시간이 지남에 따라 I18n repo <https://review.opendev.org/#/q/project:openstack/i18n+status:open>`에 대한 오픈 리뷰를 확인하세요. PTL 이외에도 코어 리뷰어들이 책임지며 있습니다.
ru: Проверяйте время от времени открытые обзоры на `Репозиторий перевода <https://review.opendev.org/#/q/project:openstack/i18n+status:open>`__. Кроме ПТЛ, основные рецензенты несут ответственность.

source: Checking Translation Imports
ru: Проверка импорта переводов

source: Click "..." on the right, and select "Request to join team".
ja: クリックして右側に「...」をクリックし、「チームへの参加を求める」を選択する。
ko_kr: 오른쪽의 "..."을 클릭하고 "팀에 참여하기」の 요청을 선택합니다.
ru: Нажмите на правую часть и выберите «Запрос на присоединение к команде».

source: Click "Languages" on the top, all languages will be listed.
ja: 英語を選択するには、上部の「言語」ボタンをクリックしてください。
ko_kr: 顶部의 "언어"를 클릭하면 모든 언어가 표시됩니다.
ru: Нажмите на «Языки» вверху, все языки будут liệt themselves.

source: Click "Log in" button.
ja: ログインボタンをクリックしてください。
ko_kr: 로그인 버튼을 클릭하세요.
ru: Нажмите кнопку «Войти».

source: Click the language you want to translate, the language page will be shown.
ja: 選択した言語をクリックすると、言語ページが表示されます。
ko_kr: 번역할 언어를 선택하십시오. 번역 언어 페이지가 표시됩니다.
ru: Нажмите язык, который вы хотите переводить, и будет показана страница языка.

source: Common code used by **propose_translation_update.sh** and **upstream_translation_update.sh**
ja: **propose_translation_update.sh**や**upstream_translation_update.sh**で使用される共通コード
ko_kr: **propose_translation_update.sh** 및 **upstream_translation_update.sh**에 사용되는 일반적인 코드
ru: Общий код, используемый ** propose_translation_update.sh ** и ** upstream_translation_update.sh **

source: Contents
ko_kr: 내용
ru: Содержимое

source: Contributing
ja: 貢献する
ko_kr: 참여
ru: Участие

source: Convention
ja: 規則
ko_kr: 전통
ru: Конвенция

source: Coordinator
ja: 運営者
ko_kr: 주도자
ru: Координатор

source: Create file ``babel-djangojs.cfg`` with the following content:
ru: Создайте файл babel-djangojs.cfg с содержимым:

source: Create file ``babel-django.cfg`` with the following content:
ru: Создайте файл babel-django.cfg с содержимым:

source: Creating a Language Team
ja: 言語チームを作成する
ko_kr: 언어 팀을 생성합니다
ru: Создание команды языковых специалистов

source: Cross Project Liaisons
ko_kr: 교차 프로젝트 협력자
ru: Корrespondенты между проектами

source: Daily Work
ko_kr: 일상 일상
ru: Рабочие дни

source: Discuss and review glossary changes in your language team before you propose changes to the Gerrit review system. Reviewers in the Gerrit review system cannot understand your language in most cases, so they can only check syntax or conventions.
ja: 言語チームの辞書変更を議論して検討する前に、Gerrit リビューシステムに提案します。Gerrit リビューシステムでは、ほとんどの場合、レビュアーはあなたの言語を理解できません。したがって、規則や慣習のみをチェックできます。
ko_kr: 语言团队中 glossary 변경的讨论和审查之前，请在 Gerrit 评论系统提出更改。Gerrit 评论系统中的审查者大多数情况下无法理解您的语言，因此他们只能检查语法或约定.
ru: Обсуждать и оценивать изменения словаря в своей команде языка до того, как вы предлагаетете изменения в систему обзора Gerrit. Рецентники системы обзора Gerrit не могут понять ваш язык в большинстве случаев, поэтому они могут только проверять синтаксис или нормы

source: Django Projects
ko_kr: Django 프로젝트
ru: Дjangовские проекты

source: Documentation
ko_kr: 文档
ru: Документация

source: Documentation projects
ko_kr: 文档 프로젝트
ru: Проекты документации

source: Downloading
ko_kr: 다운로드
ru: Загрузка

source: Downloading: Download the translated results by automation scripts.
ko_kr: 다운로드: 자동 스크립트를 통해 번역 결과를 다운로드 하십시오.
ru: Скачивание: Скачать переведенные результаты с помощью автоматизированных скриптов.

source: During translating a dashboard related project, you may want to know "where is this string used in the dashboard?".
ko_kr: 번역 중인 댈러그 관련 프로젝트에서, '이 문자는 댈러그에서 사용되는 위치를 biết고 싶다.'라는 것을 알고 싶을 수 있습니다.
ru: В course translating a dashboard related project, you may want to know "where is this string used in the dashboard?".

source: Each language team has useful information to help our translation efforts. It is worth visited. You can find your language team at https://wiki.openstack.org/wiki/I18nTeam/team.
ko_kr: 각 언어 팀은 번역에 도움이 되는 유용한 정보가 있습니다. 이 URL을 방문해 보세요: https://wiki.openstack.org/wiki/I18nTeam/team.
ru: Каждый языковый команду имеет полезную информацию, которая помогает нашим пускам перевода. Это стоит посещения. Вы можете найти свой языковый команду на https://wiki.openstack.org/wiki/I18nTeam/team.

source: Each language team may have useful information to help our translation efforts including translation guidelines, priorities, communication tools and so on. It is worth visited. You can find your language team page at https://wiki.openstack.org/wiki/I18nTeam/team. If you have questions, you can contact your coordinators.
ru: Каждый языковый команду может иметь полезную информацию, которая помогает нашим пускам перевода, включая руководства по переводу, приоритеты, инструменты связи и так далее. Это стоит посещения. Вы можете найти страницу команды на https://wiki.openstack.org/wiki/I18nTeam/team. Если у вас есть вопросы, вы можете связаться с координаторами.

source: Edit file ``gerrit/projects.yaml`` and add the ``translate`` option:
ru: Редактируйте файл ``gerrit/projects.yaml`` и добавьте опцию ``translate``:

source: Edit file ``zuul.d/projects.yaml`` and add a template which defines translation jobs to your repository:
ru: Измените файл ``zuul.d/projects.yaml`` и добавьте шаблон, который определяет переводные задачи, к вашему репозиторию:

source: Every day, new translations get imported into the repositories using a proposal job. These need to have a review on whether the bot worked properly. You can see all open reviews in `Gerrit <https://review.opendev.org/#/q/status:open+topic:zanata/translations,n,z>`_. The subject of these patches is always "Imported Translations from Zanata".
ru: Каждый день новые переводы вносятся в репозитории с помощью предложения работы. Эти должны иметь отзыв на то, работал ли бот правильно. Вы можете увидеть все открытые отзывы в `Gerrit <https://review.opendev.org/#/q/status:open+topic:zanata/translations,n,z>`_. Вопрос этих(patchей) всегда "Введены переводы из Zanata".

source: Everybody can propose agenda topics on `I18nTeamMeeting Wiki Page <https://wiki.openstack.org/wiki/Meetings/I18nTeamMeeting#Agenda_for_next_meeting>`_. If there are no topics proposed, the meeting might be canceled for that week.
ru: Каждый может предложить тему для следующего собрания по вопросам перевода. Если нет тем, то собрание может быть отменено за эту неделю.

source: Everyone in the OpenStack community is glad to help you.
ru: Всех в сообществе OpenStack с радостью помогать вам.

source: Extract Zanata user information
ko_kr: Zanata 사용자 정보를 추출합니다
ru: Извлеките информацию из пользователя Zanata

source: Extracting
ko_kr: 추출 중입니다
ru: Выводить

source: FAQ: I cannot find my name in Stackalytics
ja: FAQ: 我はStackalyticsで名前を見つけることができません
ko_kr: FAQ: 스택앤트리클스에서 이름을 찾지 못했습니다.
ru: FAQ: Я не могу найти свой номер в Stackalytics

source: Finally, propose a patch including all of the above changes to the Gerrit review system.
ja: 最後に、上記のすべての変更を含むパッチをGerritレビューシステムに提案してください。
ko_kr: 마지막으로, 위의 모든 변경 사항을 포함한 패치 제안을 Gerrit 리뷰 시스템에 제안합니다.
ru: Наконец, предлагайте patches с включением всех вышеуказанных изменений в систему отзыва на Gerrit.

source: Finally, we could generate HTML files by
ko_kr: 마지막으로, HTML 파일을 생성할 수 있습니다.
ru: Наконец, мы могли бы вывести HTML-файлы

source: Finding and reporting translation bugs is an important step towards better quality of translations in OpenStack.
ja: 翻訳のバグを探し、報告することは、OpenStackの翻訳品質の向上につながる重要なステップです。
ko_kr: OpenStack 번역의 chất lượng를 향상시키는 데 번역 오류를 발견하고 보고하는 것은 중요한 단계입니다.
ru: Ищем и сообщаем о ошибках перевода - это важный шаг к лучшему качеству переводов в OpenStack.

source: First enable translation in your project, depending on whether it is a Django project, a Python project or a ReactJS project.
ru: Включите перевод в вашем проекте, в зависимости от того, является ли это Django-проектом, Python-проектом или ReactJS-проектом.

source: Fixing I18n bugs
ja: I18nバグを修正する
ko_kr: I18n 오류를修复합니다.
ru: Решение ошибок перевода
