Repository: openstack-kr/knu_i18n_2025
Catalog: po/i18n-docs-source-locale-*.po
Languages: ja, ko_kr, ru

source: This is written about openstack-manuals project. As of the end of Pike development cycle, `the document migration community-wide effort <https://specs.openstack.org/openstack/docs-specs/specs/pike/os-manuals-migration.html>`__ is being done. The process documented here might be changed in near future.
ko_kr: 이 문서는 openstack-manuals 프로젝트에 대해 쓰여져 있습니다. Pike 개발 사이클의 끝까지, `openstack docs specs specs.pike.os-manuals-migration.html` <https://specs.openstack.org/openstack/docs-specs/specs.pike/os-manuals-migration.html> _의 문서 전환 공동체 활동이 진행 중입니다. 이處문서에 설명된 프로세스는 가까운 미래에 변경될 수 있습니다.
ru: Эта запись написана о проекте openstack-manuals. В конце Pike цикла разработки, «документация миграция общественным effort <https://specs.openstack.org/openstack/docs-specs/specs/pike/os-manuals-migration.html>`__ делается. Процесс, описанный здесь, может быть изменен в ближайшем будущем.

source: This list is a cache of information on Zanata, and we need to keep it synced with Zanata.
ja: Zanataに関する情報のキャッシュリストであり、Zanataと同期する必要があります。
ko_kr: 이 목록은 Zanata에 대한 정보를 캐시하고, Zanata와 synced रहन해야 합니다.
ru: Этот список является кэшом информации о Zanata, и нам нужно его synchronизировать с Zanata.

source: This means "Aggregates" menu in "Admin" group in the left side menu. In Horizon code, the second level corresponds to a dashboard group like "Project" or "Admin" and the third level corresponds to a panel like "Aggregates" (in this example), "Instances" or "Networks".
ja: 「Aggregates」メニューは左側メニューよりも「Admin」グループにあります。このHorizonコードでは、2番目のレベルは「プロジェクト」や「Admin」などのダッシュボードグループを表し、3番目のレベルは「Aggregates」(この例では「インスタンス」や「ネットワーク」)などのパネルを表します。
ko_kr: 이것은 "Admin" 그룹의 "Aggregates" 메뉴를 의미합니다. Horizon 코드에서, 두 번째 수준은 프로젝트나 Admin과 같은 디스플레이 그룹을 나타내고, 세 번째 수준은 Aggregates(예시), Instances 또는 Networks와 같은 패널을 나타냅니다.
ru: Это означает «Агрегаты» меню в «Admin» группе в левой части меню. В Horizon коде второе уровня соответствует группе дашборда, как «Проект» или «Admin», а третий уровень corresponds к панели, как «Aggregates» (в этом примере), «Instances» или «Networks».

source: This page collects small tips and tricks around translations.
ja: 翻訳に関する小さなトリックとスニペットが収集されています。
ko_kr: 이 페이지는 번역에 대한 작은 팁과 트릭을 모아두고 있습니다.
ru: Эта страница собирает небольшие рекомендации и трюки по переводам.

source: This page covers various operations around i18n activities.
ja: このページでは、i18n 活動のさまざまなオペレーションについて説明しています。
ko_kr: 이 페이지는 i18n 활동에 대한 다양한 연산을 다룹니다.
ru: Эта страница охватывает различные операции вокруг деятельности i18n.

source: This page describes how end users can report translation bugs.
ja: このページでは、エンドユーザーが翻訳バグを報告する方法について説明します。
ko_kr: 이 페이지는 사용자들이 번역 오류를 보고รายงาน하는 방법에 대해 설명합니다.
ru: Эта страница описывает, как пользователи конечного уровня могут отчетно сообщать об ошибках перевода.

source: This page describes the conventions and tips on writing this guide itself.
ja: このガイドの書き方に関する規則とアドバイスについて説明します。
ko_kr: 이 페이지는 이 가이드를 작성하는 규칙과 지침을 설명합니다.
ru: Эта страница описывает нормы и рекомендации по написанию этой руководства самого себя.

source: This page documents what I18n team concerns and which things are needed to do with OpenStack releases. Each OpenStack release has around 6-month cycle and the corresponding schedule is available on https://releases.openstack.org/ (e.g., https://releases.openstack.org/ocata/schedule.html describes Ocata release schedule).
ko_kr: 이 페이지는 I18n 팀의 우려 사항과 OpenStack 릴리스와 관련된 작업을 수행해야 하는 것들을 설명합니다. 각 OpenStack 릴리스는 약 6개월 주기를 가지고 있으며 corresponding schedule은 https://releases.openstack.org/ (예: https://releases.openstack.org/ocata/schedule.html )에 available 있습니다.
ru: Эта страница документирует проблемы i18n-команды и те вещи, которые необходимо сделать с OpenStack-изделиями. Каждый выпуск OpenStack имеет примерно 6-месячный цикл и доступен на https://releases.openstack.org/ (например, https://releases.openstack.org/ocata/schedule.html описывает расписание выпуска Ocata).

source: This script requires Zanata admin privilege.
ko_kr: 이 스크립트는 Zanata 관리자 권한이 필요합니다.
ru: Этот скрипт требует привилегий администратора Zanata.

source: This section tries to share best practices on how team coordinators manages their language team. Feel free to add useful information!
ko_kr: 이 섹션에서는 팀 코디네이터가 언어 팀을 관리하는最佳 관행에 대해 설명합니다. useful information을 추가해 주세요!
ru: Эта секция пытается поделиться лучшими практиками по управлению командой лингвистов. Сожалению, вы не имеете доступ к этой информации.

source: This should be done after a stable version on Zanata is created.
ja: これはZanataで安定バージョンが作成された後に行う必要があります。
ko_kr: 이것은 안정적인 버전 Zanata가 생성되면 수행해야 합니다.
ru: Это должно быть сделано после стабильной версии на Zanata.

source: Three new dependencies are required : ``react-intl``, ``babel-plugin-react-intl``, and ``react-intl-po``.
ru: Три новые зависимости необходимы : ``react-intl``, ``babel-plugin-react-intl``, и ``react-intl-po``.

source: Titles
ja: タイトル
ko_kr: 제목
ru: Названия

source: To add a link to a generated document, you need to update the file ``www/<lang>/index.html`` in the ``master`` branch of the ``openstack-manuals`` repository. Note that the web pages are published from ``master`` branch, which contains the pages for all releases, such as Liberty. Therefore, you don't need to update the file ``www/<lang>/index.html`` in the stable branch.
ja: リンクを生成されたドキュメントに追加するには、``www/<lang>/index.html`` というファイルを ``master`` ブランチの ``openstack-manuals`` リポジトリの中の ``master`` ブランチで更新する必要があります。注意してくださいが、Web ページは ``master`` ブランチから出版されます。これには、リバーシティなどのすべてのリリースのページが含まれます。したがって、 ``www/<lang>/index.html`` というファイルを ``stable`` ブランチの中に更新する必要はありません。
ko_kr: 링크를生成된 दस장에 추가하려면 master 브랜치의 www/<lang>/index.html 파일을 업데이트해야 합니다. 주의할 점은 master 브랜치는 모든 릴리스의 페이지를 포함하는 것으로, 따라서 릴리스인 Liberty와 같은 모든 릴리스의 페이지가master 브랜치에서 출판됩니다. 따라서 www/<lang>/index.html 파일을 stable 브랜치에 업데이트する必要는 없습니다.
ru: Чтобы добавить ссылку на созданный документ, необходимо обновить файл `www/<lang>/index.html` в ветке `master` репозитория `openstack-manuals`. Примечание: страницы публикуются из ветки `master`, которая содержит страницы для всех выпусков, таких как Либerty. Следовательно, не нужно обновлять файл `www/<lang>/index.html` в ветке стабильной версии.

source: To communicate with the translation platform, you need to prepare a project configuration file named ``zanata.xml`` in the top directory of a project you are interested in. OpenStack projects does not contain ``zanata.xml`` in their git repositories, so you need to create it manually.
ko_kr: 번역 플랫폼과 통신하려면 top directory의 프로젝트에 interest가 있는 프로젝트에서 zanata.xml 파일을 준비해야 합니다. OpenStack 프로젝트는 git repository에 zanata.xml 파일을 포함하지 않기 때문에 manual로 만들 수 있습니다.
ru: Чтобы общаться с платформой перевода, необходимо подготовить конфигурационный файл проекта, названный `zanata.xml`, в верхнем目录 проекта, которым вы заинтересованы. Репозитории OpenStack не содержат `zanata.xml` в своих репозиториях Git, поэтому необходимо создать его вручную.

source: To display translated messages in python server projects, you need to compile message catalogs and also need to configure your server services following instructions described at `oslo.i18n documentation <https://docs.openstack.org/oslo.i18n/latest/user/usage.html#displaying-translated-messages>`__.
ko_kr: Python 서버 프로젝트에서 번역된 메시지를 표시하려면 메시지 카탈로그를 컴파일해야 하고, 또한 서버 서비스를 instructions에 따라 구성해야 합니다. `oslo.i18n documentation <https://docs.openstack.org/oslo.i18n/latest/user/usage.html#displaying-translated-messages>`__.
ru: Чтобы отображать переведенные сообщения в проектах Python-серверов, необходимо собрать каталоги сообщений и также настроить свои сервисы сервера по инструкциям, описанным в `документации oslo.i18n <https://docs.openstack.org/oslo.i18n/latest/user/usage.html#displaying-translated-messages>`__.

source: To download translations from Zanata, run the following command after going into a project directory. You are usually interested in only a few of languages, so ``--locales`` option would be useful. For more options, see the output of ``zanata pull --help``.
ko_kr: Zanata에서 번역을 다운로드하려면 프로젝트 디렉토리에 들어가서 다음 명령을 실행합니다. 언어를 선택하는 것은 일반적으로 몇 가지만 관심이 있으므로 ``--locales`` 옵션은 유용할 것입니다. 더 많은 옵션에 대한 정보는 ``zanata pull --help``의 출력과 같습니다.
ru: Чтобы скачать переводы из Zanata, выполните следующий команду после входа в目录 проекта. Вы обычно интересуетесь только несколькими языками, поэтому опция `--locales` будет полезна. Для более подробной информации посмотрите на вывод команды `zanata pull --help`.

source: To fetch translated files regularly, execute this command manually or as a cron:
ja: 定期的に翻訳されたファイルを取得するには、手動で実行するか、クローン:
ko_kr: 번역된 파일을 정기적으로 가져오려면, 手動 또는 크론으로 실행하세요:
ru: Чтобы получать переведенные файлы регулярно, выполните этот comando вручную или как cron:

source: To help with translation, :doc:`become an official translator <official_translator>` and join your language team. Then go to `translation website <https://translate.openstack.org/>`_ to start translation. You can find prioritized translation jobs as I18n team at the top of the page.
ja: 翻訳の助けになるために、 :doc:`公式翻訳者 बनन <official_translator>` となり、自分の言語チームに参加します。すると、 `translation website <https://translate.openstack.org/>`_ のトップページで優先順位付けされた翻訳作業を見つけることができます。
ko_kr: 번역에 도움을 줄 수 있는 것은, :doc:`official_translator <official_translator>`가 되고 언어 팀에 가입하여ください. then translation website <https://translate.openstack.org/>에 이동하여 시작합니다. I18n 팀의rioritized translation jobs를 찾을 수 있습니다.
ru: Чтобы помочь с переводом, :doc:`стать официальным переводчиком <official_translator>` и присоединиться к своей команде перевода. Затем пойдите на ` trangлация веб-сайта <https://translate.openstack.org/>`_ , чтобы начать перевод. Вы можете найти приоритетные переводческие задачи как на вершине страницы.

source: To not have too much churn and last minute string fixes lead to files get removed, there is also a lower threshold for releases of **66 percent** of messages translated as policy - which is only manually enforced.
ko_kr: 번역된 메시지의 66% 이상이 릴리스되는 것을 목표로 하여, 또한 **66%**가 넘는 번역된 메시지를 릴리스하는 경우에는 only manually enforced policy입니다.
ru: Чтобы избежать слишком большого потока изменений и последних минутных корректировок строк, которые приводят к удалению файлов, существует также более низкий порог для выпусков **66 процентов** переведенных сообщений - это политика, которая только ручным образом enforced.

source: To report translation errors, see :doc:`bug_report`.
ja: 翻訳エラーを報告するには、 :doc:`bug_report`。
ko_kr: 번역 오류를 보고 싶다면 :doc:`bug_report`을 확인하십시오.
ru: Чтобы отчетить о ошибках перевода, см. :doc:`bug_report`.

source: To run the script:
ja: スクリプトを実行する
ko_kr: 스크립트를 실행하시기 위해서는 다음 명령을 사용하세요:
ru: Чтобы запустить скрипт:

source: To sync the translator list, run the following command:
ja: 翻訳リストを同期するには、以下のコマンドを実行してください。
ko_kr: 翻訳자 목록을 동기화하려면 다음 명령을 사용하세요:
ru: Чтобы синхронизировать список переводчиков, запустите следующий команду:

source: Tools
ja: ツール
ko_kr: 도구
ru: Тools

source: Train cycle
ja: トレーニングサイクル
ko_kr: 학습 주기
ru: Цикл обучения

source: Translate **master** version on Zanata.
ja: Zanataで**master**バージョンの翻訳を実行します。
ko_kr: Zanata에서 **마스터** 버전을 번역합니다.
ru: Переводить **мастер** версию на Zanata.

source: Translated strings are automatically synced between translation server and Openstack infrastructure. The procedure is robust, but sometimes something can go wrong. For this reason there is a section :ref:`monitoring-translation-job-status` in the infrastructure chapter.
ko_kr: 번역된 문자열은 번역 서버와 오픈 스텝 인프라 간의 tự động 동기화가 가능합니다. 그러나 sometimes something이 잘못되면 안됩니다. 이 이유로 인해 :ref:`monitoring-translation-job-status` 섹션은 :ref:`infrastructure-chapter`에 있습니다.
ru: Переведенные строки автоматически синхронизируются между переводческим сервером и инфраструктурой Openstack. Процедура robust, но иногда что-то может пойти не так. Для этого есть раздел :ref:`monitoring-translation-job-status` в chapters infrastructure.

source: Translating: manage the translation in Zanata, including the translation memory and glossary management
ko_kr: Zanata에서 번역 관리를 제어하는 것, including translation memory 및 glossary management
ru: Переводить: управлять переводом на Zanata, включая управление памятью перевода и управлением словарями

source: Translation
ja: 翻訳
ko_kr: 번역
ru: Перевод

source: Translation Job Control
ko_kr: 번역 일정제 control
ru: Контроль перевода

source: Translation Statistics
ja: 翻訳統計
ko_kr: 번역 통계
ru: Статистика перевода

source: Translation activities with plans from language teams
ko_kr: 번역 활동이 언어 팀에서 계획을 가지고 있는 것
ru: Деятельность с планами из команд по языкам

source: Translation bugs
ja: 翻訳エラー
ko_kr: 번역 오류
ru: Буги перевода

source: Translation bugs are tracked on `Launchpad <https://bugs.launchpad.net/openstack-i18n>`__. Often only the language teams are able to handle translation bugs, e.g. wrong translation words or senses. PTL fits thereon or designates bug triage liaison.
ko_kr: 번역 오류는 `Launchpad <https://bugs.launchpad.net/openstack-i18n>`__에 트랙트됩니다. 일반적으로 언어 팀만이 번역 오류를 처리할 수 있습니다. 예를 들어, 단어 또는 의미가 잘못된 번역을 포함합니다. PTL은 그upon 또는 디자인ated bug_triage Liaison을 지정합니다.
ru: Буги по переводу отслеживаются на Launchpad <https://bugs.launchpad.net/openstack-i18n>__. Often только команды по переводу могут обрабатывать буги, например, неправильные слова или смыслы. PTL соответствует этому или назначает лиасона по обработке бугов.

source: Translation bugs in all languages can be reported here.
ja: すべての言語で翻訳エラーを報告する場所はこちらです。
ko_kr: 전역 오류가 모든 언어에서 보고报告할 수 있습니다.
ru: Буги по переводу на всех языках можно отслеживать здесь.

source: Translation infrastructure
ko_kr: ترranslation infrastructure
ru: Инфраструктура перевода

source: Translation infrastructure tasks and scripts
ko_kr: ترranslation infrastructure tasks and scripts
ru: Задачи и скрипты инфраструктуры перевода

source: Translation infrastructure tasks are stored and managed in `openstack/project-config <https://opendev.org/openstack/project-config/>`__ repository. The translation infrastructure scripts are stored and managed in `openstack/openstack-zuul-jobs <https://opendev.org/openstack/openstack-zuul-jobs>`__ repository.
ru: Задачи инфраструктуры перевода хранятся и управляются в репозитории `openstack/project-config <https://opendev.org/openstack/project-config/>`__ . Скрипты инфраструктуры перевода хранятся и управляются в репозитории `openstack/openstack-zuul-jobs <https://opendev.org/openstack/openstack-zuul-jobs>`__.

source: Translation is another kind of important contribution to OpenStack community. If you want to become a official translator, you need to finish following steps:
ja: オープンストックコミュニティへの翻訳は重要な貢献の一つです。公式の翻訳者になるには、次のステップを完了する必要があります:
ko_kr: ترranslation은 오픈 스텝 커뮤니티에 중요한 기여를 제공하는 또 다른 형태입니다. 공식적인 번역자로 बनन고 싶다면, 다음 단계를 완료해야 합니다.
ru: Перевод является еще одним видом важного вклада в сообщество OpenStack. Если вы хотите стать официальным переводчиком, вам необходимо выполнить следующие шаги:

source: Translation jobs
ja: 翻訳作業
ko_kr: ترranslation jobs
ru: Работы по переводу

source: Translation tips
ja: 翻訳のためのアドバイス
ko_kr: 번역 지침
ru: Типы перевода

source: Translation tools
ja: 翻訳ツール
ko_kr: 번역 도구
ru: Средства перевода

source: Translations
ja: 翻訳
ko_kr: 번역
ru: Переводы

source: Translations are being imported into a project repository daily, so in most cases you do not need to pull translations from Zanata manually. What you need is to pull the latest horizon code.
ja: Zanata から日常的にプロジェクトリポジトリに翻訳をインポートしているため、ほとんどの場合マニュアルで Zanata から翻訳を Pull する必要はありません。最新の Horizon コードを Pull するだけです。
ko_kr: Zanata에서 프로젝트 리포지토리에 일일로 번역이.imported됩니다. 따라서 일반적으로 Zanata에서 수신한 번역을 手動으로 가져오지 않습니다. 대신에, latest horizon code를 가져오면 됩니다.
ru: В проектную репозиторий вносятся ежедневно переводы, поэтому в большинстве случаев не требуется ручное загрузка переводов из Zanata. Что необходимо - это pulling последней версии кода horizon.

source: Translations on master version in Zanata are normally recommended for upstream contribution.
ko_kr: 마스터 버전의 번역은 일반적으로 업스트림 기여를 위해 권장됩니다.
ru: Переводы на версию master в Zanata обычно рекомендуются для внепроектных вкладов.

source: Translators translate repositories using the `translation server <http://translate.openstack.org>`_ which runs the Zanata software.
ko_kr: 역자들은 openstack.org의 번역 서버를 사용하여 저장소를 번역합니다. <http://translate.openstack.org>
ru: Переводщики используют репозитории с помощью сервиса перевода <http://translate.openstack.org>`_, который запускает программное обеспечение Zanata.

source: Update jobs for Zanata start after patches are merged on OpenStack project repositories, and Zuul starts to run tasks everyday at **6:00 UTC** for the updates on OpenStack project repositories.
ko_kr: Zuul이 매일 **06:00 UTC**에 일정을 실행하고, OpenStack 프로젝트 저장소에 대한 업데이트가 시작되면 Zanata에서 업데이트 jobs가 시작됩니다.
ru: Обновление задач для Zanata начинается после объединения(patchей) в репозиториях OpenStack, и Zuul начинает выполнять задачи каждый день в **06:00 UTC** для обновлений в репозиториях OpenStack.

source: Update your ``package.json`` file. It should contain references to the ``json2pot`` and ``po2json`` commands.
ru: Обновите свой ``package.json`` файл. Он должен содержать ссылки на команды ``json2pot`` и ``po2json``.

source: Update your ``setup.cfg`` file. It should contain a ``packages`` entry in the ``files`` section:
ru: Обновите свой ``setup.cfg`` файл. В нем должен быть запись ``packages`` в разделе ``files``:

source: Uploading
ja: アップロード
ko_kr: 업로드
ru: Загрузка

source: Uploading: Upload the translation resources to Zanata
ja: アップロード中: Zanata に翻訳リソースをアップロード
ko_kr: 업로드: 번역 리소스를 Zanata로 업로드합니다.
ru: Загрузка: Загрузить ресурсы перевода в Zanata

source: User configuration
ja: ユーザー設定
ko_kr: 사용자 설정
ru: Пользовательская конфигурация

source: Using translations
ko_kr: 번역 사용
ru: Использование переводов

source: Usual topics
ko_kr: 일반적인 주제
ru: Обычные темы

source: Visit `Stackalytics <http://stackalytics.com/>`__ and choose ``Translations`` as ``Metric`` dropdown menu at the upper-right.
ja: Stackalytics <http://stackalytics.com/>__ の「Translations」にアクセスし、上部右隅のメニューから ``Metric`` を選択してください。
ko_kr: Stackalytics <http://stackalytics.com/>`__에서 `번역`을 ``메트릭`` 드롭다운 메뉴의 상위 오른쪽에 선택하세요.
ru: Здесь вы можете найти <http://stackalytics.com/>__ и выбрать ``Translations`` в качестве ``Metric`` dropdown menu в верхнем правом углу.

source: We have two types of Zuul jobs for translations: syncing source strings into Zanata with the latest repositories and pushing translations from Zanata into the repositories. The first job is for Zanata-side updates. Up-to-date source strings to be translated are compared and updated between OpenStack project repositories and Zanata. If source texts in OpenStack project repositories are changed, then change sets are pushed into Zanata so translators deal with up-to-date source strings. On the other hand, the second job is aimed to reflect changes in translated strings in Zanata (after translators do translation activities) into corresponding OpenStack project repositories. The job will propose changes as :doc:`Translation Import <reviewing-translation-import>` Gerrit patches.
ko_kr: Zuul jobs는 번역에 2가지 종류가 있습니다. 첫 번째는 Zanata와 가장 최근의 리포지토리를 sync하는 것이며, 두 번째는 Zanata에서 번역된 문자를 OpenStack 프로젝트 리포지토리에 반영하는 것입니다. 첫 번째 job은 Zanata-side update입니다. openstack project repositories에 있는 소스 텍스트가 변경되면 change sets을 push하여 translators가 최신 소스 텍스트와 일치시킵니다. 다른方面으로 두 번째 job은 translators가 번역 활동을 마친 후 Zanata에서 번역된 문자를 OpenStack 프로젝트 리포지토리에 반영하는 것입니다. 이 job은 :doc:`Translation Import <reviewing-translation-import>` Gerrit patches를 제안합니다.
ru: Мы имеем два типа задачи Zuul для перевода: синхронизация источных строк в Zanata с последними репозиториями и передача переводов из Zanata в репозитории. Первый job — это для обновления Zanata. Сравниваются обновленные источные строки, обновляются между OpenStack проектными репозиториями и Zanata. Если источные тексты в OpenStack проектных репозиториях изменились, то измененные наборы предлагаются в Zanata, чтобы переводчики могли работать с обновленными источными строками. С другой стороны, второй job направлен на отражение изменений в переведенных строках в Zanata (после того, как переводчики выполняют переводные работы) в соответствующие OpenStack проектные репозитории. Job предлагает изменения в виде :doc:`Translation Import <reviewing-translation-import>` Gerrit patch.

source: We strongly recommend to follow the above guideline, but in some cases this behavior does not satisfy your project structure. For example,
ru: Мы strongly recommend to follow above guideline, but in some cases this behavior does not satisfy your project structure. For example,

source: We use :ref:`Zanata CLI <zanata-cli>` to download the translated PO files from the translation platform.
ko_kr: Zanata CLI를 사용하여 번역 플랫폼에서 PO 파일을 다운로드합니다.
ru: Мы используем :ref:`Zanata CLI <zanata-cli>` для загрузки переведенных PO файлов с платформы перевода.

source: We use :ref:`Zanata CLI <zanata-cli>` to upload the POT file to the translate platform.
ko_kr: Zanata CLI를 사용하여 POT 파일을 번역 플랫폼에 업로드합니다.
ru: Мы используем :ref:`Zanata CLI <zanata-cli>` для загрузки POT файлов на платформу перевода.

source: We use sphinx-build to translate RST files to POT files. Because we want to have a single POT file per document, we use msgcat to merge those POTs after sphinx-build.
ko_kr: sphinx-build를 사용하여 RST 파일을 POT 파일로 번역합니다. 단일 문서당 하나의 POT 파일을 원하는 경우, msgcat을 사용하여 merge those POTs를 수행합니다.
ru: Мы используем sphinx-build для перевода RST-файлов в POT-файлы. Поскольку нам нужен один POT-файл на каждый документ, мы используем msgcat для объединения тех POT-ов после sphinx-build.

source: What is wrong? What should be improved?
ja: 何が間違っているのか、何が改善されるべきか?
ko_kr: 오류가 무엇인지? 개선해야 하는 점은 무엇입니까?
ru: Чего не хватает? Что нужно улучшить?

source: When a filename is ``workflows.py`` or ``forms.py``, it means it is used in a form for creating or editing something.
ja: ファイル名が ``workflows.py`` または ``forms.py`` の場合、それは作成または編集するもののフォームで使用されていることを意味します。
ko_kr: filename이 ``workflows.py`` 또는 ``forms.py`` 인 경우, 그것은 something을 생성하거나 편집하기 위해 형식에 사용됩니다.
ru: Когда файл имеет имя ``workflows.py`` или ``forms.py``, это означает, что он используется в форме создания или редактирования чего-то.

source: When a new member request is received, a coordinator approves (or rarely rejects) the request. At the moment, Zanata provides no way to communicate with language team members, so it is better to inform the new member of ways usually used in the language team.
ko_kr: 새 회원 요청이 받을 때, 조정자는 (또는 드물게 거절한다) 요청을 승인합니다. 현재 Zanata는 언어 팀 멤버와 통신하는 방법을 제공하지 않기 때문에 새로운 회원에게 일반적으로 사용되는 방법을 알려주는 것이 더 좋습니다.
ru: Когда получается новое заявление на членство, координатор approving (или rarely отбрасывает) заявление. В настоящее время Zanata не обеспечивает способ общения с членами языковой команды, поэтому лучше информировать нового члена о том, что обычно делают в языковой команде.

source: When a translation period towards a new OpenStack release approaches, it is recommended to coordinate and prioritize translation efforts.
ko_kr: 새로운 오픈스택 리lease로 향하는 번역 기간이 다가오면 번역 노력과 우선순위를 조정하고 협력해야 합니다.
ru: Когда подходят к новому периоду перевода в OpenStack, рекомендуется координировать и расставлять приоритеты усилий по переводу.
