Repository: openstack-kr/knu_i18n_2025
Catalog: po/i18n-docs-source-locale-*.po
Languages: ja, ko_kr, ru

source: Replace ``${MODULENAME}`` with the name of your main module like ``nova`` or ``novaclient``. Your i18n setup file, normally named ``_i18n.py``, should use the name of your module as domain name:
ru: Замените ``${MODULENAME}`` на имя вашего основного модуля, например ``nova`` или ``novaclient``. В вашем сценарии настройки i18n, обычно имеющем имя ``_i18n.py``, должно использовать имя вашего модуля в качестве именного пространства:

source: Reporting translation bugs
ja: 翻訳バグの報告
ko_kr: 번역 오류를 보고 하세요.
ru: Отчет о ошибках перевода

source: Request to join a translation team
ja: 翻訳チームへの参加の申し込み
ko_kr: 번역 팀에 참여하실 것을 요청해 주세요.
ru: Запрос присоединения к команде перевода

source: Retrieve translation statistics
ja: 翻訳統計の取得
ko_kr: 번역 통계를 가져오기
ru: Получить статистику перевода

source: Review of action items from the previous meeting
ko_kr: 이전 회의에서 hành động 항목을 검토하기
ru: Обзор действий по делам из предыдущего собрания

source: Reviewer
ja: レビュアー
ko_kr: 리뷰어
ru: Ревизор

source: Reviewing
ko_kr: 리뷰하기
ru: Ревизировать

source: Reviewing translation imports
ja: 翻訳のインポートを確認する
ko_kr: 번역.imports 리뷰하기
ru: Оценка импортов перевода

source: Rob Cresswell (id: robcresswell) - English (United Kingdom)
ja: ロブ・クレスウェル（ID：robcresswell）-英語（イギリス）-
ko_kr: 로브 크레슬 (id: robcresswell) - 영어 (영국)
ru: Роб Крессвелл (id: robcresswell) - Английский (Великобритания)

source: Rocky cycle
ja: ロッキーサイクル
ko_kr: 락키 사이클
ru: Цикл Рокки

source: Roles in a Language Team
ja: 言語チームにおけるロール
ko_kr: 언어 팀의 역할
ru: Роли в команде переводчика

source: Running DevStack
ja: デビスタックを実行する
ko_kr: DevStack 실행
ru: Быстрое запуск DevStack

source: Running OpenStack-Ansible
ja: OpenStack-Ansibleを実行中
ko_kr: OpenStack-Ansible 실행
ru: Быстрое создание OpenStack-Ansible

source: Search in this guide
ja: このガイドで検索する
ko_kr: 이 가이드에서 검색하세요
ru: Ищите в этом руководстве

source: Server projects
ja: サーバープロジェクト
ko_kr: 서버 프로젝트
ru: Проекты сервера

source: Set up the project on the translation server.
ru: Установить проект на переводческий сервер.

source: Setting up a communication channel among team members is recommended. It encourage team communications to discuss various translation related topics.
ko_kr: 팀 멤버 간의 통신-channel을 설정하는 것은 권장됩니다. 팀은 다양한 번역 관련 주제에 대해 논의할 수 있습니다.
ru: Обеспечивание общего канала связи между членами команды является рекомендованным. Это способствует обсуждению различных тем, связанных с переводом.

source: Stein cycle
ja: Steinサイクル
ko_kr: Stein 주기
ru: Цикл Стина

source: Steps to become a OpenStack translator
ja: OpenStack翻訳者になるためのステップ
ko_kr: OpenStack 번역가가 되기 위한 단계
ru: Шаги к статье о переводчике OpenStack

source: Sync the translator list with Zanata
ja: Zanataとtranslatorリストを同期する
ko_kr: Zanata와의 번역자 목록을 동기화하십시오
ru: Синхронизация списка переводчиков с Zanata

source: TBD
ja: 未実行
ru: ТБД

source: Team activities with release
ko_kr: リリース과 팀 활동
ru: Деятельность команды при выпуске

source: The I18n project maintains a list of language teams and their members. The list is used by Stackalytics to gather translation statistics (See :ref:`stats-stackalytics` for detail). It is also used by the scripts below.
ko_kr: I18n 프로젝트는 언어 팀과 그 회원들을 관리하는 목록을 유지하고 있습니다. 이 목록은 스택아탈리틱스에 의해 번역 통계를 수집하기 위해 사용됩니다. (상세 정보는 :ref:`stats-stackalytics` 참조하십시오). 이 목록은 아래 스크립트에서도 사용됩니다.
ru: Проект I18n поддерживает список команд по языкам и их участников. Список используется Stackalytics для сбора статистики перевода (Просмотр :ref:`stats-stackalytics` для подробностей). Это также используется в скриптах ниже.

source: The I18n team welcomes any kinds of contribution.
ja: I18n チームは、どんなコンポーネントでも寄与を歓迎します。
ko_kr: I18n 팀은 모든 종류의 기여를 환영합니다.
ru: Команда I18n приветствует любые виды вклада.

source: The OpenStack infra scripts executed by tasks currently download new files that are at least **75 percent** translated and if files grow over time but do not get new translations (or strings change too much), they will be removed again automatically from the project with a lower threshold of currently **40 percent**.
ko_kr: 현재 스크립트가 실행되는 오픈스택 인프라 스크립트는 현재 75% 번역된 파일을 다운로드하고, 시간이 지남에 따라 파일이 크지만 새로운 번역이 없거나 변경이 많이 된 경우, automatically 프로젝트에서 다시 lower threshold의 40% 번역ed 파일을 제거합니다.
ru: Программы инфраструктуры OpenStack, выполняемые задачами ныне скачивают новые файлы, которые не менее **75%** переведены и если файлы растут в время но не получают новых переводов (или строки изменяются слишком много), они будут удалены снова из проекта с более низким порогомcurrently **40%**.

source: The POT file is found under ``http://tarballs.openstack.org/translation-source/<Zanata-project-name>/<Zanata-project-version>/<path>/<resource>.pot``, where:
ja: POT ファイルは ``http://tarballs.openstack.org/translation-source/<Zanata-project-name>/<Zanata-project-version>/<path>/<resource>.pot`` という場所で見つかります。ここでは:
ko_kr: POT 파일은 `http://tarballs.openstack.org/translation-source/<Zanata-project-name>/<Zanata-project-version>/<path>/<resource>.pot`에 위치하고 있습니다. 여기서:
ru: Файл POT находится под ``http://tarballs.openstack.org/translation-source/<Zanata-project-name>/<Zanata-project-version>/<path>/<resource>.pot``, где:

source: The `Zuul Builds Page <https://zuul.opendev.org/t/openstack/builds>`__ provides us a convenient way to check the translation job status.
ru: Пágina построения Zuul <https://zuul.opendev.org/t/openstack/builds>`__ обеспечивает нам удобный способ проверить статус переводной работы.

source: The above run the following internally:
ja: 上記のコマンドを実行するには、次のコマンドを実行します。
ko_kr: 위의 경우는 내부에서 다음과 같이 실행됩니다.:
ru: Ниже выполняется следующее внутренне:

source: The bug triaging process are following the `general bug triaging process <https://wiki.openstack.org/wiki/BugTriage>`_. If you want to help bug triaging tasks, join the `OpenStack I18n bug team <https://launchpad.net/~openstack-i18n-bugs>`_ first.
ja: バグトリagingプロセスは `general bug triaging process <https://wiki.openstack.org/wiki/BugTriage>`_ に従います。バグトリージングタスクに協力したい場合は、まず `OpenStack I18n bug team <https://launchpad.net/~openstack-i18n-bugs>`` に参加してください。
ko_kr: 버그 트리aging 프로세스는 <https://wiki.openstack.org/wiki/BugTriage> general bug triaging process를 따릅니다. 버그 트리딩 task에 도움을 주고 싶다면, <https://launchpad.net/~openstack-i18n-bugs>_의 OpenStack I18n bug 팀에 가입하세요.
ru: Буг-тридирование процессов является следованием «общему процессу буг-тридирования <https://wiki.openstack.org/wiki/BugTriage>`_. Если вы хотите помочь в буг-тридировании задачах, присоединитесь к «команде OpenStack I18n bug» <https://launchpad.net/~openstack-i18n-bugs>`_.

source: The change is done by a bot. If anything looks wrong with it, you need to actively reach out to the :ref:`OpenStack I18n team <openstack_i18n_team>` and point the problem out.
ko_kr: 이 변경은 로봇에 의해 수행되었습니다. 만약 이에 대해อะไร도 잘못된 것이라면, :ref:`OpenStack I18n 팀 <openstack_i18n_team>`에 활발히 연락하고 문제를 지시해야 합니다.
ru: Изменение выполнено ботом. Если что-то parece не так с ним, вам нужно активно Outreach в :ref:`OpenStack I18n команду <openstack_i18n_team>` и указать проблему.

source: The convention for heading levels is as follows::
ja: ヘッディングレベルは次の規則で決まります::
ko_kr: heading level의 전통적 규칙은 다음과 같습니다.:
ru: Общее правило для заголовков уровней следующее::

source: The easiest way would be to open http://tarballs.openstack.org/translation-source and then follow ``<Zanata-project-name>``, ``<Zanata-version>`` and corresponding links.
ko_kr: 가장 आसान한 방법은 http://tarballs.openstack.org/translation-source를 열고 그 다음 ``<Zanata-project-name>``, ``<Zanata-version>`` 및 corresponding links를 따라가기 때문입니다.
ru: Легчайший способ будет consistir в том, чтобы открыть http://tarballs.openstack.org/translation-source и затем следовать ``<Zanata-project-name>``, ``<Zanata-version>`` и соответствующие ссылки.

source: The filename of the list is ``tools/translation_team.yaml``.
ko_kr: 리스트 파일의 이름은 tools/translation_team.yaml입니다.
ru: Название файла списка ``tools/translation_team.yaml``.

source: The following is an example of ``local.conf`` for Newton release which runs core components (keystone, nova, glance, neutron, cinder), horizon, swift and heat. The components which the main horizon code supports are chosen.
ko_kr: Newton 릴리스에서 실행되는-core 구성 요소(keystone, nova, glance, neutron, cinder), horizon, swift 및 heat을 포함하는 ``local.conf`` 예시입니다. 주요 horizon 코드가 지원하는 구성 요소를 선택합니다.
ru: Следующее пример ``local.conf`` для выпуска Newton, который включает в себя основные компоненты (keystone, nova, glance, neutron, cinder), horizon, swift и heat. Компоненты, которые основной код horizon поддерживает, выбираются.

source: The following is an example of ``zanata.xml``. In most cases, what you need to edit are **project** and **project-version**.
ko_kr: zanata.xml의 예시입니다. 대부분의 경우에 대해 **project**와 **project-version**을 편집해야 합니다.
ru: Следующее пример ``zanata.xml``. В большинстве случаев, что нужно editar - **проект** и **версия проекта**.

source: The followings are useful links when writing documents in RST.
ko_kr: 다음은 RST에서 दस稿을 작성할 때 유용한 링크입니다.
ru: Следующие ссылки полезны при написании документов в RST.

source: The goal of the review is that the structure of the change is fine, it's not that the strings are translated properly. The review of translated strings is done by teams using the translation server.
ko_kr: 리뷰의 목표는 변경된 구조가 잘되어 있지만, 번역이 적합하게 done되지 않았는지 확인하는 것입니다. 번역된 문자를 리뷰하는 것은 translation server를 사용하여 팀들이 수행합니다.
ru: Цель отзыва - это структура изменения правильна, а не то, что переведенные строки переводятся правильно. Отзыв о переведенных строках выполняется командами по использованию перевода.

source: The guide is written in reStructuredText (RST) markup syntax with Sphinx extensions. Most conventions follow `those of the openstack-manuals project <http://docs.openstack.org/contributor-guide/rst-conv.html>`__.
ko_kr: 가이드는 reStructuredText (RST) 마크업 스타일과 Sphinx 확장 기능을 사용한 문법입니다. 대부분의 규칙은 openstack-manuals 프로젝트 <http://docs.openstack.org/contributor-guide/rst-conv.html>__의 those를 따릅니다.
ru: Гид написан на reStructuredText (RST) синтаксисе с использованием расширений Sphinx. Most конвенции следуют `техникам openstack-manuals <http://docs.openstack.org/contributor-guide/rst-conv.html>`__.

source: The infra scripts consider a project as a Django project when your repository name ends with ``-dashboard``, ``-ui``, ``horizon`` or ``django_openstack_auth``. Otherwise your project will be recognized as a Python project. Projects using ReactJS need special treatment.
ru: Инфра-скрипты рассматривают проект как Django-проект, когда имя репозитория заканчивается на ``-dashboard``, ``-ui``, ``horizon`` или ``django_openstack_auth``. В противном случае ваш проект будет признан как Python-проект. Проекты, использующие ReactJS, требуют особого обращения.

source: The infra scripts for translation setup work as follows:
ru: Инфра-скрипты для настройки перевода работают по следующему принципу:

source: The infra scripts recognize a project type based on its repository name. If the repository name ends with ``-dashboard``, ``-ui``, ``horizon`` or ``django_openstack_auth``, it is treated as a Django project. Otherwise it is treated as a Python project.
ru: Инфра-скрипты распознают тип проекта на основе его имени репозитория. Если имя репозитория заканчивается на ``-dashboard``, ``-ui``, ``horizon`` или ``django_openstack_auth``, оно считается Django-проектом. В противном случае оно считается Python-проектом.

source: The master glossary is an usual POT file. You can edit it in your favorite editor as usual.
ja: マスターのグロサリーは通常の POT ファイルです。通常のエディターで編集できます。
ko_kr: 마스터 glossary는 일반적인 POT 파일입니다. 일반적으로 편집기에서 수정할 수 있습니다.
ru: Мастерский словарь является обычным POT файлом. Вы можете редактировать его в своем любимом редакторе как usual.

source: The other way is to rerun DevStack. Ensure to include ``RECLONE=True`` in your ``local.conf`` before running ``stack.sh`` again so that DevStack retrieve the latest codes of horizon and other projects.
ja: 他の方法は、DevStackを再実行することです。 ``RECLONE=True`` を ``local.conf`` に含めて ``stack.sh`` をもう一度実行すると、DevStackがhorizonや他のプロジェクトの最新コードを取得できるようにします。
ko_kr: 다른 방법은 DevStack을 다시 실행하는 것입니다. ensure to include ``RECLONE=True`` local.conf에 ``stack.sh``를 다시 실행하기 전에 ``local.conf``에 포함되어 있어 horizon 및 다른 프로젝트의 latest codes를 retrieve합니다.
ru: В другом случае можно перезапустить DevStack. Убедитесь, что включен параметр ``RECLONE=True`` в ``local.conf`` перед запуском ``stack.sh`` снова, чтобы DevStack мог получить последние коды Horizon и другие проекты.

source: The proposal bot also removes files, it removes files that have very few translations in them. Note that no translations will be lost, they are still in the translation server.
ko_kr: 제안 봇은 파일을 제거합니다. 제안봇은 매우 적은 번역이 있는 파일들을 제거합니다. 번역이 잃어버리지는 않습니다. 그들은 여전히 번역서에 있습니다.
ru: Бот предложения также удаляет файлы, он удаляет файлы с очень少ими переводами. Примечание: ни один перевод не будет потерян, они все еще находятся в сервере перевода.

source: The script ``tools/zanata/zanata_stats.py`` helps retrieving translation statistics from Zanata.
ko_kr: 스クリプ트 `tools/zanata/zanata_stats.py`는 Zanata에서 번역 통계를 얻는 데 도움을 줍니다.
ru: Скрипт ``tools/zanata/zanata_stats.py`` помогает получить статистику перевода из Zanata.

source: The script ``tools/zanata/zanata_userinfo.py`` helps this. It generates a CSV file by reading a YAML file which contains the list of translators (e.g., ``translation_team.yaml``) with user name and e-mail addresses by interacting with Zanata API.
ko_kr: 스クリ프트 `tools/zanata/zanata_userinfo.py`는 이에 도움을 줍니다. YAML 파일 (`translation_team.yaml`)의 번역자 목록을 읽고 사용자 이름과 이메일 주소를生成합니다. Zanata API와 상호작용하여.
ru: Скрипт ``tools/zanata/zanata_userinfo.py`` помогает этому. Он генерирует CSV-файл, прочитав YAML-файл, который содержит список переводчиков (например, ``translation_team.yaml``) с именами пользователя и электронными адресами, взаимодействуя с API Zanata.

source: The scripts below depend on several python modules. To install these dependencies, run ``pip install -e requirements.txt``.
ko_kr: 아래 스크립트는 여러 파이썬 모듈에 의존합니다. 이러한 의존성을 설치하려면 `pip install -e requirements.txt`를 실행하세요.
ru: Скрипты ниже зависят от нескольких python-модулей. Чтобы установить эти зависимости, запустите ``pip install -e requirements.txt``.

source: The statistics are calculated using `a Python script <https://opendev.org/openstack/i18n/src/tools/zanata/zanata_stats.py>`__ powered by `Zanata statistics API <http://zanata.org/zanata-platform/rest-api-docs/resource_StatisticsResource.html>`__ Translator list is maintained by `translation_team.yaml <https://opendev.org/openstack/i18n/src/tools/zanata/translation_team.yaml>`__ stored in `openstack/i18n git repository <https://opendev.org/openstack/i18n>`__.
ja: 統計値は `Python スクリプト <https://opendev.org/openstack/i18n/src/tools/zanata/zanata_stats.py>`__ で計算されます。これは `Zanata統計API <http://zanata.org/zanata-platform/rest-api-docs/resource_StatisticsResource.html>`__ を利用しています。翻訳者リストは `translation_team.yaml <https://opendev.org/openstack/i18n/src/tools/zanata/translation_team.yaml>`__ で管理されており、 `openstack/i18n` Git リポジトリ <https://opendev.org/openstack/i18n>`__ には保存されています。
ko_kr: 통계는 `Python 스크립트 <https://opendev.org/openstack/i18n/src/tools/zanata/zanata_stats.py>`__에 의해 계산됩니다. Zanata 통역 API <http://zanata.org/zanata-platform/rest-api-docs/resource_StatisticsResource.html>`__에 의해 शक्त력화되었습니다. Translator 목록은 `translation_team.yaml <https://opendev.org/openstack/i18n/src/tools/zanata/translation_team.yaml>`__에 의해 유지 관리됩니다. openstack/i18n git 저장소 <https://opendev.org/openstack/i18n>`__에 저장됩니다.
ru: Статистика рассчитывается с помощью `пайтон-скрипта <https://opendev.org/openstack/i18n/src/tools/zanata/zanata_stats.py>`__ , обслуживаемый `API Zanata <http://zanata.org/zanata-platform/rest-api-docs/resource_StatisticsResource.html>`__, переводчиками, которые обслуживаются `translation_team.yaml <https://opendev.org/openstack/i18n/src/tools/zanata/translation_team.yaml>`__ , хранилищем в `openstack/i18n git repository <https://opendev.org/openstack/i18n>`__.

source: The translatable strings are extracted from a source project. So some i18n bugs might be caused by bugs in the original strings/source codes of a source project which contains these translatable strings. Those kind of bugs should be fixed in the source project.
ja: 翻訳可能な文字列はソースプロジェクトから抽出されます。したがって、i18n のバグがソースプロジェクトのオリジナル文字列やソースコードに存在する場合、翻訳可能な文字列を含むソースプロジェクトでは i18n のバグが発生する可能性があります。そのようなバグはソースプロジェクトで修正する必要があります。
ko_kr: 번역 가능한 문자열은 원본 프로젝트에서 추출됩니다. 따라서 일부 i18n 오류는 원본 문자열/원본 코드의 오류로 인해 발생할 수 있습니다. 이러한 종류의 오류를 원본 프로젝트에서修复해야 합니다.
ru: Переводимые строки извлекаются из источного проекта. Следовательно, некоторые ошибки i18n могут быть вызваны ошибками в исходных строках/кодах источного проекта, которые содержат эти переводимые строки. Тогда следует исправить эти ошибки в исходном проекте.

source: The translated PO files will converted into JSON and placed into the ``./i18n/locales`` directory.
ru: Переведенные файлы PO будут преобразованы в JSON и размещены в ``./i18n/locales``.

source: The translation plan is announced on `Zanata <https://translate.openstack.org>`__ and contains the projects with the highest priority in translation. Usually these are all user-visible projects, like Horizon.
ko_kr: 번역 계획은 `Zanata <https://translate.openstack.org>`__에 발표され, 번역riorität가 높은 프로젝트가 포함됩니다. 일반적으로 사용자-visible 프로젝트는Horizon과 같은 대부분의 프로젝트가 포함됩니다.
ru: План перевода объявляется на `Zanata <https://translate.openstack.org>`__ и содержит проекты с наибольшей приоритетностью в переводе. Usually эти все пользовательские проекты, такие как Horizon.

source: The translation team is translating stable branches only for GUI projects, so for horizon and its plugins.
ru: Тeam переводчиков переводит только стабильные ветки для GUI-проектов, поэтому для horizon и его плагинов.

source: Then, for every PO file, we should execute the following command to build into MO file:
ko_kr: PO 파일을 위해 다음 명령을 실행하여 MO 파일로 변환합니다.
ru: Затем, для каждого файла PO нам нужно выполнить следующий команду, чтобы построить файл MO:

source: Then, your locale translation team is created successfully. You can enroll more people to join and start your translation work.
ko_kr: then your locale 번역 팀은 성공적으로 생성되었습니다. 더 많은 사람들을 참여시키고 번역 작업을 시작할 수 있습니다.
ru: Затем ваша локализированная группа переводчиков создана успешно. Вы можете зарегистрировать еще людей, чтобы присоединиться и начать свою работу по переводу.

source: There are cases where you cannot see your translation statistics in Stackalytics even after you translate strings in Zanata.
ja: いくつかのケースでは、Stackalyticsで翻訳した文字列の統計値を見ることができません。即座に翻訳した後でも、Stackalyticsでは表示されない場合があります。
ko_kr: Zanata에서 문자열을 번역한 후에도 Stackalytics에 번역 통계를 볼 수 없다는 경우가 있습니다.
ru: В некоторых случаях вы не сможете увидеть свои статистики перевода в Stackalytics даже после того, как вы переведете строки в Zanata.

source: There are several ways to know your translation activity.
ja: 翻訳活動を知る方法は何かある.
ko_kr: 번역 활동에 대한 다양한 방법이 있습니다.
ru: Всего существует несколько способов узнать о вашей активности перевода.

source: There are three different roles in a translation team:
ja: 翻訳チームには3つの役割がある。
ko_kr: 번역 팀에는 세 가지 역할이 있습니다.:
ru: В Translation Team есть три разных роли.

source: This `Script in I18n repo <https://opendev.org/openstack/i18n/src/tools/zanata/zanata_users.py>`__ collects all users and their activities.
ko_kr: 이 `Script in I18n repo <https://opendev.org/openstack/i18n/src/tools/zanata/zanata_users.py>`__ collects all users and their activities.
ru: Этот скрипт в репозитории i18n <https://opendev.org/openstack/i18n/src/tools/zanata/zanata_users.py> собирает всех пользователей и их активности.

source: This document explains to reviewers details about the automatic import of translations from Zanata.
ja: このドキュメントでは、Zanataから自動的に翻訳された翻訳の詳細についてレビュアーに説明します。
ko_kr: 이 문서는 Zanata에서 번역된 문자열을 tự động.import하는 것에 대한 리뷰자에게รายละเอียด을 설명합니다.
ru: Этот документ объясняет рецензентам подробности о автоматическом импорте переводов из Zanata.

source: This document gives additional information.
ja: このドキュメントには追加情報が含まれています。
ko_kr: 이 दस장은 추가 정보를 제공합니다.
ru: Этот документ дает дополнительную информацию.

source: This following statistics data is calculated using up-to-date `translation_team.yaml <https://opendev.org/openstack/i18n/src/commit/a67e08d86cc78907da38d5f09b8be6f71d1979a0/tools/zanata/translation_team.yaml>`__ (date: Jan 15, 2017).
ko_kr: 이 다음 통계 데이터는 현재 `translation_team.yaml <https://opendev.org/openstack/i18n/src/commit/a67e08d86cc78907da38d5f09b8be6f71d1979a0/tools/zanata/translation_team.yaml>`__ (date: Jan 15, 2017).
ru: Эта последующая статистическая данные рассчитывается с использованием обновленного `translation_team.yaml <https://opendev.org/openstack/i18n/src/commit/a67e08d86cc78907da38d5f09b8be6f71d1979a0/tools/zanata/translation_team.yaml>`__ (дата: 15 января 2017 года).

source: This guide itself is I18n-ed and you can translate it into your language. To translate it, visit `i18n <https://translate.openstack.org/project/view/i18n>`__ project in `Zanata <https://translate.openstack.org/>`__. Document **doc** in **i18n** project corresponds to this guide. You can translate it in the same way as you do for other projects like dashboard or manuals. Once the translation progress becomes higher than the threshold (For more information on the threshold, see :ref:`translation-jobs`), the translated version of the guide will be published.
ja: このガイド自体はI18n化されており、自分の言語で翻訳できます。翻訳するには、`i18n <https://translate.openstack.org/project/view/i18n>`__プロジェクトを `Zanata <https://translate.openstack.org/>`__に訪問してください。ドキュメント**doc**は**i18n**プロジェクトのドキュメントであり、このガイドと同じように他のプロジェクトのように翻訳することができます。翻訳の進捗度が閾値を超えると（閾値については :ref:`translation-jobs` を参照してください）、ガイドの翻訳されたバージョンが公開されます。
ko_kr: 이 가이드 자체는 I18n을 적용하여 사용할 수 있습니다. 이 가이드를 번역하려면 `i18n <https://translate.openstack.org/project/view/i18n>`__ 프로젝트를 방문하십시오. Zanata <https://translate.openstack.org/>__. **doc** 프로젝트의 **i18n** 섹션은 이 가이드와 일치합니다. 다른 프로젝트와 마찬가지로 dashboard 또는 매뉴얼과 같은 프로젝트에서 번역하는 것과 동일한 방식으로 번역할 수 있습니다. 번역 진행이 임계치(번역_jobs에 대한 더 많은 정보를 확인하십시오) 이상이 되면 가이드의 번역된 버전이 출판됩니다.
ru: Этот руководство само по себе переведено и вы можете перевести его на свой язык. Чтобы перевести его, посетите `i18n <https://translate.openstack.org/project/view/i18n>`__ проект в `Zanata <https://translate.openstack.org/>`__. Документ **doc** в **i18n** проекте соответствует этому руководству. Вы можете перевести его по той же схеме, что и для других проектов, таких как дашборд или manuals. Как только прогресс перевода становится выше порога (Для более информации о пороге, см :ref:`translation-jobs`), переведенная версия руководства будет публиковаться.

source: This guide provides detailed instructions on the I18n contribution workflow and conventions to be considered by all contributors.
ja: このガイドでは、すべてのコントリビュータが考慮するI18n貢献ワークフローと規約に関する詳細な指示を提供します。
ko_kr: 이 가이드는 I18n 기여 workflow 및 모든 기여자에 의해 고려되는 규칙에 대한 세부 지침을 제공합니다.
ru: Этот руководство предоставляет подробные инструкции по workflow и нормам I18n, которые должны учитываться всем участниками.

source: This is a useful commands for the IRC meeting.
ja: IRC会議用の有効なコマンドです。
ko_kr: IRC 회의에서 유용한 명령어입니다.
ru: Это полезный команды для IRC-съезда.
