Repository: openstack-kr/knu_i18n_2025
Catalog: po/i18n-docs-source-locale-*.po
Languages: ja, ko_kr, ru

source: ``<path>`` is a path of a document such as ``nova/locale``, ``openstack_dashboard/locale`` or ``releasenotes/source/locale``,
ja: ``<path>`` はドキュメントのパスです。たとえば ``nova/locale``, ``openstack_dashboard/locale`` または ``releasenotes/source/locale`` のようにします。
ko_kr: ``<path>``은 문서의 경로입니다. 예를 들어 ``nova/locale``, ``openstack_dashboard/locale`` 또는 ``releasenotes/source/locale``과 같은 경로입니다.
ru: Путь к документу — это путь к документу, такой как «nova/locale», «openstack_dashboard/locale» или «releasenotes/source/locale»,

source: ``<resource>`` is a document name in Zanata.
ja: ``<resource>`` は Zanata のドキュメント名です。
ko_kr: ``<resource>``은 Zanata에서 문서 이름입니다.
ru: Заната-ресурс — это имя документа Занаты.

source: ``dashboards/admin/aggregates/views.py:104``
ru: дашборд/администратор/агрегаты/просмотр.py:104

source: ``dashboards/project/containers/templates/containers/_update.html:21``
ru: ``дескрипторы/проекты/контейнеры шаблоны/контейнеры/_обновление.html:21``

source: ``dashboards/project/loadbalancers/workflows.py:44``
ru: ``дескрипторы/проекты/балансировщики/работаефекты.py:44``

source: `common_translation_update.sh <https://opendev.org/openstack/openstack-zuul-jobs/src/roles/prepare-zanata-client/files/common_translation_update.sh>`__
ru: `общий обновление перевода <https://opendev.org/openstack/openstack-zuul-jobs/src/roles/prepare-zanata-client/files/common_translation_update.sh>`__

source: `create-zanata-xml.py <https://opendev.org/openstack/openstack-zuul-jobs/src/roles/prepare-zanata-client/files/create-zanata-xml.py>`__
ru: `создание xml перевода <https://opendev.org/openstack/openstack-zuul-jobs/src/roles/prepare-zanata-client/files/create-zanata-xml.py>`__

source: `openstack-i18n in Launchpad <https://bugs.launchpad.net/openstack-i18n>`_
ru: openstack-i18n в Launchpad <https://bugs.launchpad.net/openstack-i18n>

source: `propose-translation-update.yaml <https://opendev.org/openstack/project-config/src/playbooks/translation/propose-translation-update.yaml>`__
ru: пropose-translation-update.yaml <https://opendev.org/openstack/project-config/src/playbooks/translation/propose-translation-update.yaml>`__

source: `releasenotes/run.yaml <https://opendev.org/openstack/project-config/src/playbooks/releasenotes/run.yaml>`__
ru: `агрегат обновлений release notes <https://opendev.org/openstack/project-config/src/playbooks/агрегат обновлений release notes>`__

source: `upstream-translation-update.yaml <https://opendev.org/openstack/project-config/src/playbooks/translation/upstream-translation-update.yaml>`__
ru: `обновление перевода upstream update.yaml <https://opendev.org/openstack/project-config/src/playbooks/translation/upstream-translation-update.yaml>`__

source: add the source project to "Also affects project" of this bug.
ja: このバグにも影響するプロジェクトの「Also affects project"にソースプロジェクトを追加してください。
ko_kr: 이 버그에 영향을 받는 프로젝트에 소스 프로젝트를 추가합니다.
ru: добавьте источник проекта в «Also affects project» этого бюллетеня о bugs.

source: assign the bug to you or a member of your language team, and then mark it as "In Progress"
ja: このバグをあなたまたはあなたの言語チームのメンバーに割り当て、そして「In Progress」にマークしてください。
ko_kr: bug를 당신이나 언어 팀의 멤버에게 할당하고 then 'In Progress'로 표시합니다.
ru: предоставьте бугу вам или члену вашей команды по переводу, и затем отметите его как «In Progress»

source: bugs in a source project
ja: ソースプロジェクト内のバグ
ko_kr: 원본 프로젝트에 있는 버그
ru: баги в исходном проекте

source: bugs in tool chains
ja: ツールチェーン内でのバグ
ko_kr: 도구 체인에 있는 버그
ru: недостатков в инструментах цепей

source: confirm the bug
ja: バグを確認する
ko_kr: 버그 확인
ru: подтвердить ошибку

source: confirm the bug or mark it as incomplete
ja: バグを確認するか、不完全にマークする
ko_kr: bug를 확인하거나 비대면으로 표시하세요.
ru: подтвердить ошибку или отметить ее как неисполненную

source: exported the translators contribution statistics from Transifex since 2014-11-01 to 2015-07-16
ko_kr: 2014년 11월 1일부터 2015년 7월 16일까지 Transifex에서 번역자 기여 thống계 정보를.export했습니다.
ru: экспортировал статистику переводов contributorа Transifex с 2014-11-01 по 2015-07-16

source: fix it by visiting a corresponding resource in Zanata and correcting translations.
ja: それをZanataの対応するリソースで訪問してトランスレーションを正しく修正する
ko_kr: corresponding resource in Zanata에 방문하여 번역을 수정하세요.
ru: переработать его, посетив соответствующую ресурс в Zanata и исправив переводы.

source: prioritize the bug
ja: バグの優先度を設定する
ko_kr: bug를 우선시하십시오.
ru: приоритизировать проблему

source: tag it with the project name, for example "horizon" or "docs".
ja: タグをプロジェクト名でラベル付けしてください。例えば「horizon」または「docs」.
ko_kr: project 이름과 같은 언어 이름으로 태그하세요. 예를 들어 'horizon' 또는 'docs'입니다.
ru: замечать это событие с именем проекта, например "horizon" или "docs".

source: tag the bug with a language name
ja: バグを言語名でラベル付けしてください。
ko_kr: bugs에 언어 이름을 태그하십시오.
ru: замечать проблему с именем языка

source: translation bugs
ja: 翻訳エラー
ko_kr: 번역 오류
ru: баги на перевод

source: Łukasz Jernas (id: deejay1) - Polish (Poland)
ja: Łukasz Jernas (id: deejay1) - ポーランド語 (ポーランド)
ko_kr: łukasz jernas (id: deejay1) - Polski (Połonia)
ru: Лукаш Jerнас (id: deejay1) - Polsкий (Польша)

source: AC members of I18n project
ko_kr: I18n 프로젝트의 AC 회원

source: Active Contributor status in I18n project
ko_kr: I18n 프로젝트에서 활성적인 기여자 상태

source: Before use sphinx-build to build HTML file, we need to feed the translations from the single PO file into those small PO files. For example:
ko_kr: PO 파일에서 번역을 feed하는 것을 trước에 sphinx-build를 사용하여 HTML 파일을 생성하기 전에 해야 합니다. 예를 들어:

source: Commenting out CI-specific codes
ko_kr: CI-Specifc 코드를 coment아웃합니다.

source: Copy the translation scripts to your working directory from `openstack-zuul-jobs/roles/prepare-zanata-client/files <https://opendev.org/openstack/openstack-zuul-jobs/src/branch/master/roles/prepare-zanata-client/files>`__. In addition, you need to copy ``common.sh`` from `project-config/roles/copy-proposal-common-scripts/files <https://opendev.org/openstack/project-config/src/branch/master/roles/copy-proposal-common-scripts/files>`__ to the same working directory.
ko_kr: 번역 스크립트를 작업 디렉터리에서 `openstack-zuul-jobs/roles/prepare-zanata-client/files <https://opendev.org/openstack/openstack-zuul-jobs/src/branch/master/roles/prepare-zanata-client/files>`__. 추가적으로, `common.sh`을 `project-config/roles/copy-proposal-common-scripts/files <https://opendev.org/openstack/project-config/src/branch/master/roles/copy-proposal-common-scripts/files>`__에서 복사하여 동일한 작업 디렉터리에 복사해야 합니다.

source: Copying upper-constraints.txt
ko_kr: 위상 제한.txt를 복사합니다

source: Creating ~/.venv virtualenv
ko_kr: ~/.venv 가상 환경을 생성합니다

source: Currently, we support translations for small set of OpenStack project documentations like Horizon, OpenStack-Ansible, and OpenStack-Helm upon requests and available bandwidth. Top-level directory structure on ``doc/source/`` follows with `Documentation Contributor Guide - Project guide setup <https://docs.openstack.org/doc-contrib-guide/project-guides.html>`_ and the corresponding generated documents for ``master`` branch are available at ``https://docs.openstack.org/<project>/latest/<language>/<document>`` URL. For project team documents in stable branch, you can check the documents with ``https://docs.openstack.org/<project>/<branch>/<language>/<document>`` URL.
ko_kr: 현재, OpenStack 프로젝트의 소규모 문서 번역을 지원합니다. Horizon, OpenStack-Ansible, OpenStack-Helm과 같은 오픈 스텝 프로젝트의 문서를 요청하고 사용 가능한 밸런스를 확인하면 됩니다. doc/source/ 디렉토리의 최상단 구조는 `Documentation Contributor Guide - Project guide setup <https://docs.openstack.org/doc-contrib-guide/project-guides.html>`_와 correspondingly 생성된 문서가 ``master`` 브랜치에서 ``https://docs.openstack.org/<project>/latest/<language>/<document>`` URL로 available합니다. stable 브랜치는 ``https://docs.openstack.org/<project>/<branch>/<language>/<document>`` URL을 확인할 수 있습니다.

source: Debugging job scripts
ko_kr: 调试作业脚本

source: Documents on openstack-manuals
ko_kr: openstack-manuals에 대한 दस장

source: For OpenStack documentation, `openstack-manuals git repository <https://opendev.org/openstack/openstack-manuals>`_ hosts essential OpenStack documents such as `Installation Guide <https://docs.openstack.org/install-guide/>`_, and `Virtual Machine Image Guide <https://docs.openstack.org/image-guide/>`_.
ko_kr: OpenStack 문서의 경우, `openstack-manuals` <https://opendev.org/openstack/openstack-manuals>`_ Git 저장소에서 OpenStack의 중요한 문서가 포함되어 있습니다.例如, `Installation Guide <https://docs.openstack.org/install-guide/>`_, `Virtual Machine Image Guide <https://docs.openstack.org/image-guide/>`_.

source: For each horizon related project in OpenStack, there is an automation job daily to download the translations in PO file to the "locale" folder under the source folder of each project. See :doc:`here <infra>`. It will generate a review request in Gerrit. After :doc:`review <reviewing-translation-import>`, the translation in PO file will be merged.
ko_kr: OpenStack에서 각 horizon 관련된 프로젝트에 대해 일일로 PO 파일을 "locale" 폴더 하위의 소스 폴더에 tải하는 자동화 jobs가 있습니다. :doc:`여기 <infra>`를 확인하십시오. 이will generate a review request in Gerrit. After :doc:`reviewing-translation-import <reviewing-translation-import>`, the translation in PO file will be merged.

source: For each horizon related project in OpenStack, there is an automation job to extract the messages , generate PO template and upload to Zanata, which is triggered by the "commit" event. See :doc:`here <infra>`.
ko_kr: OpenStack에서 각 horizon 관련된 프로젝트에 대해 "commit" 이벤트가 발생할 때, 메시지를 추출하고 PO 템플릿을 생성하고 Zanata에 업로드하는 자동화 jobs가 있습니다. :doc:`여기 <infra>`를 확인하십시오.

source: Here are sample document links as examples:
ko_kr: 이것은 샘플 문서 링크를 예시로 제공합니다.

source: Horizon and Horizon plugins are the main targets which affect StringFreezes. Note that StringFreezes are applied to I18n team target projects and with ``cycle-with-rc`` or ``cycle-with-intermediary`` release model.
ko_kr: Horizon 및 Horizon 플러그인은 StringFreezes에 영향을 미치고 있습니다. StringFreezes는 I18n 팀의 표준 프로젝트에 적용되며, ``cycle-with-rc`` 또는 ``cycle-with-intermediary`` 릴리스 모델을 사용할 때만 적용됩니다.

source: IRC channel: ``#openstack-i18n`` on OFTC
ja: IRCチャンネル： ``#openstack-i18n`` (OFTC)
ko_kr: IRC 채널: ``#openstack-i18n`` on OFTC

source: If you are not familiar with IRC, please read `Contributor Guide <https://docs.openstack.org/contributors/common/communication.html#irc>`_. You can simply use the web client for OFTC to come to `#openstack-i18n channel <https://webchat.oftc.net/?channels=openstack-i18n>`_.
ko_kr: IRC에熟悉하지 않으시면 `Contributor Guide <https://docs.openstack.org/contributors/common/communication.html#irc>`_을 읽어보세요. OFTC의 웹 클라이언트를 사용하여 `#openstack-i18n channel <https://webchat.oftc.net/?channels=openstack-i18n>`_에 접근할 수 있습니다.

source: Installing Zanata CLI and its dependencies. Ensure ``zanata-cli`` command is found in your path.
ko_kr: Zanata CLI와 의존성들을 설치합니다. zanata-cli 명이 PATH에 존재하는지 확인하세요.

source: It is important to validate your translations by applying them in a real situation where they are rendered and visualized. This page describes how to check your translations.
ko_kr: 번역을 확인하는 것은 실제 상황에서 rendering 및 시각화된 번역을 적용하는 것입니다. 이 페이지는 번역을 확인하는 방법에 대해 설명합니다.

source: It is not a complete document for debugging. It was just written as a note. Feel free to add more topics.
ko_kr: 이것은 완전한 디버깅 문서가 아닙니다. 단순히 노트로 작성되었습니다. 더 많은 주제를 추가해 주세요.

source: Loading scripts
ko_kr: 스クリプ트 로드

source: Once your change is merged, the updated glossary will be uploaded to Zanata. Note that the upload to Zanata is a **manual** process now. Only the Zanata administrator (usually the I18n SIG Chair and some limited folks like core reviewers) can upload a glossary. If your glossary is not uploaded, contact the I18n team or the SIG Chair via the i18n mailing list.
ko_kr: 변경이 병합되면, 업데이트된 glossary가 Zanata에 업로드됩니다. Zanata 업로드는 **수동** 프로세스입니다. 현재 Zanata 관리자 (通常 I18n SIG Chair 및 일부 제한된 사람들 like core reviewer)는만 업로드할 수 있습니다. glossary가 업로드되지 않으려면, I18n 팀 또는 SIG Chair를 via i18n 이메일 목록에 연락하세요.

source: One week: `13:30 UTC, Wednesday <https://www.timeanddate.com/worldclock/fixedtime.html?hour=13&min=30&sec=0>`_
ko_kr: 1주: `13:30 UTC, Wednesday <https://www.timeanddate.com/worldclock/fixedtime.html?hour=13&min=30&sec=0>`

source: OpenStack i18n mascot
ja: OpenStack i18n マスコット
ko_kr: OpenStack i18n 마스켓

source: OpenStack project documentation
ko_kr: OpenStack 프로젝트 दस사본

source: Preparations
ko_kr: 준비

source: Prepare ``~/.config/zanata.ini``. See :ref:`Zanata CLI <zanata-cli>` for more detail.
ko_kr: ~/.config/zanata.ini를 준비하세요. <zanata-cli>에 대한 자세한 정보는 참조하십시오.

source: See :doc:`infra-debug`.
ko_kr: :doc:`infra-debug`.

source: Simulating translation changes
ko_kr: 번역 변경 시 simulate

source: Slicing
ja: スライシング
ko_kr: 스ライ싱

source: Slicing: generate PO templates from RST documents
ja: スライシング：RST ドキュメントから PO テンプレートを生成する
ko_kr: 스라이싱: RST दस장에서 PO 템플릿을 생성하는 것

source: Sphinx is a tool to translate RST source files to various output formats, including POT and HTML. You need to install Sphinx before you go to below steps. Almost all projects have ``test-requirements.txt`` in their repositories and you can check the required version of Sphinx by checking this file.
ko_kr: 스피니치는 RST 소스 파일을 다양한 출력 형식, 포함 POT 및 HTML로 번역할 수 있는 도구입니다. Sphinx를 설치해야 합니다. Almost all projects have ``test-requirements.txt`` in their repositories and you can check the required version of Sphinx by checking this file.

source: Stackalytics
ko_kr: 스태크아널티CS

source: Statistics are available through: https://docs.google.com/spreadsheets/d/1YpDJU_uNA4I5fzFG69T6L9gpFsy5yNtA9a-lSxnqeAY/edit#gid=1366189722
ko_kr: 통계는 다음 URL을 통해 확인할 수 있습니다: https://docs.google.com/spreadsheets/d/1YpDJU_uNA4I5fzFG69T6L9gpFsy5yNtA9a-lSxnqeAY/edit#gid=1366189722

source: The I18n team holds weekly Team Meetings on Wednesdays at alternating weekly basis in #openstack-i18n IRC channel. To download ICS file, please visit `OpenDev - IRC channels and meetings <https://meetings.opendev.org/#I18N_Team_Meeting>`_ page.
ko_kr: I18n 팀은 주 5일마다 주 2주 간격으로 매주 수요일에 #openstack-i18n IRC 채널에서 주간 회의를 개최합니다. ICS 파일을 다운로드하려면 `OpenDev - IRC 채널과 회의 <https://meetings.opendev.org/#I18N_Team_Meeting>`_ 페이지를 방문하십시오.

source: The diff would be like http://paste.openstack.org/show/802260/.
ko_kr: diff는 http://paste.openstack.org/show/802260/_로 표시됩니다.

source: The documents are maintained in the ``doc`` directory using `reStructuredText <https://docutils.sourceforge.io/rst.html>`__ and built by `Sphinx <https://www.sphinx-doc.org/>`__. Translated strings are stored as `Gettext PO file format <https://www.gnu.org/server/standards/translations/po-how-to.html>`__ in ``locale/<lang>/LC_MESSAGES`` directory.
ko_kr: 문서는 `reStructuredText <https://docutils.sourceforge.io/rst.html>`__을 사용하여 ``doc`` 디렉토리에 유지 관리되고 Sphinx <https://www.sphinx-doc.org/>으로 구축됩니다. 번역된 문자열은 `Gettext PO file format <https://www.gnu.org/server/standards/translations/po-how-to.html>`__을 사용하여 ``locale/<lang>/LC_MESSAGES`` 디렉토리에 저장됩니다.

source: The other week: `23:15 UTC, Wednesday <https://www.timeanddate.com/worldclock/fixedtime.html?hour=23&min=15&sec=0>`_
ko_kr: 다음 주: `23:15 UTC, 수요일 <https://www.timeanddate.com/worldclock/fixedtime.html?hour=23&min=15&sec=0>`_

source: To build a translated document on this repository, you need to update the file ``doc-tools-check-languages.conf`` in each repository, and add an entry to ``BOOKS`` like ``["ja"]="install-guide"``.
ko_kr: 이 repository에서 번역된 दस장을 만들려면 각 repository의 doc-tools-check-languages.conf 파일을 업데이트하고 BOOKS에 like "["ja"]="install-guide""를 추가해야 합니다.

source: Translated documents are available at the OpenStack Documentation site. It is updated daily. Most contents are linked from:
ko_kr: 번역된 문서는 오픈 스텝 도キュ먼트 사이트에 उपलबhalten합니다. 일일 업데이트가 가능합니다. 대부분의 내용은 :ref:`contents`에서 연결됩니다.

source: What you need are:
ko_kr: 이것이 필요합니다:

source: You can prepare dependencies by following `prepare-zanata-client role <https://opendev.org/openstack/openstack-zuul-jobs/src/branch/master/roles/prepare-zanata-client/tasks/main.yaml>`__.
ko_kr: PREPARE ZANATA 클라이언트 역할을 준비하세요. <https://opendev.org/openstack/openstack-zuul-jobs/src/branch/master/roles/prepare-zanata-client/tasks/main.yaml>

source: You can refer to `previous meeting logs with their notes <https://meetings.opendev.org/meetings/openstack_i18n_meeting/>`_.
ko_kr: 이전 회의 로그와 노트를 참조하십시오.

source: `German OpenStack-Ansible User Guide for 2023.1 <https://docs.openstack.org/openstack-ansible/2023.1/de/user/index.html>`_
ko_kr: 독일 2023.1 OpenStack-Ansible 사용자 가이드 <https://docs.openstack.org/openstack-ansible/2023.1/de/user/index.html>

source: `Korean OpenStack-Helm Installation Guide (no branch) <https://docs.openstack.org/openstack-helm/latest/ko_KR/install/index.html>`_
ko_kr: Korean OpenStack-Helm 설치 가이드 (no branch) <https://docs.openstack.org/openstack-helm/latest/ko_KR/install/index.html>

source: `Translation statistics <https://docs.openstack.org/i18n/latest/translation_stats.html>`_
ko_kr: `번역 통계 <https://docs.openstack.org/i18n/latest/translation_stats.html>`_

source: ``send_patch`` (It is unnecessary as we do not want to propose a real change to gerrit.)
ko_kr: ``send_patch`` (필요하지 않다.จริง한 변경을 제안하지 않는다.)

source: ``translation check`` refers to build OpenStack artifacts with translated strings and check how the translated strings are shown on an actual screen as part of the translation process.
ko_kr: ``translation check``는 오픈 스텝 아트ifacts를 빌드하고, 번역된 문자열이 실제 화면에 표시되는지 확인하는 것을 말한다.

source: https://docs.openstack.org/<lang> contains released documents. Follow "Languages" in https://docs.openstack.org/.
ko_kr: https://docs.openstack.org/<lang>에 release된 दस기본이 있습니다. "Languages"에 대한 정보를 확인하세요.

source: Jori Kuusinen (id: nuyori) - Finnish (Finland)
ja: Jori Kuusinen (id: nuyori) - フィンランド語
