Repository: openstack-kr/knu_i18n_2025
Catalog: po/i18n-docs-source-locale-*.po
Languages: ja, ko_kr, ru

source: When proposing extra ATCs at that time, some translators were not included in `translation_team.yaml <https://opendev.org/openstack/i18n/src/commit/73a36041dbdc45212051c60cbeef3f7783200fd2/tools/zanata/translation_team.yaml>`__ file. It seems that 1) new translators were joined and the statistics was calculated but the file was already created, or 2) there might be some lack of communication with language coordinators, since I18n encouraged each language coordinator to update this file.
ko_kr: extra ATCs를 제안할 때, 일부 번역자들은 `translation_team.yaml <https://opendev.org/openstack/i18n/src/commit/73a36041dbdc45212051c60cbeef3f7783200fd2/tools/zanata/translation_team.yaml>`__ 파일에 포함되지 않았습니다. 이것은 1) 새로운 번역자들이 합류하고 통계가 계산되었지만 이미 파일이 생성된 경우, 또는 2) 언어 조정자가 통신을 할 수 없다는 것을 의미하는 것 같습니다.
ru: Когда вы предлагаете дополнительные ATCs в этот период, некоторые переводчики не были включены в `translation_team.yaml <https://opendev.org/openstack/i18n/src/commit/73a36041dbdc45212051c60cbeef3f7783200fd2/tools/zanata/translation_team.yaml>`__ файл. Возможно, это связано с тем, что 1) новые переводчики присоединились и были подсчитаны, но файл уже был создан, или 2) может быть отсутствие общения с координаторами языков, поскольку I18n encouraged each language coordinator to update this file.

source: When submitting the change to ``openstack/project-config`` for review, use the ``translation_setup`` topic so it receives the appropriate attention:
ru: Когда вы подаете изменение в ``openstack/project-config`` для оценки, используйте тему ``translation_setup``, чтобы оно получило подходящее внимание:

source: When you add a new entry to the glossary, it is highly recommended to add the entry to the master glossary ``glossary/locale/glossary.pot``. By doing this, all language teams can share the glossary.
ja: 新しいエントリを辞書に追加するときは、辞書のマスター辞書 ``glossary/locale/glossary.pot`` にエントリを追加することを強くお勧めします。これによりすべての言語チームが辞書を共有できます。
ko_kr: glossary/locale/glossary.pot``에 새로운 항목을 추가할 때는 매우 추천합니다. 이렇게 하면 모든 언어 팀은 glossary를 공유할 수 있습니다.
ru: Когда вы добавляете новый запись в словарь, очень рекомендуется добавить ее в основной словарь ``glossary/locale/glossary.pot``. Таким образом, все команды языков могут поделиться словарем.

source: When you are using OpenStack (including the dashboard, API or CLI) or are reading translated documentations, if you find something wrong, something you cannot understand, something you cannot agree, or something to be improved, please consider reporting it.
ja: OpenStack (ダッシュボード、API、CLIなど) を使用している場合もしくは翻訳されたドキュメントを読んでいる場合に、何か間違っているか、わからないか、賛成できないか、改善できるか何かを見つけたら、報告してください。
ko_kr: 오픈스택 (포드시트, API 또는 CLI) 사용하거나 번역된 문서를 읽고, 오류가 있거나 이해할 수 없거나 동의할 수 없거나 개선해야 할 때는 제안을 제출해 주세요.
ru: Когда вы используете OpenStack (включая дашборд, API или CLI) или читаете переведенные документации, если вы обнаружите что-то неправильное, что не понимаете, что не согласуемся с, или что нужно улучшить, пожалуйста, рассмотрите отчет.

source: When you want to update a glossary of your language, edit a corresponding glossary file using your favorite editor and propose a change to the Gerrit review system.
ja: 自分の言語の辞書を更新したい場合は、好きな編集器で対応する辞書ファイルを編集し、Gerrit のレビューシステムに提案します。
ko_kr: 어떤 언어의 glossary를 업데이트하고 싶을 때, corresponding glossary 파일을 편집하여 preferred editor를 사용하여, gerrit review 시스템에 변경안을 제안합니다.
ru: Когда вы хотите обновить словарь своей γλώзы, editsirайте соответствующий файл словаря с помощью своего любимого редактора и предлагайте изменение в систему отзыва на Gerrit.

source: When your request is approved, add an item in "Local Translation Teams" in the wiki page, create a wiki page under page `I18nTeam <https://wiki.openstack.org/wiki/I18nTeam/team>`_ (for example, I18nTeam/team/zh_cn) to introduce your team, with the following information at least: the contact information, the web page, and the work items.
ko_kr: 요청이 승인되면, "Local Translation Teams"에 항목을 추가하고, wiki page `I18nTeam <https://wiki.openstack.org/wiki/I18nTeam/team>`_ (예: I18nTeam/team/zh_cn)에서 팀을 소개하여至少 다음 정보를 제공합니다. : 연락처, 웹 페이지, 작업 항목.
ru: Когда ваша заявка будет одобрена, добавьте элемент в «Локальные команды перевода» в странице вики, создайте страницу вики под страницой `I18nTeam <https://wiki.openstack.org/wiki/I18nTeam/team>`_ (например, I18nTeam/team/zh_cn) для представления вашей команды, с учетом следующих минимумных данных: контактная информация, веб-страница и задачи на выполнение.

source: When your request is approved, you will get an email notification.
ja: 承認された場合、メール通知を受け取ります。
ko_kr: 요청이 승인되면, 이메일 알림을 받습니다.
ru: Когда ваша заявка будет одобрена, вы получите уведомление по электронной почте.

source: Where a string is used in Dashboard UI?
ja: ダッシュボード UI で使用されている文字列の場所?
ko_kr: Dashboard UI에서 사용되는 문자열의 위치?
ru: Где используется строка в интерфейсе Dashboard?

source: Where a string is used in source code?
ja: ソースコードで文字列が使用されている場所?
ko_kr: source code에서 사용되는 문자열의 위치?
ru: Где используется строка в исходном коде?

source: Where can I report a bug?
ja: バグを報告するための場所はどこですか?
ru: Где я могу отчетить об ошибке?

source: Where you find a bug you are reporting?
ja: このバグについて報告した場合に、どこを見つけることができますか?
ru: Где вы найдете ошибку, которую вы отчитаетесь?

source: Who can help you?
ja: 誰が助けてくれるのですか?
ru: Кто может помочь вам?

source: With these changes merged, the strings marked for translation are sent to the translation server after each merge to your project. Also, a periodic job is set up that checks daily whether there are translated strings and proposes them to your project together with translation source files. Note that the daily job will only propose translated files where the majority of the strings are translated.
ru: Соответствующие сдвиги объединены, переведенные строки отправляются на сервер перевода после каждого объединения. Кроме того, периодически задается задача, которая проверяет каждый день, есть ли переведенные строки и предлагает их вместе с файлами перевода источника. Примечание: ежедневная задача предложит только те файлы, где большинство строк переведены.

source: Write an email to "openstack-i18n@lists.openstack.org" to introduce yourself and the language team you want to create, together with your ID on Zanata.
ru: Напишите электронную почту на "openstack-i18n@lists.openstack.org" для представления себя и команды по переводу языка, которую вы хотите создать, вместе с вашим ID на Zanata.

source: You also need to setup your repository following the instruction for Python and/or Django project above appropriately.
ru: Вы также должны настроить свой репозиторий в соответствии с инструкциями для Python и/или Django проекта вышеappropriately.

source: You are encouraged to register with your business email, which will help your company to get the credit. If you don't want to, use your personal email will be OK too.
ja: 企業としての credit を得るために、ビジネス E-mail で登録してください。登録しない場合は、パーソナル E-mail でも OK です。
ru: Вы encourgedd regestriratsya s vashim biznesnoi pochtem, kotorie pomogut vašemu kompanii priznat' kredit. Eseh, esli vy neхотите, вы mozhete izpolzovaty vosem personalnyi pochta, eto zhe OK too.

source: You can also check:
ru: Вы также можем проверить:

source: You can check on `Gerrit <https://review.opendev.org/#/q/topic:zanata/translations+(status:open+OR+status:merged)>`__, if the translated strings are imported by the project teams. Core reviewers in each repository are strong encouraged to approve translation sync patches but do not be sad if the translations are not accepted. Zanata Sync jobs are repeated every day until they are merged.
ru: Вы можете проверить на <https://review.opendev.org/#/q/topic:zanata/translations+(status:open+OR+status:merged)>__, если переведенные строки импортированы в проектные команды. Основатели рецензирования в каждом репозитории strongly encourgedd aprobirovat' синхронизацию переводов, но не сожалейтесь, если переводы не принимают. Заната Синхronnye задачи повторяются каждый день до тех пор, пока они не будут merges.

source: You can estimate where a string is used from a location in a source code. (See the previous entry on how to find a location.)
ja: この文字列がソースコード内のどこに使用されているかを推測できます。 (前回のエントリで位置を見つける方法について参照してください。)
ru: Вы можете оценивать, где встречается строка из источного кода. (Просмотрите предыдущий запись, как найти местоположение.)

source: You can extract the messages in code to PO template (POT) with pybabel, where **PROJECT** is a project name like ``nova`` and **VERSION** is a version number. Note that you can omit ``--project`` and ``--version`` options if you just use them locally as they are just used in the POT file header.
ko_kr: PO 템플릿 (POT)에서 메시지를 추출할 수 있습니다. pybabel을 사용하여 **PROJECT**은 프로젝트 이름으로 example: nova, **VERSION**은 버전 번호입니다. POT 파일 헤더에만 사용되는 **--project** 및 **--version** 옵션을 생략할 수 있습니다.-local로만 사용하면 그들은 POT 파일 헤더에서만 사용됩니다.
ru: Вы можете извлечь сообщения в коде в шаблон PO (POT) с помощью pybabel, где **PROJECT** — это имя проекта, например ``nova`` и **VERSION** — номер версии. Примечание: вы можете исключить опции ``--project`` и ``--version``, если вы их используют только местно, поскольку они используются только в шапке файла POT.

source: You can find the location in a source code by checking the POT file.
ko_kr: PO 템플릿 파일의 위치를 확인하여 소스 코드에서 찾을 수 있습니다.
ru: Вы можете найти местоположение в исходном коде, проверив файл POT.

source: You can report a bug in your language (or English).
ja: あなたの言語（または英語）でバグを報告することができます。
ko_kr: 어떤 언어(또는 영어)에서 버그를 보고 싶다면.
ru: Вы можете отчетать о ошибке в вашем языке (или английском).

source: You can see detail member-level statistics data on `HTML version of the page <https://docs.openstack.org/i18n/latest/atc-stats.html>`_.
ja: detail メンバーレベルの統計データを `HTML版のページ <https://docs.openstack.org/i18n/latest/atc-stats.html>`_ を参照してみてください。
ko_kr: 포트 %(port_id)s에 대해 바인딩에 실패했습니다. 자세한 정보는 neutron 로그를 확인하십시오.
ru: Вы можете увидеть дETAЛЕЙ статистики на уровне члена в версии HTML <https://docs.openstack.org/i18n/latest/atc-stats.html>_.

source: You can set the components of your AIO installation in ``tests/vars/bootstrap-aio-vars.yml``. Dependly on your environment the installation takes 1-2 hours. For more details on the AIO configuration, please see `OSA AIO documentation <https://docs.openstack.org/openstack-ansible/latest/user/aio/quickstart.html#building-an-aio>`_.
ja: あなたの AIO インストールのコンポーネントを設定できます。 ``tests/vars/bootstrap-aio-vars.yml`` です。環境に応じてインストールは 1-2 時間かかります。 AIO 設定に関する詳細については、 `OSA AIO ドキュメント <https://docs.openstack.org/openstack-ansible/latest/user/aio/quickstart.html#building-an-aio>`_ を参照してください。
ko_kr: 비어 있는 구성요소
ru: Вы можете задать компоненты своей установки AIO в ``tests/vars/bootstrap-aio-vars.yml``. В зависимости от вашего окружения установка занимает 1-2 часа. Для более подробной информации о настройке AIO, пожалуйста, посмотрите `документацию OSA AIO <https://docs.openstack.org/openstack-ansible/latest/user/aio/quickstart.html#building-an-aio>`_.

source: You must determine whether bugs are **translation bugs** or **bugs in a source project**. Typical i18n bugs in the source project include:
ja: あなたがバグを決定する必要がありますか **翻訳バグ** または **ソースプロジェクトのバグ** です。
ko_kr: bugs는 **번역 오류** 또는 **원본 프로젝트의 버그** 중 하나입니다. 원본 프로젝트의 일반적인 i18n 오류에는 다음과 같습니다.:
ru: Вам необходимо определить, являются ли ошибки **пробелы в переводе** или **bugs в исходном проекте**. Обычные ошибки i18n в исходном проекте включают:

source: You need to create a configuration file in ``$HOME/.config/zanata.ini`` that contains user-specific configuration. For information on how to create a configuration file, see `Zanata CLI configuration <http://docs.zanata.org/en/release/client/configuration/#user-configuration>`__.
ko_kr: 사용자-specific 설정을 $HOME/.config/zanata.ini에 포함하는 configuration 파일을 생성해야 합니다. 사용자 설정 정보에 대한 자세한 내용은 `Zanata CLI 설정 <http://docs.zanata.org/en/release/client/configuration/#user-configuration>`__에서 확인하십시오.
ru: Вам необходимо создать конфигурационный файл в ``$HOME/.config/zanata.ini`` , который содержит настройки пользователя. Для получения информации о том, как создать конфигурационный файл, см. <http://docs.zanata.org/en/release/client/configuration/#user-configuration>`__.

source: You need to update the infra scripts as well to mark a repository as ReactJS project for translation, for details see :ref:`translation_scripts`.
ru: Вам необходимо обновить инфраструктурные скрипты, чтобы отметить репозиторий как проект ReactJS для перевода, для подробностей см. :ref:`translation_scripts`.

source: Your repository contains both Django and Python code.
ru: В вашем репозитории содержится оба Django и Python кода.

source: Your repository defines multiple python modules, but you just want to run the translation jobs for specific module(s).
ru: Ваш репозиторий определяет несколько python-модулей, но вы хотите запустить переводные задачи только для конкретного(ых) модуля(ов).

source: Zanata provides suggestions for translation based on a glossary of your language. The glossary is maintained in the i18n repository.
ja: Zanataは、言語の辞書を使用して翻訳の提案を行います。辞書はi18nリポジトリで管理されています。
ko_kr: Zanata는 언어 glossary를 기반으로 번역을 제안합니다. glossary는 i18n repository에 유지 관리됩니다.
ru: Zanata предоставляет предложения для перевода на основе словаря вашего языка. Словарь обновляется в репозитории i18n.

source: Zanata provides ways to know your activity on Zanata.
ja: Zanataでは、Zanataでの活動について知るための方法が提供されます。
ko_kr: Zanata는 Zanata에서 활동하는 것을 알 수 있는 방법을 제공합니다.
ru: Zanata обеспечивает способы узнать о вашей активности на Zanata.

source: Zbyněk Schwarz (id: tsbook) - Czech
ja: Zbyněk Schwarz (id: tsbook) - チェコ
ko_kr: Zbyněk Schwarz (id: tsbook) - 체코어
ru: Zbyněk Schwarz (id: tsbook) - Чешский

source: [Infra] Setup translation jobs such as ``translation-jobs-newton`` to import translations for stable branches.
ja: [Infra] インフラ設定のための翻訳作業を、例えば ``translation-jobs-newton`` などのジョブを設定して、安定バージョンのバランスをインポートします。
ko_kr: [Infra] Stable branch의 번역 jobs를 import할 수 있도록 translation-jobs-newton과 같은 translation jobs를 설정합니다.
ru: [Инфраструктура] Перевод переводных задач, такие как `translation-jobs-newton`, для импорта переводов в стабильные ветки.

source: [Project] Official release!
ja: [Project] オフィシャルリリース!
ko_kr: [프로젝트] 공식 출시!
ru: [Проект] Официальная версия!

source: [Project] RC2 or RC3 release will be shipped with latest translations. Final RC release will happen one week before the official release week.
ja: [Project] RC2 または RC3 のリリースは最新の翻訳が付属します。最終RCリリースはオフィシャルリリースの週前に発生します。
ko_kr: [프로젝트] RC2 또는 RC3 출시가 가장 최근 번역을 포함하여 배포됩니다. 최종 RC 출시는 공식 출시 주간 전 일주일 전에 발생합니다.
ru: [Проект] Версии RC2 или RC3 будет поставлена последняя версия с переведенными текстами. Финальная версия RC произойдет за неделю до официальной недели выпуска.

source: [Project] Release RC1 and create a stable branch. ``Hard StringFreeze`` is in effect.
ja: [Project] RC1 をリリースし、安定バージョンのブランチを作成する必要があります。 ``Hard StringFreeze`` が有効です。
ko_kr: [프로젝트] RC1을 출시하고 안정적인 브랜치를 만들어야 합니다. 'Hard StringFreeze'가 효과입니다.
ru: [Проект] Выпуск RC1 и создайте стабильную ветку. `Hard StringFreeze` в effect.

source: [Project] Release milestone-3. ``Soft StringFreeze`` is in effect.
ja: [Project] マイルストーン-3 のリリースを実行します。 ``Soft StringFreeze`` が有効です.
ko_kr: [프로젝트] milestone-3. 'Soft StringFreeze'가 효과입니다.
ru: [Проект] Выпуск милиSTONE-3. `Soft StringFreeze` в effect.

source: [Translator] It is suggested to complete translation work by Monday or Tuesday of the Final RC week.
ja: [翻訳者] 最終RC週の最終日曜日または月曜日に、翻訳作業を完了することをお勧めします。
ko_kr: [번역자] 최종 RC 주간의 월요일 또는 화요일까지 번역 작업을 완료하는 것이 제안됩니다.
ru: [Преводчик] Рекомендуется завершить переводную работу до понедельника или вторника недели окончательного RC.

source: [Translator] Start translations for the release.
ja: [翻訳者] リリースの翻訳を開始してください。
ko_kr: [번역가] 번역을 시작합니다.
ru: [Преводчик] Начните переводы для выпуска.

source: [ianychoi] Although one year was already passed (as of now: Jan 15, 2017), I really would like to say those translators also contributed translations with I18n team members. For acknowledgement purpose, I write their Zanata ID, name, and language team in here :
ko_kr: [ianychoi] 한 년이 already passed (현재: 2017년 1월 15일), tôi thực sự muốn nói rằng những 번역가도 번역을 I18n 팀 thành viên과 함께 공유했습니다. For purposes of acknowledgement, tôi viết Zanata ID, name, và language team ở đây :
ru: [ianychoi] Хотя уже прошел один год (по состоянию на сейчас: 15 января 2017 года), я бы хотел сказать, что эти перевальщики также принимали участие в переводах с командой I18n. Для цели признания я пишу их ID Zanata, имя и язык команды здесь :

source: [ianychoi] Note: only "translated" metric was considered to follow the description in I18n contributor guide. After more detail investigation on previous ATC criteria, review metrics were also considered. Fortunately, the three translators (jftalta - 117 translated & 2897 reviews, myamamot - 725 reviews, mucahit - 1241 reviews) are also regarded ATCs from Newton cycle :) - I keep it as record for the next ATC list changes.
ru: [ianychoi] Примечание: только метрика «переведено» была учитываться по описанию в руководстве contributing I18n. После более детального расследования предыдущих критериев ATC, общие метрики также были учтены. Счастливое coincidence трех перевальщиков (jftalta - 117 переведено & 2897 отзывов, myamamot - 725 отзывов, mucahit - 1241 отзыв) также считаются ATCs из Newton цикла :) - я сохраню это для следующего списка ATC изменения.

source: `Bug lists <https://bugs.launchpad.net/openstack-i18n>`_
ja: バグリスト <https://bugs.launchpad.net/openstack-i18n>
ru: `Списки бугов <https://bugs.launchpad.net/openstack-i18n>`_

source: `Dashboard <https://translate.openstack.org/dashboard/>`__ page shows your recent activity statistics this month and detail activity.
ja: トランスラテーション ダッシュボード <https://translate.openstack.org/dashboard/>」ページでは、今年月の recent アクティビティ統計と詳細なアクティビティを表示しています。
ru: `Панель управления <https://translate.openstack.org/dashboard/>`__ страница показывает ваши последние статистические данные по активности за этот месяц и детали о деятельности.

source: `Horizon (OpenStack dashboard) <https://bugs.launchpad.net/horizon>`_
ja: Horizon (OpenStack ダッシュボード) <https://bugs.launchpad.net/horizon>
ru: `Горизон (OpenStack панель управления) <https://bugs.launchpad.net/horizon>`_

source: `Horizon I18n bugs <https://bugs.launchpad.net/horizon/+bugs?field.tag=i18n>`_
ru: `Баги по переводу Horizone <https://bugs.launchpad.net/horizon/+bugs?field.tag=i18n>`_

source: `Language translation team <https://wiki.openstack.org/wiki/I18nTeam/team>`_: you can ask in your language :-)
ko_kr: `국가 번역 팀 <https://wiki.openstack.org/wiki/I18nTeam/team>`_: आप अपन어 언어에서 물어보세요 :-)
ru: `Тeam по переводу OpenStack <https://wiki.openstack.org/wiki/I18nTeam/team>`_: вы можете задать вопросы на вашем языке :-)

source: `Open reviews in openstack/i18n <https://review.opendev.org/#/q/status:open+project:openstack/i18n>`_
ko_kr: `openstack/i18n-openreview <https://review.opendev.org/#/q/status:open+project:openstack/i18n>`_
ru: `Открытые отзывы в openstack/i18n <https://review.opendev.org/#/q/status:open+project:openstack/i18n>`_

source: `OpenStack manuals <https://bugs.launchpad.net/openstack-manuals>`_
ja: オープンストックマニュアル <https://bugs.launchpad.net/openstack-manuals>
ko_kr: `OpenStack 매뉴얼 <https://bugs.launchpad.net/openstack-manuals>`_
ru: `Открытые документы OpenStack <https://bugs.launchpad.net/openstack-manuals>`_

source: `OpenStack-Ansible (OSA) <https://docs.openstack.org/openstack-ansible/latest/>`__ provides Ansible playbooks and roles for the deployment and configuration of an OpenStack environment. As part of the project a feature named 'Translation Check Site' is developed. An OSA instance will fetch translation strings from `translation platform <https://translate.openstack.org/>`__, compile and serve these strings in Horizon. You need a machine with two or four CPU cores, at least 8 GB memory and 70 GB disk to run OSA.
ru: `OpenStack-Ansible (OSA) <https://docs.openstack.org/openstack-ansible/latest/>`__ обеспечивает playbook и роли Ansible для установки и настройки среды OpenStack. В рамках проекта разрабатывается функция «Проверка перевода» . ОСА инстанс загружает переводимые строки из платформы перевода <https://translate.openstack.org/>__ , компилирует их и служит им в Horizon. Для работы OSA требуется машина с двумя или четырьмя ядрами процессора, не менее 8 ГБ ОЗУ и 70 ГБ диска.

source: `Periodic jobs: Syncing into repos <http://zuul.opendev.org/t/openstack/builds?job_name=propose-translation-update>`__
ko_kr: `주기적 일정: Syncing into repos <http://zuul.opendev.org/t/openstack/builds?job_name=propose-translation-update>`__
ru: `Режимы периодических задач: Синхронизация в репозитории <http://zuul.opendev.org/t/openstack/builds?job_name=propose-translation-update>`__

source: `Post jobs - Syncing to Zanata <https://zuul.opendev.org/t/openstack/builds?job_name=upstream-translation-update>`__
ko_kr: `기사 đăng tải - Zanata에 동기화 <https://zuul.opendev.org/t/openstack/builds?job_name=upstream-translation-update>`__
ru: `Посты - Синхронизация с Zanata <https://zuul.opendev.org/t/openstack/builds?job_name=upstream-translation-update>`__

source: `Profile <https://translate.openstack.org/profile/>`__ page provides more nice statistics view. It shows your statistics in this month and last month.
ja: プロファイル <https://translate.openstack.org/profile/>__ page provides more nice statistics view. It shows your statistics in this month and last month.
ko_kr: `프로필 <https://translate.openstack.org/profile/>`__ page provides more nice statistics view. It shows your statistics in this month and last month.
ru: `Профиль <https://translate.openstack.org/profile/>`__ страница предоставляет более приятный вид statistics. Это показывает ваш statistics за этот месяц и прошлый месяц.

source: `Quick reStructuredText <http://docutils.sourceforge.net/docs/user/rst/quickref.html>`__
ja: `Agar ReStructuredText <http://docutils.sourceforge.net/docs/user/rst/quickref.html>`__
ru: `Быстрый руководство по ReStructuredText <http://docutils.sourceforge.net/docs/user/rst/quickref.html>`__

source: `Sphinx documentation <http://sphinx.readthedocs.io/en/latest/rest.html>`__
ru: `Документация Sphinx <http://sphinx.readthedocs.io/en/latest/rest.html>`__

source: `Stackalytics <http://stackalytics.com/>`__ is a popular web site which allows us to know various statistics related to OpenStack. It supports translation statistics :)
ja: `Stackalytics <http://stackalytics.com/>`__ は、OpenStack に関連するさまざまな統計情報を知るための人気のあるウェブサイトです。翻訳統計をサポートしています。)
ru: `Stackalytics <http://stackalytics.com/>`__ - популярный веб-сайт, который позволяет нам ознакомиться с различными статистиками, связанными с OpenStack. Он поддерживает переводные statistics :)

source: `Translation plan <https://translate.openstack.org/>`_
ko_kr: `번역 계획 <https://translate.openstack.org/>`_
ru: `План перевода <https://translate.openstack.org/>`_

source: ``--help`` option shows the detail usage.
ko_kr: ``--help`` 옵션은 사용법을 자세하게 보여줍니다.
ru: ``--help`` опция показывает подробную информацию о использовании.

source: ``<Zanata-project-name>`` is Zanata project name,
ja: ``<Zanata-project-name>`` は Zanata プロジェクト名
ko_kr: ``<Zanata-project-name>``는 Zanata 프로젝트 이름입니다.
ru: Заната-проектное имя является именем Занаты

source: ``<Zanata-project-version>`` is Zanata project version such as ``master`` or ``stable-mitaka``,
ja: ``<Zanata-project-version>`` は Zanata プロジェクトバージョン、例えば ``master`` または ``stable-mitaka``
ko_kr: ``<Zanata-project-version>``는 Zanata 프로젝트 버전이란 ``master`` 또는 ``stable-mitaka``와 같은 것입니다.
ru: Заната-версия является именем Занаты, таким как «мастер» или «стабильная Митака»,
