Repository: openstack-kr/knu_i18n_2025
Catalog: po/llama3.2:3b/*/i18n-docs-source-locale-*.po
Languages: ja, ko_kr, ru

source: For each Python project in OpenStack, there is an automation job daily to download the translations in PO file to the "locale" folder under the source folder of each project. See :doc:`here <infra>`. It will generate a review request in Gerrit. After :doc:`review <reviewing-translation-import>`, the translation in PO file will be merged.
ko_kr: 포트폴리오에서 각 프로젝트에 대해 일일로 PO 파일을 "locale" 폴더에 위치한 소스 폴더의 하위 폴더로 tải-down하는 자동화 jobs이 있습니다. :doc:`여기 <infra>`를 참조하십시오. 이 프로세스는 Gerrit에서 리뷰를 수행하고, PO 파일의 번역이 합병되면 완료됩니다.
ru: Для каждой Python-проекта в OpenStack существует ежедневная автоматизированная задача по загрузке переводов в файле .po в папку "locale" под папкой источника каждого проекта. See :doc:`here <infra>`. Это создаст запрос на обмен в Gerrit. После :doc:`review <reviewing-translation-import>` перевод в файле .po будет объединен.

source: For each Python project in OpenStack, there is an automation job to extract the messages , generate PO template and upload to Zanata, which is triggered by the "commit" event. See :doc:`here <infra>`.
ko_kr: 포트폴리오에서 각 오픈스택 프로젝트에 대해 커밋 이벤트를 트리거로 하는 automation job이 존재하며, 이 job은 포트폴리오에서 각 프로젝트의 메시지를 추출하고 PO 템플릿을 생성하고 Zanata에 업로드하는 것을 수행합니다. :doc:`here <infra>`
ru: Для каждого Python-проекта в OpenStack существует автоматизированная задача по extracciónу сообщений, генерации шаблона для перевода и загрузке на Zanata, которая запускается при событии "коммит". :doc:`здесь <infra>`.

source: For example, in case of nova,
ko_kr: nova 집합의 IP 할당
ru: Например, в случае Nova.

source: For most of the Python projects, the preferred tools for I18N are gettext and babel. The gettext module provides internationalization (I18N) and localization (L10N) services for your Python modules and applications. Babel are a collection of tools for internationalizing Python applications.
ko_kr: Python 프로젝트에서 대부분의 경우, I18N을 위한 선호도 있는 도구는 gettext과 babel입니다. gettext 모듈은 Python 모듈 및 애플리케이션에 국제화 (I18N)와 지역화 (L10N) 서비스를 제공합니다. babel은 Python 애플리케이션의 국제화 (internationalization) 서비스를 제공하는 collection of tools입니다.
ru: Для большинства Python-проектов предпочтительными инструментами для I18N являются gettext и babel. Модуль gettext обеспечивает услуги международизации (I18N) и локализации (L10N) для ваших модулей и приложений. Babel — это коллекция инструментов для международизации Python-приложений.

source: For the dashboard, panel or form name.
ja: パネル
ko_kr: 대시板
ru: Меню

source: For translation of strings in Python files, only a few changes are needed inside a project.
ru: агрегат

source: Foundation membership was validated by calling a REST API in https://openstackid-resources.openstack.org
ko_kr: foundation membership가 openstackid-resources.openstack.org의 REST API를 통해 유효화되었습니다.
ru: Благополучие членства в фондации было оправдано путем вызова REST-API в https://openstackid-resources.openstack.org.

source: Getting in touch
ja: 接触する
ko_kr: 연락을 하기 위해
ru: ВTouchezся с нами.

source: Glossary Management
ja: Gロサリー管理
ko_kr: * 'management': '관리'
ru: Управление

source: Glossary of your language
ja: アグリゲート
ko_kr: * 'aggregate': 집합
ru: * 'aggregate': 'агрегат'

source: Go to `Zanata server <https://translate.openstack.org/>`_
ja: Zanata サーバー <https://translate.openstack.org/>
ko_kr: Zanata 서버 <https://translate.openstack.org/>
ru: Пойти на Zanata сервер <https://translate.openstack.org/>

source: Go to the :doc:`translation tools <tools>` page to understand the tools and scripts which support our translation platform.
ja: :doc:`翻訳ツール <tools>`にアクセスして、翻訳プラットフォームをサポートするツールとスクリプトについて理解します。
ko_kr: :doc:`번역 도구 <tools/translation_tools>`를 확인하여 번역 플랫폼을 지원하는 도구와 스크립트에 대한 정보를 얻으십시오.
ru: Пойти на :doc:`простой перевод <tools/translate>` страницу, чтобы понять инструменты и скрипты, которые поддерживают нашу платформу перевода.

source: Handling documentation projects
ja: ドキュメントプロジェクトを管理する
ko_kr: 다окумент화 프로젝트를 처리하는 방법에 대해 설명합니다.
ru: Обслуживание проектов по документации.

source: Handling horizon projects
ja: Horizon プロジェクトを管理する方法です。
ko_kr: 호라이온 프로젝트를 관리하는 방법에 대해 설명합니다.
ru: Обслуживание Horizon проектов.

source: Handling python projects
ja: Python プロジェクトの管理
ko_kr: Python 프로젝트 관리
ru: Обработка Python-проектов.

source: Handling translation bugs
ja: バグを処理するためのアプローチについて説明します。
ko_kr: * bug fix: 'aggregate' -> '집합' (corrected spelling)
ru: Обработка ошибок при переводе.

source: Handy links (always sort of on the agenda)
ko_kr: *handy links*
ru: Справочные ссылки (заключены в повестку дня всегда)

source: Heleno Jimenez de la Cruz (id: heleno_jimenez) - Spanish (Mexico)
ja: ヘレノ・ヒメネス・デ・ラ・クロス（heleno_jimenez）
ko_kr: Heleno Jiménez de la Cruz (ID: heleno\_jimenez)
ru: ХеленаJiménez de la Cruz (id: heleno_jimenez) - испанский (Мексика)

source: Here is the check list for such case:
ja: * [ ] すべての要素がリスト化されているか確認する
ko_kr: * 집합
ru: Справочник.

source: How are translations handled?
ko_kr: Translate how translations are handled.
ru: Транслитация.

source: How can I report a bug?
ja: バグを報告する方法については、[Glossary](#glossary) を参照してください。
ko_kr: BUG를 보고 싶으시면 다음을 시도해 보세요.
ru: Как вы можете сообщить о ошибке.

source: How to check translations
ja: 翻訳をチェックする方法は以下の通りです。
ko_kr: * **Translation Review**: Review the translated text for accuracy and consistency with the original content.
ru: Как проверить переводы.

source: I18n Core Team
ko_kr: 인터내셔널라이즈먼트 코어 팀
ru: Корей

source: I18n Mailing List Management
ko_kr: 이메일 목록 관리 (Internationalization)
ru: Управление почтовым списком для иностранных языков.

source: I18n blueprints are listed also on `Launchpad <https://blueprints.launchpad.net/openstack-i18n>`__. In normal case a blueprint has an assignee and describes a larger course of a process.
ko_kr: Blueprint은 일반적으로 프로세스의 더 큰 범위에 대한 설명과 부여된 할당자(assignee)를 포함하는 개념입니다.
ru: Блюпринты I18N представлены также на Launchpad <https://blueprints.launchpad.net/openstack-i18n>__. В обычном случае blueprint имеет(assignирован) и описывает более широкий курс процесса.

source: I18n team helps release activities on other projects if the projects have cross-project liaison on I18n team and upon request.
ko_kr: 다국어 팀은 다른 프로젝트에 릴리스 활동을 도와줄 수 있습니다. 이 경우, 프로젝트가 다국어 팀과.cross 프로젝트 연관성이 있는 경우, 그리고 릴리즈를 요청할 때는 다국어 팀의 협력으로 릴리즈 활동을 지원합니다.
ru: Тeam по международной стандартизации помогает releasing активностей на других проектах, если проекты имеют связь между собой в рамках команды по международной стандартизации и при yêuстве.

source: I18n team meeting
ja: I18n チームミーティング
ko_kr: I18n 팀 회의
ru: Съезд по инострanneй лингвистике.

source: IRC meeting commands
ja: * `action`: `アクション`
ru: Команды IRC собрания

source: IRC web client
ja: IRC ウェブクライアント
ko_kr: IRC 웹 클라이언트
ru: ИРС веб-клиент.

source: If a bug reports translation errors of a certain language, it could be called **translation bug**. The translation bug should be fixed in the translation tool.
ja: バグ報告における翻訳エラーは、特定の言語に対する翻訳エラーを表すことができます。翻訳バグを修正するには、翻訳ツールを修正する必要があります。
ko_kr: ترجمة 오류를 báo하는 경우, 그것은 **ترجم기 오류**라고 불리우며, 그것을 الترجم기에서修复해야 합니다.
ru: Если отчет о ошибке содержит переводные ошибки определенного языка, это может быть называться **переводная ошибка**. Переводную ошибку необходимо исправить в инструменте перевода.

source: If a reported bug turns out to be bugs in a source project, You could help
ja: 問題が報告された場合、問題はソースプロジェクトのバグであることがわかった場合、助けることができます。
ko_kr: reported bug가 소스 프로젝트에 있는 버그일 경우,
ru: Если отчетный баг оказывается на самом деле багом в исходном проекте, вы можете помочь.

source: If the repository is a GUI project, use the ``translation-jobs-master-stable`` template. Otherwise use the ``translation-jobs-master-only`` template.
ru: Если репозиторий является GUI-проектом, используйте шаблон `translation-jobs-master-stable`. В противном случае используйте шаблон `translation-jobs-master-only`.

source: If there is a translation bug on a stable version in Zanata, it is highly recommended to fix the same translation bug on the corresponding string in the master version.
ja: バージョンが安定している場合、Zanataで存在する翻訳エラーを修正するには、その同じ翻訳エラーをマスター版の同一文字列に修正することを強くお勧めします。
ko_kr: 안전한 버전에서 Zanata에 있는 번역 오류가 있다면, 동일한 번역 오류를 corresponding string의 master 버전에 적용하는 것을 매우 권장합니다.
ru: Если есть переводный ошибок на стабильной версии в Zanata, то highly recommended fix same translation bug на соответствующую строку в master версию.

source: If you are a speaker of this language, you could help
ja: この言語を母語として話す人なら、助けることができます。
ko_kr: 저는 이 언어를 사용할 수 있습니다.
ru: Если вы хотите, я могу помочь вам с переводом текста из английского на русский.

source: If you are a translator of this language, you could help
ja: **[翻訳]**
ko_kr: '가용 구역'은 'Availability Zone'으로 번역됩니다.
ru: Если вы хотите, я могу помочь вам с переводом текста на русский. Какой текст вы хотите перевести?

source: If you are a translator or a person involved in I18n effort, you may be interested in triaging and fixing translation bugs :)
ja: 翻訳ミスをチェックし、修正する人にとっては興味深いことかもしれません。
ko_kr: 가정집합
ru: Если вы являются переводчиком или участником инициативы по международному сотрудничеству (I18n), то может быть интересно оценивать и исправлять ошибки перевода.

source: If you are lucky to use a same name for launchpad and Zanata IDs, you do not need to do the above. Stackalytics will find your statistics automatically.
ja: 同じ名前を使用する場合、LaunchpadとZanata IDの共通名でなければならない場合は、上記のステップを実行しなくて済みます。Stackalyticsは自動的に統計情報を見つけることができます。
ko_kr: 위의 ID를 사용하지 않으면 스택앨리틱스에서 자체적으로 통계를 찾을 수 있습니다.
ru: Если вы с luckiest использовать один и тот же имя для launchpad и Zanata ID, то не нужно выполнять вышеуказанные шаги. Stackalytics найдут ваши статистика автоматически.

source: If you are reviewing these translations, keep the following in mind:
ko_kr: * **Aggregate**: 집합
ru: Ни один комментарий.

source: If you are unfamiliar with translations in OpenStack, read the `Project Team Guide on Internationalization and Translation <http://docs.openstack.org/project-team-guide/i18n.html>`_ first.
ja: OpenStack の翻訳に関する Project Team Guide を読む必要があります。
ko_kr: OpenStack의 번역에 대한 familiarity을 확인하기 위해 OpenStack 프로젝트 팀 가이드의 국제화 및 번역에 대한 정보를 읽어보세요. <http://docs.openstack.org/project-team-guide/i18n.html>
ru: Если вы не знакомы с переводами в OpenStack, прочитайте «Правила для команды проекта по международной стандартизации и переводу <http://docs.openstack.org/project-team-guide/i18n.html>».

source: If you cannot find your local team, you can request to :ref:`create a local translation team <creating-lang-team>`.
ko_kr: 집합을 찾지 못하실 경우 :ref:` địa phương 번역 팀을 생성하는 방법 <creating-local-translation-team>` 을 사용하여 지역 번역 팀을 요청할 수 있습니다.
ru: Если вы не можете найти свою местную команду, вы можете просить создать :ref:`локальную команду перевода <создание-локальной-команды-перевода>`.

source: If you encounter more complicated things including translation tool chains or something others, the most recommended way is to ask it in the I18n mailing list ``openstack-i18n@lists.openstack.org``. Of course, you can file a bug against a related project directly.
ja: OpenStack の翻訳プロセスにおける複雑な要素やトール チェーンを扱う場合、I18n マイリング リスト ``openstack-i18n@lists.openstack.org`` に問い合わせるのが最も推奨される方法です。ただし、関連するプロジェクトに対して直接のバグを投げることも可能です。
ko_kr: OpenStack의 이스라일어 번역은 OpenStack의 이스라일어 번역을위한 프로젝트입니다. 이 프로젝트는 OpenStack의 이스라일어 번역을위한 프로젝트입니다.
ru: Если вы столкнетесь с более сложными проблемами, включая перевод цепей или что-то другое, то наименьший из возможных способов — задать вопрос в списке ``openstack-i18n@lists.openstack.org``. Naturally, вы можете подать заявление об ошибке в связанном проекте напрямую.

source: If you have a machine running DevStack, there are two ways.
ja: デビースタックを実行しているマシンに、2 つの方法で動作する可能性があります。
ko_kr: DevStack을-running하는 기계가 있다면 두 가지 방법이 있습니다.
ru: Если у вас есть машина,running DevStack, есть два способа.

source: If you have any, don't hesitate to share it :)
ja: なし、 N/A
ko_kr: N/A
ru: Я не имею nothing special.

source: If you notice bad translations in a language, file a bug (see :ref:`reporting_translation_bugs`). Then the translation team will update the translation. We recommend to still import this change as is and import later the fix to not block other valid translations to merge.
ko_kr: 집합은 여러 집합을 포함하는 큰 집합입니다.
ru: Если вы замечаете плохие переводы в языке, сдайте отчет о ошибке (просмотрите :ref:`reporting_translation_bugs`). Тогда команду перевода обновит перевод. Мы рекомендуем все равно импортировать эту изменения как есть и импортировать позже исправление, чтобы не блокировать другие допустимые переводы для объединения.

source: If you visit `openstack-i18n launchpad <https://bugs.launchpad.net/openstack-i18n>`_, we can find **Report a bug** at the right-upper corner. Click to report a bug.
ja: オープンソース・インフラストラクチャの翻訳プロジェクトのバグ報告ページにアクセスする場合、次のURLを使用します。
ko_kr: ` Bugs를 보고 있습니다. `
ru: Если вы посетите `openstack-i18n launchpad <https://bugs.launchpad.net/openstack-i18n>`_, мы можем найти **Отчет о ошибке** в правом верхнем углу. Нажмите на отчет о ошибке.

source: If you want to create a language team and you want to be a coordinator, please follow below steps:
ko_kr: 가상 컴퓨팅 언어 팀을 만들고 coordinators로 참여하고 싶다면 다음 단계를 따르십시오.
ru: Чтобы создать команду языков и стать координатором, следуйте ниже шагам:

source: If you want to help fix I18n bugs of OpenStack, we can find them in the following places:
ja: OpenStack の I18N BUG を修正するには、以下の場所で探すことができます。
ko_kr: OpenStack I18N Bug 찾기
ru: Чтобы помочь исправить ошибки internationalization (I18N) в OpenStack, мы можем найти их в следующих местах:

source: If you want to help to report bugs, add more wishlists, and improve them, you can report and fix bugs at `openstack-i18n in Launchpad <https://bugs.launchpad.net/openstack-i18n>`_. Mark bugs with a tag "tools".
ja: `OpenStack-I18N Bugs`
ru: Чтобы помочь в отчете о bugах, добавьте более желаемые списки и улучшите их, вы можете сообщить и исправить bugs на `openstack-i18n in Launchpad <https://bugs.launchpad.net/openstack-i18n>`_. Маркируйте буги тегом "tools".

source: If your Zanata ID is different from your launchpad ID, Stackalytics will not find your translation statistics. You need to let Stackalytics know your ID mappings. To do this, you need to add your user data into ``detault_data.json`` in `the Stackalytics repository <https://github.com/stackalytics/default_data/>`__.
ja: Zanata IDとLaunchpad IDが異なる場合、Stackalyticsはあなたの翻訳統計を探すことができません。したがって、StackalyticsにIDマッピングを知らせる必要があります。これを行うには、``default_data.json`` というファイルにユーザー データを追加する必要があります。
ko_kr: Zanata ID와 Launchpad ID가 다르면 Stackalytics는 번역 통계를 찾지 못합니다. 이 문제를 해결하려면 Stackalytics에 ID 매핑을 알려야 합니다. 이를 위해 `default_data.json` 파일에 사용자 데이터를 추가해야 합니다. <https://github.com/stackalytics/default_data/>
ru: Чтобы Zanata ID отличался от Launchpad ID, Stackalytics не найдет ваши статистики перевода. Нам нужно informing Stackalytics о тождестве ID. Для этого необходимо добавить свои данные пользователя в `default_data.json` в репозитории <https://github.com/stackalytics/default_data/>.

source: If your Zanata ID is not included in the translator list, you need to update the list to include your Zanata ID. Contact your language coordinator, email the i18n mailing list. You can also submit a patch to update the list by yourself (For detail, see :ref:`sync-translator-list`).
ja: Zanata ID を含まない場合、Zanata ID を翻訳リストに追加する必要があります。翻訳リストを更新するには、言語コーディネーターに連絡し、i18n マーリング リストにメールを送します。 Alternatively、自己でリストを更新することができます (詳細については :ref:`sync-translator-list` を参照してください)。
ko_kr: Zanata ID를 포함하지 않는 경우, Zanata ID를 translator 목록에 추가해야 합니다. 언어 코디네이터와 연락하거나, i18n 이메일 목록에 이메일을 보내거나, 스니프-트랜сл레이터 목록을 업데이트하는 방법은 <a href="sync-translator-list">이곳</a>에서 확인할 수 있습니다.
ru: Если ваш Заната ID не включен в список переводчиков, необходимо обновить список, чтобы включить ваш Заната ID. Сंपरните координатора языка, электронным почтой на i18n-MAILING-LIST. Вы также можете подать patches для обновления списка (Для деталей, см. :ref:`sync-translator-list`).

source: If your repository declares multiple python modules in ``packages`` entry in ``[files]`` section in ``setup.cfg``, the infra scripts run translation jobs for each python module.
ru: Если репозиторий declareet multiple python modules в разделе ``packages`` в секции ``[files]`` в ``setup.cfg``, инфраструктурные скрипты выполняют переводы для каждого python modules.

source: If your repository structure is more complex, for example, with multiple python modules, or with both Django and Python projects, see :ref:`translation-setup-complex-case` as well.
ru: Если структура репозитория более сложная, например с несколькими пайтон модулями или с обеими Дjangо и Пайhton проектами, см. :ref:`перевод-настройка-сложный-случаи`.

source: Implements the first Zuul job (Syncing to Zanata) by executing `upstream_translation_update.sh <https://opendev.org/openstack/openstack-zuul-jobs/src/roles/prepare-zanata-client/files/upstream_translation_update.sh>`__
ru: Использует первый job Zuul (Синхронизация с Zanata) путем выполнения `upstream_translation_update.sh <https://opendev.org/openstack/openstack-zuuxobs/src/roles/prepare-zanata-client/files/upstream_translation_update.sh>`

source: Import latest translations
ru: Оставьте обновление.

source: In addition to IRC, I18n team communication takes place via a mailing list. The `Mailing List Administrator <http://lists.openstack.org/cgi-bin/mailman/admin/openstack-i18n>`__ is watching new subscribers, not allowed posts, and all the other things that come with the operation of such a list.
ko_kr: IRC 및 이18n 팀의 통신은 besides IRC에서, 메일리스트를 통해도 이루어집니다. Mailing List Administrator <http://lists.openstack.org/cgi-bin/mailman/admin/openstack-i18n>`__는 새로운 구독자, 허용되지 않는 포스팅, 그리고 그와 관련된 다른 모든 것들을 감시하고 있습니다.
ru: В дополнение к IRC, команду по переводу и18н занимается почтовым списком. `Правительство почтового списка <http://lists.openstack.org/cgi-bin/mailman/admin/openstack-i18n>`__ надеется отслеживать новых подписчиков, запрещенные публикации и все остальное, что связано с operationом такого списка.

source: In most cases, a source project would be one of:
ja: アプリケーション
ko_kr: 원천 프로젝트는 대부분 다음 중 하나입니다.
ru: В большинстве случаев источником проекта является:

source: In such cases you can declare how each python module should be handled manually in ``setup.cfg``. Python modules declared in ``django_modules`` and ``python_modules`` are treated as Django project and Python project respectively. If ``django_modules`` or ``python_modules`` entry does not exist, it is interpreted that there are no such modules.
ru: В таких случаях вы можете указать, как каждый модуль Python должен быть обрабатывался вручную в ``setup.cfg``. Модули Python,declared в ``django_modules`` и ``python_modules``, обрабатываются как Django проект и Python проект соответственно. Если ``django_modules`` или ``python_modules`` не существует, это означает, что нет таких модулей.

source: In the beginning of each cycle it is a good idea to think about goals for the project in the next months and establish a translation plan. Goals are maybe still left from the last cycle and are to be reviewed. New goals are to be defined on `PTG <https://www.openstack.org/ptg/>`__ or an equivalent event. Orient the team to the `OpenStack-wide goals <https://governance.openstack.org/tc/goals/>`__.
ko_kr: 제품 개발을 위한 목표를 다음 달부터 다시 생각하고 번역 계획을 수립하는 것이 좋습니다. 이전 주기에서 남은 목표는 다시 검토하여 정리해야 합니다. 새로운 목표는 `PTG <https://www.openstack.org/ptg/>`__ 또는 유사한 이벤트에서 정의할 수 있습니다. 팀을 `OpenStack-wide goals <https://governance.openstack.org/tc/goals/>`__에 orient 할 수 있습니다.
ru: В начале каждого цикла важно подумать о целях проекта за следующие месяцы и составить план перевода. Цели могут быть еще не решены в предыдущем цикле и должны быть оценены. Новые цели необходимо определить на `PTG <https://www.openstack.org/ptg/>`__ или аналогичном событии. Ориентировать команду на «общие цели OpenStack <https://governance.openstack.org/tc/goals/>`__.

source: Input a short introduction of yourself, including your name, as "Additional information", then click "Send message".
ja: 私は、翻訳エンジンです。私の名前は「翻訳者」です。私は、英語を日本語に翻訳することを目的としています。私は、正確さと精度を第一に考えており、どんな情報も誤解を招かないようにします。
ko_kr: 저는 명시된 규칙을 지키며, 영어에서 한국어로 번역하는 고급 번역 엔진입니다.
ru: Я - строгий переводчик.

source: Internationalization (I18n) is essential to make OpenStack ubiquitous. The mission of OpenStack I18n team is to make OpenStack ubiquitously accessible to people of all language backgrounds, by enhancing OpenStack software internationalization, providing translation, maintaining a translation platform and managing translation process for better quality of outcomes.
ja: OpenStack の国際化 (I18n) は、オープンソースを世界中で普及させるために不可欠です。オープンソース I18n チームの目標は、オープンソースの国際化を強化し、翻訳を提供し、翻訳プラットフォームを維持し、より優れた結果を得るための翻訳プロセスを管理することです。
ko_kr: OpenStack의 국제화 (I18n)은 오픈 스텝을 전 세계적으로 사용할 수 있게 하는 데 중요합니다. 오픈 스텝 I18n 팀의 목적은 오픈 스텝 소프트웨어를 국제화하여 모든 언어 배경인 사람들을 위한 보다 광범위한 접근성을 제공하고, 오픈 스텝 소프트웨어의 국제화 강화, 번역 제공, 번역 플랫폼 유지 및 번역 프로세스 관리를 통해 더 좋은 결과를 얻는 것을 목표로 합니다.
ru: Международизация (I18n) является необходимым аспектом создания OpenStack ubiquitous. Целью команды по международизации OpenStack является сделать OpenStack доступным для всех людей, независимо от их языковой основы, улучшая международизацию OpenStack--software, предоставляя переводы, управление платформой перевода и управление процессом перевода с целью повышения качества результатов.

source: Is your Zanata ID different from your launchpad ID?
ja: Zanata ID は、Launchpad ID と異なる場合があります。
ko_kr: Zanata ID와 Launchpad ID는 다르다.
ru: Неравенство Zanata и Launchpad ID.

source: Is your Zanata ID included in the `translator list <https://opendev.org/openstack/i18n/src/tools/zanata/translation_team.yaml>`__?
ja: いいえ、私の Zanata ID はリストに含まれていません。
ko_kr: 아니요.
ru: Нет, мой ID Zanata не указан в списке переводчиков <https://opendev.org/openstack/i18n/src/tools/zanata/translation_team.yaml>.

source: It is a good idea to organize glossaries and initiate related discussion.
ko_kr: 집합
ru: Организация словарей и начало обсуждения по связанным темам является хороший подход для улучшения точности и эффективности перевода.

source: It is highly recommended to include the following information.
ja: なし、 N/A
ko_kr: 집합으로 구성된 API 엔드포인트입니다.
ru: Непрерывно recommends включать следующие сведения.

source: It is important to understand how an original string is used in the source code with contextual knowledge for better quality of translations. Unfortunately Zanata translation interface does not show where a target string is used in a source code correspondingly.
ko_kr: `원본 문자열이 소스 코드에 사용되는 방법을 이해하는 것은 원문과 번역의-quality를 향상시키는 데 중요한 역할을 한다. 그러나 Zanata 번역 인터페이스는 원문에서 target 문자열이 사용되는 위치를 표시하지 않는다.`
ru: Понятно, что для улучшения качества перевода важно учитывать контекст использования исходного текста в источном коде.

source: Jori Kuusinen (id: nuyori) - Finnish (Finland)
ja: Jori Kuusinen (ID: nuyori) - フィンランド人
ko_kr: Jori Kuusinen (ID: nuyori) - Suomi (Suomi)
ru: Иорри Куусинен (id: nuyori) - Финский (Финлянда)

source: Keep in mind to work with your `local user group <https://groups.openstack.org/>`_ and the `OpenStack Ambassadors <https://groups.openstack.org/ambassador-program>`_ to raise awareness and gather members :)
ko_kr: openstack ambassador 프로그램에 참여하여 awareness를 높이고 회원들을 gathering하십시오.
ru: Распространить осведомление и собрать участников в своей группе пользователей <https://groups.openstack.org/> и программу посредников OpenStack <https://groups.openstack.org/ambassador-program>.

source: Language Team
ja: 言語チーム
ko_kr: 언어 팀
ru: Команда по переводу

source: Language translation team
ja: 言語翻訳チーム
ko_kr: 언어 번역 팀
ru: Тeam по переводу языков.

source: Launchpad I18n Core Team
ko_kr: launchpad i18n core 팀
ru: Корпус по переводу Launchpad

source: Launchpad bugs & blueprints
ko_kr: Launchpad bug 및 blueprint
ru: Буги Launchpad и蓝PRINT

source: Launchpad bugs, Gerrit reviews, and broken Zuul jobs
ko_kr: 구성장치 오류, Gerrit 리뷰, 및 파이프 라인 jobs의 구체적 오류가 발생했습니다.
ru: Ошибки Launchpad, отзывы в Gerrit и разрушенные работы Zuul.
