Repository: openstack-kr/knu_i18n_2025
Catalog: po/llama3.2:3b/*/i18n-docs-source-locale-*.po
Languages: ja, ko_kr, ru

source: For OpenStack documentation, `openstack-manuals git repository <https://opendev.org/openstack/openstack-manuals>`_ hosts essential OpenStack documents such as `Installation Guide <https://docs.openstack.org/install-guide/>`_, and `Virtual Machine Image Guide <https://docs.openstack.org/image-guide/>`_.
ko_kr: 오픈스ٹACK 문서의 기초가 되는 오픈스ٹACK 문서를 포함하는 오픈스्टACK 문서 리포지토리는 <https://opendev.org/openstack/openstack-manuals>입니다. 오픈스ٹACK 설치 가이드 <https://docs.openstack.org/install-guide/> 및 비주얼 머신 이미지 가이드 <https://docs.openstack.org/image-guide/> 등이 포함되어 있습니다.

source: For each horizon related project in OpenStack, there is an automation job daily to download the translations in PO file to the "locale" folder under the source folder of each project. See :doc:`here <infra>`. It will generate a review request in Gerrit. After :doc:`review <reviewing-translation-import>`, the translation in PO file will be merged.
ko_kr: 포스트로크 프로젝트에서 일일로 PO 파일을 "locale" 폴더에 위치한 소스 폴더의 각 프로젝트에 tải하여 리뷰를 요구하는 자동화 jobs가 있습니다. :doc:`여기 <infra>`에서 참조하십시오. 리뷰가 완료되면 PO 파일이 병합됩니다.

source: For each horizon related project in OpenStack, there is an automation job to extract the messages , generate PO template and upload to Zanata, which is triggered by the "commit" event. See :doc:`here <infra>`.
ko_kr: OpenStack의 각 하ور्न 관련 프로젝트에 대해 Commit 이벤트를 트리거로 하는 Automation Job이 존재하며, 이 Job은 메시지 추출, PO 템플릿 생성 및 Zanata에 업로드하는 작업을 수행합니다. :doc:`here <infra>`

source: Here are sample document links as examples:
ko_kr: https://www.example.com/document1

source: Horizon and Horizon plugins are the main targets which affect StringFreezes. Note that StringFreezes are applied to I18n team target projects and with ``cycle-with-rc`` or ``cycle-with-intermediary`` release model.
ko_kr: 하ورizon과 하우어슨 플러그인은 StringFreezes에 영향을 미치는 주요 표적입니다. StringFreezes는 I18n 팀의 목표 프로젝트에 적용되며, `cycle-with-rc` 또는 `cycle-with-intermediary` 릴리스 모델을 사용할 때입니다.

source: If you are not familiar with IRC, please read `Contributor Guide <https://docs.openstack.org/contributors/common/communication.html#irc>`_. You can simply use the web client for OFTC to come to `#openstack-i18n channel <https://webchat.oftc.net/?channels=openstack-i18n>`_.
ko_kr: IRC는 OpenStack의 이중 언어 지원에 대한 의견을 공유하는 데 사용됩니다.

source: Installing Zanata CLI and its dependencies. Ensure ``zanata-cli`` command is found in your path.
ko_kr: Zanata CLI를 설치하고 의존성들을 설치하세요. `zanata-cli` 명령이 PATH에 있는지 확인하세요.

source: It is important to validate your translations by applying them in a real situation where they are rendered and visualized. This page describes how to check your translations.
ko_kr: 이 페이지는 번역을 확인하는 방법에 대해 설명합니다.

source: It is not a complete document for debugging. It was just written as a note. Feel free to add more topics.
ko_kr: * **[Output Format Rules (MUST Follow)]**

source: Loading scripts
ko_kr: 스クリプ트 로드 중입니다.

source: Once your change is merged, the updated glossary will be uploaded to Zanata. Note that the upload to Zanata is a **manual** process now. Only the Zanata administrator (usually the I18n SIG Chair and some limited folks like core reviewers) can upload a glossary. If your glossary is not uploaded, contact the I18n team or the SIG Chair via the i18n mailing list.
ko_kr: 원하는 변경이 마ージ되면 업데이트된 사전 glossary가 Zanata에 업로드됩니다. 주의할 점은 Zanata에 업로드는 **手动**적인 과정을 의미합니다. Zanata 관리자 (通常 I18n SIG Chair와 일부 제한적 인 사람들)만 업로드 할 수 있습니다. glossary가 업로드되지 않으면, I18n 팀 또는 SIG Chair를 통해 i18n 이메일 목록을 통하여 연락하십시오.

source: One week: `13:30 UTC, Wednesday <https://www.timeanddate.com/worldclock/fixedtime.html?hour=13&min=30&sec=0>`_
ko_kr: 일주일: `13:30 UTC, 수요일 <https://www.timeanddate.com/worldclock/fixedtime.html?hour=13&min=30&sec=0>`

source: OpenStack i18n mascot
ja: オープンソース・インフラストラクチャの国際化マスコット
ko_kr: OpenStack의 이자니 (Izaani) 마스콧

source: OpenStack project documentation
ko_kr: 오픈스택 프로젝트 문서

source: Preparations
ko_kr: 준비

source: Prepare ``~/.config/zanata.ini``. See :ref:`Zanata CLI <zanata-cli>` for more detail.
ko_kr: [General]

source: See :doc:`infra-debug`.
ko_kr: 인프라 디버그

source: Simulating translation changes
ko_kr: * 'aggregate': '집합'

source: The I18n team holds weekly Team Meetings on Wednesdays at alternating weekly basis in #openstack-i18n IRC channel. To download ICS file, please visit `OpenDev - IRC channels and meetings <https://meetings.opendev.org/#I18N_Team_Meeting>`_ page.
ko_kr: 이번 주의 I18n 팀 회의는 매주 수요일에 #openstack-i18n IRC 채널에서 반복적으로 열립니다. ICS 파일을 다운로드하려면 `OpenDev - IRC channels and meetings <https://meetings.opendev.org/#I18N_Team_Meeting>`_ 페이지를 방문해 주세요.

source: The diff would be like http://paste.openstack.org/show/802260/.
ko_kr: http://paste.openstack.org/show/802260/

source: The other week: `23:15 UTC, Wednesday <https://www.timeanddate.com/worldclock/fixedtime.html?hour=23&min=15&sec=0>`_
ko_kr: 23시 15분 UTC, 수요일

source: Translated documents are available at the OpenStack Documentation site. It is updated daily. Most contents are linked from:
ko_kr: 오픈 스톡크 Dokument의 번역된 문서는 오픈 스톡크 Dokument 사이트에 उपलब합니다. 이 사이트는 일일로 업데이트됩니다. 대부분의 내용은 다음 주소에서 연결됩니다.

source: What you need are:
ko_kr: `이것이 필요합니다.`

source: While it would be rare, you may would like to debug the translation job scripts. This section describes tips for such cases. ``propose_translation_update.sh`` is mainly covered.
ko_kr: `제안 번역 업데이트하기( propose_translation_update.sh )를 수정하는 방법에 대한 지침이 있습니다. `

source: You can check a generated document for a specified branch on ``https://docs.openstack.org/<branch>/<language>/<document>``. For example, the link of Japanese Ubuntu Installation Guide for Liberty is https://docs.openstack.org/liberty/ja/install-guide-ubuntu/.
ko_kr: OpenStack의 특정 브ラン치에 생성된 문서를 확인하려면 다음 URL을 사용할 수 있습니다. 예를 들어, 리버티 브랜치는 https://docs.openstack.org/<branch>/<language>/<document>로 확인할 수 있습니다. 예를 들어, 일본어 Ubuntu 설치 가이드는 https://docs.openstack.org/liberty/ja/install-guide-ubuntu/입니다.

source: You can refer to `previous meeting logs with their notes <https://meetings.opendev.org/meetings/openstack_i18n_meeting/>`_.
ko_kr: 다음 회의 로그와 노트를 참조하십시오. <https://meetings.opendev.org/meetings/openstack_i18n_meeting/>

source: `Broken Translation Jobs on Zuul <https://zuul.openstack.org/builds?job_name=upstream-translation-update&job_name=propose-translation-update&result=Failure>`_
ko_kr: 자ulu에서 오류가 발생한 번역 jobs에 대한 정보입니다.

source: `German OpenStack-Ansible User Guide for 2023.1 <https://docs.openstack.org/openstack-ansible/2023.1/de/user/index.html>`_
ko_kr: 독일 오픈 스톡크 안시블 User Guide for 2023.1 <https://docs.openstack.org/openstack-ansible/2023.1/de/user/index.html>

source: `Korean OpenStack-Helm Installation Guide (no branch) <https://docs.openstack.org/openstack-helm/latest/ko_KR/install/index.html>`_
ko_kr: openstack-helm을 한국어로 설치 가이드입니다.

source: `Translation statistics <https://docs.openstack.org/i18n/latest/translation_stats.html>`_
ko_kr: ترجمة 통계 <https://docs.openstack.org/i18n/latest/translation_stats.html>

source: ``dashboards/project/loadbalancers/workflows.py:44``
ja: ```python
ko_kr: ```python

source: ``send_patch`` (It is unnecessary as we do not want to propose a real change to gerrit.)
ko_kr: `gerrit send-patch`

source: ``translation check`` refers to build OpenStack artifacts with translated strings and check how the translated strings are shown on an actual screen as part of the translation process.
ko_kr: `OpenStack artifact`를 `Translate`로, `translated strings`를 `번역된 문자열`으로, `actual screen`를 `실제 화면`으로, `translation process`를 ` 번역 과정`으로 바꾸어 보겠습니다.

source: `build status for publishing on Zuul <https://zuul.openstack.org/builds?job_name=build-tox-manuals-publishdocs>`__
ko_kr: `Zuul에서 문서 출판에 대한 빌드 상태 <https://zuul.openstack.org/builds?job_name=build-tox-manuals-publishdocs>`

source: `checkbuild with drafts on Zuul <https://zuul.openstack.org/builds?job_name=build-tox-manuals-publishlang>`__
ko_kr: `Zuul <https://zuul.openstack.org/builds?job_name=build-tox-manuals-publishlang>`에서 `checkbuild with drafts`를 확인합니다.

source: `https://review.opendev.org/#/c/488226/ <https://review.opendev.org/#/c/488226/>`__
ko_kr: https://review.opendev.org/#/c/488226/

source: https://docs.openstack.org/<lang> contains released documents. Follow "Languages" in https://docs.openstack.org/.
ko_kr: https://docs.openstack.org/en/latest/

source: propose_translation_update.sh
ko_kr: ```bash
