Repository: openstack-kr/knu_i18n_2025
Catalog: po/llama3.2:3b/*/i18n-docs-source-locale-*.po
Languages: ja, ko_kr, ru

source: You can check on `Gerrit <https://review.opendev.org/#/q/topic:zanata/translations+(status:open+OR+status:merged)>`__, if the translated strings are imported by the project teams. Core reviewers in each repository are strong encouraged to approve translation sync patches but do not be sad if the translations are not accepted. Zanata Sync jobs are repeated every day until they are merged.
ko_kr: Gerrit <https://review.opendev.org/#/q/topic:zanata/translations+(status:open+OR+status:merged)>에서 번역된 문자를 확인할 수 있습니다. 프로젝트 팀이 번역된 문자를.import한 경우에만 다음을 trả합니다.
ru: В Gerrit <https://review.opendev.org/#/q/topic:zanata/translations+(status:open+OR+status:merged)> можно проверить переведенные строки, если они импортированы проектными командами. Критические рецензенты в каждом репозитории strongly encourged approving переводных синхronизационных(patchей, но не сожалеть, если переводы не принимаются. Заната Синхронизационные задачи повторяются каждый день, пока они не будут merges.

source: You can estimate where a string is used from a location in a source code. (See the previous entry on how to find a location.)
ja: `IP の割り当て`
ko_kr: `IP 할당`
ru: Вы можете оценивать, где строка используется из точки в источнике кода. (Предыдущий запись о том, как найти местоположение.)

source: You can find the location in a source code by checking the POT file.
ko_kr: IP 위치는 소스 코드에서 찾을 수는 있지만 POT 파일을 통해 확인할 수 있습니다.
ru: Мы можем найти местоположение в источнике кода, проверив файл POT.

source: You can report a bug in your language (or English).
ja: **バグ報告**
ko_kr: I don't have any bugs to report. I am functioning as intended and translating text from English to Korean (South Korea) according to the provided rules and glossary. If you would like me to translate some text, please provide it and I will do my best to assist you.
ru: Я не могу сообщить о bugs в языке, поскольку я — strict translation engine.

source: You can see detail member-level statistics data on `HTML version of the page <https://docs.openstack.org/i18n/latest/atc-stats.html>`_.
ja: 詳細なメンバーレベルの統計データを参照するには、`HTMLバージョンのページの <https://docs.openstack.org/i18n/latest/atc-stats.html>`_ を参照してください。
ko_kr: OpenStack ATC 통계 데이터의 세부 정보는 HTML 버전의 페이지 <https://docs.openstack.org/i18n/latest/atc-stats.html>에서 확인할 수 있습니다.
ru: Возможны дETAЛЕЙ МЕМБЕР-УРОВНЯЩИХ СТАТИСТИКЫ ДАННЫХ на странице HTML версии <https://docs.openstack.org/i18n/latest/atc-stats.html> .

source: You can set the components of your AIO installation in ``tests/vars/bootstrap-aio-vars.yml``. Dependly on your environment the installation takes 1-2 hours. For more details on the AIO configuration, please see `OSA AIO documentation <https://docs.openstack.org/openstack-ansible/latest/user/aio/quickstart.html#building-an-aio>`_.
ja: OSA AIO の設定を設定するには、`tests/vars/bootstrap-aio-vars.yml` という場所にコンポーネントを設定できます。環境によっては、インストールにかかる時間は 1 時間から 2 時間です。より詳細な AIO 設定については、`OSA AIO ドキュメント <https://docs.openstack.org/openstack-ansible/latest/user/aio/quickstart.html#building-an-aio>`_ を参照してください。
ko_kr: OSA AIO를 설정할 수 있는 구성 요소는 ``tests/vars/bootstrap-aio-vars.yml``에 있습니다. 환경에 따라 설치 시간은 1-2시간이 소요됩니다. 더 많은 AIO 구성 정보는 <https://docs.openstack.org/openstack-ansible/latest/user/aio/quickstart.html#building-an-aio>을 참조하십시오.
ru: Вы можете настроить компоненты своей установки AIO в ``tests/vars/bootstrap-aio-vars.yml``. В зависимости от окружения установка занимает 1-2 часа. Для более подробной информации о настройке AIO, пожалуйста, посмотрите <https://docs.openstack.org/openstack-ansible/latest/user/aio/quickstart.html#building-an-aio>.

source: You must determine whether bugs are **translation bugs** or **bugs in a source project**. Typical i18n bugs in the source project include:
ja: **[翻訳エラーまたはソースプロジェクトのバグを区別するためのガイドライン]**
ko_kr: 집합의 정합성 그룹은 정합성 그룹을 사용하여 관리됩니다. 집합의 정합성 그룹은 여러 집합을 연결하는 데 사용됩니다.
ru: Были обнаружены ошибки в исходном проекте, которые не связаны с переводом:

source: You need to create a configuration file in ``$HOME/.config/zanata.ini`` that contains user-specific configuration. For information on how to create a configuration file, see `Zanata CLI configuration <http://docs.zanata.org/en/release/client/configuration/#user-configuration>`__.
ru: Конфигурационный файл необходимо создать в ``$HOME/.config/zanata.ini`` с настройками пользователя. Для информации о том, как создавать конфигурационный файл, см. `Настройка Zanata CLI <http://docs.zanata.org/en/release/client/configuration/#user-configuration>`__.

source: You need to update the infra scripts as well to mark a repository as ReactJS project for translation, for details see :ref:`translation_scripts`.
ru: Вы должны обновить инфраструктурные скрипты, чтобы отметить репозиторий как проект ReactJS для перевода, для подробностей см.:t:translating_infra_scripts

source: Your repository contains both Django and Python code.
ru: В репозитории есть оба Django и Python кода.

source: Your repository defines multiple python modules, but you just want to run the translation jobs for specific module(s).
ru: В репозитории задается несколько Python-модулей, но нам нужно только перевести определенные переводы для конкретных модулей.

source: Zanata
ru: Заната

source: Zanata CLI
ja: Zanata CLIは、翻訳データを管理および操作するためのコマンドラインツールです。
ko_kr: zanata 클라이언트
ru: Заната CLI (Zanata Command-Line Interface)

source: Zanata provides suggestions for translation based on a glossary of your language. The glossary is maintained in the i18n repository.
ja: Zanataは、言語の辞書を使用して翻訳の提案を行います。辞書はi18nリポジトリで管理されています。
ko_kr: Zanata는 언어의 사전을 제공하여 번역에 대한 제안을 제공합니다. 이 사전은 i18n 리포지토리에 유지 관리됩니다.
ru: Заната предоставляет предложения по переводу на основе словаря, который содержит в mình glossary вашего языка. Словарь обслуживается в репозитории i18n.

source: Zanata provides ways to know your activity on Zanata.
ja: Zanata のアクティビティを知るための方法が提供されています。
ko_kr: zanata는 자나타 활동을 확인하는 방법을 제공합니다.
ru: Заната обеспечивает способы узнать о своей деятельности на Заната.

source: Zbyněk Schwarz (id: tsbook) - Czech
ja: Zbyněk Schwarz (ID: tsbook)
ko_kr: Zbyněk Schwarz (ID: tsbook)
ru: Zbyněk Schwarz (id: tsbook) - Čech

source: [Infra] Setup translation jobs such as ``translation-jobs-newton`` to import translations for stable branches.
ja: [インフラ] スタビリティブランチの安定バージョンで翻訳作業を設定するように ``translation-jobs-newton`` などのジョブを設定します。
ko_kr: [인프라] 안정적인 브랜치에 대한 번역 작업을.import하기위한 번역 일정을 설정하는 방법은 다음과 같습니다.
ru: Настройка переводных задач, таких как ``translation-jobs-newton``, для импорта переводов для стабильных веток.

source: [Project] Official release!
ja: 公式リリースです。
ko_kr: 공식 릴리즈!
ru: Официальная версия!

source: [Project] RC2 or RC3 release will be shipped with latest translations. Final RC release will happen one week before the official release week.
ja: 最終RCリリースは公式リリースの1週間前に行われる。RC2またはRC3リリースは最新の翻訳を搭載する。
ko_kr: [발행 계획]
ru: [Проект] RC2 или RC3 выпуск будет поставлен на продажу с последними переводами. Окончательный выпуск RC произойдет в неделю до официального выпуска недели.

source: [Project] Release RC1 and create a stable branch. ``Hard StringFreeze`` is in effect.
ja: [プロジェクト] リリース RC1 を実行し、安定バランスのためのステーブル ブランチを作成します。 'ハード ストリング フリーズ' が有効です。
ko_kr: [프로젝트] 버전 RC1을 출시하고 안정적인 브랜치를 만들고 있습니다. "하드 스트링프리즈"가 효과적입니다.
ru: [Проект] Выпуск RC1 и создание стабильной ветки. `` Hard StringFreeze`` в действии.

source: [Project] Release milestone-3. ``Soft StringFreeze`` is in effect.
ja: [プロジェクト] リリースマイルストーン - 3. 「ソフト ストリング フリーZE」が有効です。
ko_kr: [프로젝트] 리lease 마일스톤 3. "소프트 스티링프리즈"가 효과에 따라 [ soft string freeze ] 소프트 스트링프리즈가 효과에 따라 [ 프로젝트 ]에 대한 모든 변경 사항이 제한되며, [ 프로젝트 ]의 모든 버전은 [ 소프트 스트링프리즈 ] 소프트 스트링프리즈와 동일하다고 선언합니다.
ru: [Проект ] Мил stone -3. "Мягкий" Стресс -Свободный.

source: [Translator] It is suggested to complete translation work by Monday or Tuesday of the Final RC week.
ja: 最終RC週の最終的なRC週までに、月曜日または火曜日までに翻訳を完了することを勧められています。
ko_kr: 2023년 12월 25일까지 완료해야 합니다.
ru: Предлагается завершить переводные работы до понедельника или вторника последнего RC недели.

source: [Translator] Start translations for the release.
ja: リリースを開始します。
ko_kr: 리leases를 시작합니다.
ru: Релиз.

source: [ianychoi] Although one year was already passed (as of now: Jan 15, 2017), I really would like to say those translators also contributed translations with I18n team members. For acknowledgement purpose, I write their Zanata ID, name, and language team in here :
ko_kr: [이안CHO이] 2016년 1월 15일 현재는 이미 한 해가 지났지만, 이 번역자들은 I18n 팀의 일원으로도 많은 기여를 하였습니다. 그들의 Zanata ID, 이름, 언어 팀을 below에 작성하였습니다.
ru: Хотя уже прошло год (по состоянию на сегодняшний день: 15 января 2017 года), я бы хотел сказать, что также translators также contributed translations с I18n team members. Для цели признания я пишу их Zanata ID, имя и языковую команду :

source: [ianychoi] Note: only "translated" metric was considered to follow the description in I18n contributor guide. After more detail investigation on previous ATC criteria, review metrics were also considered. Fortunately, the three translators (jftalta - 117 translated & 2897 reviews, myamamot - 725 reviews, mucahit - 1241 reviews) are also regarded ATCs from Newton cycle :) - I keep it as record for the next ATC list changes.
ko_kr: ATC는 Newton Cycle에서 3명이 ATC로 선정되었습니다. jftalta는 117개 번역과 2897개의 리뷰를 보유하고 있습니다. myamamot와 mucahit도 각각 725개 리뷰와 1241개 번역을 보유하고 있습니다.
ru: [Примечание: только переведенная метрика была рассмотрена для соблюдения описания в руководстве по международной норме (I18n) contributor guide. После более детального исследования предыдущих критериев отчета о проверке (ATC), обновленные метрики также были рассмотрены. Следовательно, три переводчика (jftalta - 117 переведенных и 2897 отзывов, myamamot - 725 отзывов, mucahit - 1241 отзыв) также считаются ATCs из Newton цикла :) - я сохраню это для следующего списка ATC изменения.]

source: `Bug lists <https://bugs.launchpad.net/openstack-i18n>`_
ja: バグリスト <https://bugs.launchpad.net/openstack-i18n>
ko_kr: BUGS
ru: Списки ошибок <https://bugs.launchpad.net/openstack-i18n>

source: `Dashboard <https://translate.openstack.org/dashboard/>`__ page shows your recent activity statistics this month and detail activity.
ja: ダッシュボード <https://translate.openstack.org/dashboard/> では、月の最近のアクティビティ統計と詳細なアクティビティを表示しています。
ko_kr: 대시보드 <https://translate.openstack.org/dashboard/>에서 최근 활동 통계와 이 달의รายละเอียด 활동을 볼 수 있습니다.
ru: Просмотр «Дашборд» <https://translate.openstack.org/dashboard/> показывает наши последние статистические данные за этот месяц и дETAЛЕЙНЫЕ ДЕЯТЬЯ.

source: `Horizon (OpenStack dashboard) <https://bugs.launchpad.net/horizon>`_
ja: `Horizon（オープンソースダッシュボード）<https://bugs.launchpad.net/horizon>`
ko_kr: `Horizon (OpenStack dashboard)`
ru: Горизон (панель управления OpenStack) <https://bugs.launchpad.net/horizon>

source: `Horizon I18n bugs <https://bugs.launchpad.net/horizon/+bugs?field.tag=i18n>`_
ko_kr: 하ورizon 이18n 버그 <https://bugs.launchpad.net/horizon/+bugs?field.tag=i18n>
ru: `Баги Horizon на русском <https://bugs.launchpad.net/horizon/+bugs?field.tag=i18n>`

source: `Language translation team <https://wiki.openstack.org/wiki/I18nTeam/team>`_: you can ask in your language :-)
ja: 言語翻訳チーム <https://wiki.openstack.org/wiki/I18nTeam/team>：あなたの言語で質問できます。
ko_kr: OpenStack I18n 팀 <https://wiki.openstack.org/wiki/I18nTeam/team>
ru: Тeam по переводу языков <https://wiki.openstack.org/wiki/I18nTeam/team>: вы можете задать вопрос на вашем языке.

source: `Open reviews in openstack/i18n <https://review.opendev.org/#/q/status:open+project:openstack/i18n>`_
ko_kr: 오픈 리뷰를 오픈 스톡크/i18n에 열어보세요.
ru: Открыть отзывы в OpenStack/i18n <https://review.opendev.org/#/q/status:open+project:openstack/i18n>

source: `OpenStack manuals <https://bugs.launchpad.net/openstack-manuals>`_
ja: オープンソースマニュアル <https://bugs.launchpad.net/openstack-manuals>
ko_kr: 오픈스톱 매뉴얼 <https://bugs.launchpad.net/openstack-manuals>
ru: Открытые документы OpenStack <https://bugs.launchpad.net/openstack-manuals>

source: `OpenStack-Ansible (OSA) <https://docs.openstack.org/openstack-ansible/latest/>`__ provides Ansible playbooks and roles for the deployment and configuration of an OpenStack environment. As part of the project a feature named 'Translation Check Site' is developed. An OSA instance will fetch translation strings from `translation platform <https://translate.openstack.org/>`__, compile and serve these strings in Horizon. You need a machine with two or four CPU cores, at least 8 GB memory and 70 GB disk to run OSA.
ja: OpenStack-Ansible (OSA) <https://docs.openstack.org/openstack-ansible/latest/> は、オープン スタック環境の展開と構成を目的とした Ansible プレイブックとロールを提供します。プロジェクトの一環として '翻訳チェックサイト'という機能が開発されました。OSA インスタンスは、`translation platform <https://translate.openstack.org/>`__ から翻訳文字列を取得し、コンパイルしてこれらの文字列を Horizon で提供します。OSA を実行するためのマシンには、2 CPU コア以上、8 GB メモリ以上、70 GB ディスクが必要です。
ko_kr: OpenStack-Ansible (OSA) <https://docs.openstack.org/openstack-ansible/latest/>은 OpenStack 환경의 배포 및 구성에 Ansible 플레이북과 롤을 제공합니다. 프로젝트의 일부로 '번역 확인 사이트'라는 기능이 개발됩니다. OSA 인스턴스는 번역 문자열을 `translation platform <https://translate.openstack.org/>`__에서 가져오고, 컴파일하고 Horizon에서 서비스합니다. OSA를 실행하기 위해는 2개 이상의 CPU 코어, 최소 8GB 메모리 및 70GB 디스크가 필요합니다.
ru: OpenStack-Ansible (OSA) <https://docs.openstack.org/openstack-ansible/latest/>

source: `Periodic jobs: Syncing into repos <http://zuul.opendev.org/t/openstack/builds?job_name=propose-translation-update>`__
ko_kr: 기상 일정: 리포지토리에.sync하는 <http://zuul.opendev.org/t/openstack/builds?job_name=propose-translation-update>
ru: Периодические задачи: Синхронизация в репозиториях <http://zuul.opendev.org/t/openstack/builds?job_name=propose-translation-update>

source: `Post jobs - Syncing to Zanata <https://zuul.opendev.org/t/openstack/builds?job_name=upstream-translation-update>`__
ko_kr: `작업 제출 - Zanata와의 동기화 <https://zuul.opendev.org/t/openstack/builds?job_name=upstream-translation-update>`
ru: `Посты задач - Синхронизация с Zanata <https://zuul.opendev.org/t/openstack/builds?job_name=upstream-translation-update>`

source: `Profile <https://translate.openstack.org/profile/>`__ page provides more nice statistics view. It shows your statistics in this month and last month.
ja: プロファイル <https://translate.openstack.org/profile/> ページでは、月の現在と前の月のより美しい統計ビューを提供します。
ko_kr: 이 프로필 <https://translate.openstack.org/profile/>은 더 많은 좋은 통계를 보여주는 페이지입니다. 이 달과 전달의 통계를 보여줍니다.
ru: Профиль <https://translate.openstack.org/profile/> страница предоставляет более приятные статистические данные. Она показывает вашу статистику за этот месяц и предыдущий месяц.

source: `Quick reStructuredText <http://docutils.sourceforge.net/docs/user/rst/quickref.html>`__
ja: .. _quick-restructuredtext:
ru: Скорый руководство по реструктурированному тексту <http://docutils.sourceforge.net/docs/user/rst/quickref.html>

source: `Sphinx documentation <http://sphinx.readthedocs.io/en/latest/rest.html>`__
ko_kr: 스피니кс 도キュ먼트 <http://sphinx.readthedocs.io/en/latest/rest.html>
ru: Справочное руководство Sphinx <http://sphinx.readthedocs.io/en/latest/rest.html>

source: `Stackalytics <http://stackalytics.com/>`__ is a popular web site which allows us to know various statistics related to OpenStack. It supports translation statistics :)
ja: STACKALYTICS <http://stackalytics.com/> は、オープンソースのクラウドコンピューティングプラットフォームであるオープンストックの統計情報を提供する人気のあるウェブサイトです。
ko_kr: 스태크애틱스 (<http://stackalytics.com/>)는 오픈 스택에 대한 다양한 통계를 제공하는 유명한 웹 사이트입니다. 이 사이트는 통계를 번역할 수 있습니다.
ru: Стэкадатизтики <http://stackalytics.com/> — популярный веб-сайт, который позволяет нам знать различные статистику связанные с OpenStack. Это поддерживает перевод статистики :).

source: `Translation plan <https://translate.openstack.org/>`_
ko_kr: 개인적인 번역 계획입니다.
ru: План перевода <https://translate.openstack.org/>

source: ``--help`` option shows the detail usage.
ko_kr: 사용법에 대한รายละเอียด을 보여줍니다.
ru: Помогите, как использовать команду.

source: ``<Zanata-project-name>`` is Zanata project name,
ja: `<Zanata-project-name>`
ko_kr: `<Zanata-project-name>`
ru: Заната-проект `<Zanata-project-name>`

source: ``<Zanata-project-version>`` is Zanata project version such as ``master`` or ``stable-mitaka``,
ja: `<Zanata-project-version>`
ko_kr: `Zanata 프로젝트 버전`
ru: Заната-проектная версия.

source: ``<path>`` is a path of a document such as ``nova/locale``, ``openstack_dashboard/locale`` or ``releasenotes/source/locale``,
ja: ``<path>``
ko_kr: `<path>`
ru: путь `<path>` — путь к документу, например, `nova/locale`, `openstack_dashboard/locale` или `releasenotes/source/locale`.

source: ``<resource>`` is a document name in Zanata.
ja: `リソース`
ko_kr: 자산
ru: Ресурс

source: ``dashboards/admin/aggregates/views.py:104``
ja: ``aggregatesの表示
ko_kr: 집합 views.py:104
ru: `агрегаты административного интерфейса`

source: ``dashboards/project/containers/templates/containers/_update.html:21``
ko_kr: `컨테이너 템플릿을 업데이트합니다.`
ru: `Обновление контейнера`

source: `common_translation_update.sh <https://opendev.org/openstack/openstack-zuul-jobs/src/roles/prepare-zanata-client/files/common_translation_update.sh>`__
ru: `Обновление общих переводов с помощью скрипта common_translation_update.sh <https://opendev.org/openstack/openstack-zuul-jobs/src/roles/prepare-zanata-client/files/common_translation_update.sh>`

source: `create-zanata-xml.py <https://opendev.org/openstack/openstack-zuul-jobs/src/roles/prepare-zanata-client/files/create-zanata-xml.py>`__
ko_kr: ```python
ru: создать XML для Zanata клиента `<https://opendev.org/openstack/openstack-zuul-jobs/src/roles/prepare-zanata-client/files/create-zanata-xml.py>`

source: `https://review.opendev.org/#/c/451625/ <https://review.opendev.org/#/c/451625/>`__
ko_kr: https://review.opendev.org/#/c/451625/
ru: https://review.opendev.org/#/c/451625/

source: `openstack-i18n in Launchpad <https://bugs.launchpad.net/openstack-i18n>`_
ja: オープンソース・インフラストラクチャのための国際化プロジェクト <https://bugs.launchpad.net/openstack-i18n>
ko_kr: `OpenStack-i18n을 Launchpad <https://bugs.launchpad.net/openstack-i18n>`에서 개방합니다.
ru: Открыть OpenStack-I18N в Launchpad <https://bugs.launchpad.net/openstack-i18n>

source: `propose-translation-update.yaml <https://opendev.org/openstack/project-config/src/playbooks/translation/propose-translation-update.yaml>`__
ru: `предложить обновление перевода <https://opendev.org/openstack/project-config/src/playbooks/translation/propose-translation-update.yaml>`

source: `releasenotes/pre.yaml <https://opendev.org/openstack/project-config/src/playbooks/releasenotes/pre.yaml>`__
ru: `релизнотесы/предпросмотр.yaml <https://opendev.org/openstack/project-config/src/playbooks/rелизнотесы/предпросмотр.yaml>`

source: `releasenotes/run.yaml <https://opendev.org/openstack/project-config/src/playbooks/releasenotes/run.yaml>`__
ko_kr: `리leases 노트/Run.yaml <https://opendev.org/openstack/project-config/src/playbooks/releasenotes/run.yaml>`
ru: `релизнотки/проект-конфиг/src/playbooks/релизнотки/run.yaml <https://opendev.org/openstack/project-config/src/playbooks/релизнотки/run.yaml>`

source: `upstream-translation-update.yaml <https://opendev.org/openstack/project-config/src/playbooks/translation/upstream-translation-update.yaml>`__
ru: `обновление перевода upstream-translation-update.yaml <https://opendev.org/openstack/project-config/src/playbook/translation/upstream-translation-update.yaml>`

source: add the source project to "Also affects project" of this bug.
ru: агрегат

source: assign the bug to you or a member of your language team, and then mark it as "In Progress"
ja: **Bug Report**
ko_kr: **Bug Report**
ru: Буг сAssign the bug to me or a member of my language team, and then mark it as "In Progress".

source: bugs in a source project
ja: バグが存在するソースプロジェクト
ko_kr: Bugs in a 소스 프로젝트 (source project)
ru: Буги в исходном проекте.

source: bugs in tool chains
ja: アグリゲート
ko_kr: 집합 오류
ru: Буги в инструментах цепочки

source: confirm the bug
ja: バグ確認中です。
ko_kr: N/A
ru: Надеюсь, что это исправлено.

source: confirm the bug or mark it as incomplete
ja: 無効です。
ko_kr: I don't see a bug to confirm. Please provide the text you'd like me to translate, and I'll be happy to assist you.
ru: Невозможно подтвердить или отметить как неполный этот вопрос.

source: exported the translators contribution statistics from Transifex since 2014-11-01 to 2015-07-16
ko_kr: 2014년 11월 1일부터 2015년 7월 16일까지의 번역자 기여 thống계를 export했습니다.
ru: Экспортировал статистику вклада переводчика с Transifex с 1 ноября 2014 года по 16 июля 2015 года.

source: fix it by visiting a corresponding resource in Zanata and correcting translations.
ja: **[修正された翻訳]**
ko_kr: I'm not capable of directly accessing external resources or websites, including Zanata. However, I can guide you on how to correct the translations.
ru: Следуя [Critical Preservation Rules](MUST Follow), я исправил переводы, посещая соответствующие ресурсы в Zanata.

source: http://lists.openstack.org/pipermail/openstack-dev/2016-May/094215.html
ja: http://lists.openstack.org/pipermail/openstack-dev/2016-May/094215.html を日本語に翻訳します。
ru: https://lists.openstack.org/pipermail/openstack-dev/2016-May/094215.html

source: prioritize the bug
ja: **バグの優先順位**
ko_kr: 집합
ru: Приоритет бага

source: tag it with the project name, for example "horizon" or "docs".
ja: **Horizon**
ru: Нет.

source: tag the bug with a language name
ja: **Bug:** English
ko_kr: `bug`
ru: Тег с ошибкой: английский

source: translation bugs
ja: * 'aggregate': 'アグリゲート'
ko_kr: 집합
ru: Ошибки перевода.

source: Łukasz Jernas (id: deejay1) - Polish (Poland)
ja: Łukasz Jernas（deejay1）(ID：deejay1) - ポーランド（ポーランド）
ko_kr: Łukasz Jernas (id: deejay1) - 폴란드 (Poland)
ru: Łukasz Jernas (id: deejay1) - polski (Польша)

source: AC members of I18n project
ko_kr: I18n 프로젝트의 AC (Active Contributor) 회원들입니다.

source: Active Contributor status in I18n project
ko_kr: ак티브 컨트리부터 status in I18n 프로젝트

source: Commenting out CI-specific codes
ko_kr: ```korean

source: Copy the translation scripts to your working directory from `openstack-zuul-jobs/roles/prepare-zanata-client/files <https://opendev.org/openstack/openstack-zuul-jobs/src/branch/master/roles/prepare-zanata-client/files>`__. In addition, you need to copy ``common.sh`` from `project-config/roles/copy-proposal-common-scripts/files <https://opendev.org/openstack/project-config/src/branch/master/roles/copy-proposal-common-scripts/files>`__ to the same working directory.
ko_kr: ```bash

source: Creating ~/.venv virtualenv
ko_kr: ~/.venv 가irtual-env를 생성합니다.

source: Currently, we support translations for small set of OpenStack project documentations like Horizon, OpenStack-Ansible, and OpenStack-Helm upon requests and available bandwidth. Top-level directory structure on ``doc/source/`` follows with `Documentation Contributor Guide - Project guide setup <https://docs.openstack.org/doc-contrib-guide/project-guides.html>`_ and the corresponding generated documents for ``master`` branch are available at ``https://docs.openstack.org/<project>/latest/<language>/<document>`` URL. For project team documents in stable branch, you can check the documents with ``https://docs.openstack.org/<project>/<branch>/<language>/<document>`` URL.
ko_kr: 현재, OpenStack 프로젝트의 소규모 문서를 지원합니다. Horizon, OpenStack-Ansible, OpenStack-Helm과 같은 프로젝트에 대한 번역을 제공하고 있습니다. 사용 가능한 대역폭에 따라. `Documentation Contributor Guide - Project guide setup <https://docs.openstack.org/doc-contrib-guide/project-guides.html>`_의 top-level directory 구조는 ``doc/source/``로 구성되어 있으며, corresponding generated documents for ``master`` branch는 ``https://docs.openstack.org/<project>/latest/<language>/<document>`` URL에 available 있습니다. 프로젝트 팀 문서는 stable branch에서 확인할 수 있습니다. ``https://docs.openstack.org/<project>/<branch>/<language>/<document>`` URL.

source: Debugging job scripts
ko_kr: 작업 jobs 스크립트를 디버깅하는 방법

source: Documents on openstack-manuals
ko_kr: OpenStack 매뉴얼 문서

source: Environment
ko_kr: 환경
