Repository: openstack-kr/knu_i18n_2025
Catalog: po/llama3.2:3b/*/i18n-docs-source-locale-part.po
Languages: ja, ru

source: **Make sure to include your English language name in a bug summary**. It is also suggested to write a bug summary in English. For example:
ja: **英語のバグサマリーに自分の英語名を含めることが重要です。** また、英語で書いたバグサマリーも推奨されています。例えば：
ru: **Убедитесь, что включите свой английский языковое название в обобщение ошибки. Это также рекомендуется написать обобщение ошибки на английском языке. Например:**

source: :doc:`Your language team <lang_team>` may have useful information to help our translation efforts including translation guidelines, priorities, communication tools and so on. It is worth visited. You can find your language team page at https://wiki.openstack.org/wiki/I18nTeam/team. If you have questions, you can contact your coordinators.
ja: :doc:`ガイド <lang_team>` は、翻訳のためのガイドラインや優先度、コミュニケーションツールなどが含まれている可能性があります。 これらの情報を利用することで、翻訳の努力に役立つかもしれません。 そのためには、https://wiki.openstack.org/wiki/I18nTeam/team のような言語チームのページを見つけます。 質問がある場合は、コーディネーターと連絡してください。
ru: :doc:`Ваши команды по переводу <lang_team>` могут иметь полезную информацию, чтобы помочь нашим усилиям по перевodu, включая руководства по переводу, приоритеты, инструменты связи и так далее. Это стоит посещения. Вы можете найти страницу вашей команды по переводу на https://wiki.openstack.org/wiki/I18nTeam/team. Если у вас есть вопросы, вы можете связаться с вашими координаторами.

source: :ref:`search`
ja: :ref:`検索`
ru: :перегрузка:`пошук`

source: A glossary file of your language is found at ``glossary/locale/<lang>/LC_MESSAGES/glossary.po`` in the i18n repository. The file is a usual PO file.
ja: 言語の辞書ファイルが ``glossary/locale/<lang>/LC_MESSAGES/glossary.po`` という場所で見つかりました。通常の PO ファイルです。
ru: Библиотека словарей вашего языка находится в ``glossary/locale/<lang>/LC_MESSAGES/glossary.po`` в репозитории i18n. Файл является обычным файлом PO.

source: A person who can proofread translations and mark them as reviewed (approved) or rejected.
ja: 翻訳をチェック読みし、翻訳をレビュー(承認)または拒否する人です。
ru: Личность, способная проверять переводы на ошибки и маркировать их как отредактированные (проведенные), либо отклоненные.

source: A person who can submit translations.
ja: 送信を適用する人です。
ru: Человек, который может отправить переводы.

source: A template is a skeleton of static HTML files. In this case, the string is perhaps used in "Update" form in "Container" menu.
ja: コンテナのメニュー「更新」フォームで使用される可能性があります。テンプレートは静的HTMLファイルのスケッチです。
ru: Применение следующих переводных правил: 'container' должен быть переведен как 'контейнер', 'template' должен быть переведен как 'шаблон'.

source: ATC Statistics in past releases
ja: 過去のリリースにおける ATC ステータス
ru: Статистика ATC в прошлых выпусках

source: ATC members of I18n project
ja: ATC メンバー of I18n プロジェクト
ru: Участники ATC - участники I18n проект

source: About this guide
ja: このガイドについて
ru: О «Мастере»

source: After the official release, translating master version is welcome for upstream translation contribution, but the original strings may be changed frequently due to upstream development on the projects.
ja: アップストリームの公式リリース後は、マスターバージョンの翻訳がwelcome です。ただし、オリジナルスตรングは頻繁に変更される可能性があります。上流開発でプロジェクトを扱っているためです。
ru: После официального выпуска перевод «мастер» желателен для внешнего вклада в перевод, но исходные строки могут быть изменены часто из-за разработки на проектах.

source: After you edit the master glossary, ensure to reflect the change to all language glossary files. To do this, run the following command.
ja: アプリケーションを終了します。
ru: Применить эти правила перевода: 'запятая' должно быть переведено как 'запятая', 'мастер' должно быть переведено как 'мастер'.

source: Amandeep Singh Saini (jimidar) - Punjabi (India)
ja: Amandeep Singh Saini （ jimidar ）（インド）
ru: Амандип Синг Синь (Джимидар ) - Пunjabi (Индия)

source: Another convenient way is to check dashboard translations is to run DevStack in your local environment. To run DevStack, you need to prepare ``local.conf`` file, but no worries. Several ``local.conf`` files are shared on the Internet and a minimum example is shown below. From our experience, you need a machine with two or four CPU cores, 8 GB memory and 20 GB disk to run DevStack comfortably. If you enable just major OpenStack projects, the machine requirement would be much smaller like 2~4GB memory.
ja: ディスクは 'ディスク' に、メモリーは 'メモリー' に、プロジェクトは 'プロジェクト' に、ファイル共有は 'ファイル共有' に、スタックは 'スタック' に翻訳されます。
ru: Применять следующие переводы: 'диск' - 'диск', 'окружение' - 'окружение', 'память' - 'память', 'проект' - 'проект', 'использование' - 'использование', 'стек' - 'стек'.

source: As a translator, if reported bugs turns out beyond a translation bug, it is better to ask I18n team members via the mailing list or the IRC channel. They can handle such bugs.
ja: 'member' を 'メンバー' に翻訳する必要があります。
ru: Примечание. 'member' переводится как 'участник'.

source: Bugs in a source project
ja: バグが存在するソースプロジェクト
ru: Буги в исходном проекте

source: Bugs in tool chains
ja: ツールチェーンのバグ
ru: Буги в инструментальных цепочках

source: Bugs in translated documents or dashboard are mainly classified into the following areas:
ja: 翻訳したドキュメントやダッシュボードに含まれるバグは、以下の領域に分類される。
ru: Буги в переведенных документах или дашборде в основном классифицируются по следующим областям:

source: Bugs to report English strings are hard to translate in your language. For example, translators cannot control the order of words, or a plural form is not supported. Usually, this kind of bugs are in the original strings and cannot be fixed just by changing the strings and more work is needed.
ja: エンジニアリング上のバグです。英語のストリングは、言語に適合するように翻訳するのが難しく、例えば、単数形と複数形がサポートされていないり、単語の順序を変更できないためです。通常、このような問題は元のストリングで発生し、単にストリングを変更するだけで解決できず、さらに工夫が必要になります。
ru: Баги для отчета: английские строки имеют трудности с переводом в вашем языке. Например, переводчики не могут контролировать порядок слов, или не поддерживается множественное число. Usually, это kind of bugs находятся в исходных строках и не могут быть исправлены только изменением строк и требуются дополнительные работы.

source: Building
ja: 建物
ru: Строение

source: Builds release notes in both the original (English) version and translated versions (if any).
ja: 英語版と翻訳されたバージョンの両方でリリースノートを構築します。
ru: Создает заметки об обновлении в обоих вариантах: исходном (на английском языке) и переводимом (если имеется).

source: CLI (command line interface)
ja: CLI（コマンドラインインターフェイス）
ru: КLI (командная линия интерфейс)

source: Click "..." on the right, and select "Request to join team".
ja: 右側の「...」をクリックし、「チームに参加する要求」を選択します。
ru: Нажмите "... в правом углу и выберите "Запрос на присоединение к команде".

source: Click "Languages" on the top, all languages will be listed.
ja: トップ部の「言語」ボタンをクリックすると、すべての言語がリストされます。
ru: Нажмите на "Языки" в верхней части, все языки будут liệtраны.

source: Click "Log in" button.
ja: クリックして「ログイン」ボタン。
ru: Нажмите кнопку "Войти".

source: Click the language you want to translate, the language page will be shown.
ja: -click したい言語をクリックすると、言語ページが表示されます。
ru: Нажмите на язык, который вы хотите перевести, страница языка будет показана.

source: Common code used by **propose_translation_update.sh** and **upstream_translation_update.sh**
ja: **propose_translation_update.sh**と**upstream_translation_update.sh**で共通使用されるコード
ru: Общий код, используемый **propose_translation_update.sh** и **upstream_translation_update.sh**,

source: Contents
ja: コンテンツ
ru: Содержание

source: Contributing
ja: 貢献する
ru: Участие

source: Convention
ja: 規範
ru: Конвенция

source: Coordinator
ja: コオレーター
ru: Координатор

source: Creating a Language Team
ja: 言語チームを作成しています。
ru: Создание команды языков.

source: Discuss and review glossary changes in your language team before you propose changes to the Gerrit review system. Reviewers in the Gerrit review system cannot understand your language in most cases, so they can only check syntax or conventions.
ja: Glossaryの変更を言語チームで議論してレビューすること、およびGerritリビューアシステムへの提案を検討する前に行う。 Gerrit リビューアシステムでは、ほとんどの場合、レビュアーズは私の言語を理解できません。したがって、syntaxや規則のみをチェックできるだけです。
ru: Обсуждать и оценивать изменения словаря в вашем команде языка перед тем как предложить их для оценки в системе Gerrit. Reviewеры в системе Gerrit не могут понять ваш язык в большинстве случаев, поэтому они могут только проверять синтаксис или нормы.

source: Documentation
ja: ドキュメンテーション
ru: Документация

source: Downloading
ja: ダウンロード中
ru: Загрузка

source: During translating a dashboard related project, you may want to know "where is this string used in the dashboard?".
ja: プロジェクトに関連するダッシュボードに適用したい場合、ダッシュボードでこの文字列がどこに使用されているかを知りたい。
ru: Проект (проект) может быть связан с дашбордом. В этом случае вы можете знать "где используется этот текст в дашборде?".

source: Each language team has useful information to help our translation efforts. It is worth visited. You can find your language team at https://wiki.openstack.org/wiki/I18nTeam/team.
ja: スタックは 'stack' に等しくなります。
ru: Применить эти переводные правила: 'stack' должно быть переведено как 'стек'.

source: Everyone in the OpenStack community is glad to help you.
ja: オープンストックコミュニティの全員はあなたを助けることを喜んでいます。
ru: Всех в сообществе OpenStack с удовольствием помогут вам.

source: FAQ: I cannot find my name in Stackalytics
ja: FAQ: my nameはスタックalyticsで見つかりません。
ru: FAQ: Я не могу найти свой номер в Stackalytics

source: Finally, propose a patch including all of the above changes to the Gerrit review system.
ja: 最後に、上記のすべての変更を含むパッチをGerritリビューシステムに提案します。

source: Finding and reporting translation bugs is an important step towards better quality of translations in OpenStack.
ja: スタックの検出と報告は、オープンソースの翻訳品質を向上させるために重要なステップです。
ru: Применение этих правил перевода: 'stack' должно быть переведено как 'стек'.

source: Fixing I18n bugs
ja: ロケール化バグを修正しています
ru: Ремонт ошибок internationalization (I18n)

source: For a document in a stable branch, such as the installation guide for Liberty, you need to update the file ``doc-tools-check-languages.conf`` in the target stable branch directly.
ja: 安定バージョンのドキュメント、例えばリバティのインストールガイドを使用する場合、ターゲットの安定バージョンに直接 ``doc-tools-check-languages.conf`` というファイルを更新する必要があります。
ru: Чтобы получить правильную информацию, сначала обновите файл ``doc-tools-check-languages.conf`` в стабильной ветке ``master``, а затем запустите команду ``check-languages``.

source: For documentations, URL and a detail place would be great.
ja: ドキュメンテーションに、URL と詳細な場所が便利です。
ru: Для документации, URL и подробную информацию о местоположении будут полезны.

source: For the dashboard, panel or form name.
ja: ダッシュボード、パネル、フォームの名前
ru: Для названия дашборда, панели или формы.

source: Getting in touch
ja: 接続する
ru: Контактироваться

source: Glossary Management
ja: 辞書管理
ru: Управление словарями

source: Glossary of your language
ja: 辞書

source: Go to `Zanata server <https://translate.openstack.org/>`_
ja: サーバー Zanata サーバー <https://translate.openstack.org/>_
ru: Применить эти правила перевода:

source: Go to the :doc:`translation tools <tools>` page to understand the tools and scripts which support our translation platform.
ja: :doc:`翻訳ツール <tools>`のページに移動して、我们的翻訳プラットフォームをサポートするツールとスクリプトについて理解できます。
ru: Перейти в :doc:`простой инструментар для перевода <tools>`, чтобы понять инструменты и скрипты, которые поддерживают наше платформу перевода.

source: Handling documentation projects
ja: プロジェクトのドキュメントを処理します。
ru: Обрабатываем документационные проекты

source: Handling horizon projects
ja: ハンドリング・ホライズン プロジェクト
ru: Применять горизонтальные проекты

source: Handling python projects
ja: プロジェクトを扱います。
ru: Обрабатывать пайтон проекты

source: Handling translation bugs
ja: 翻訳エラーを処理する
ru: Обработка ошибок при переводе

source: Heleno Jimenez de la Cruz (id: heleno_jimenez) - Spanish (Mexico)
ja: ホレノ・ヒメネス・デ・ラ・クロス（id：heleno_jimenez）- スペイン語（メキシコ）
ru: ХеленаJiménez de la Cruz (id: heleno_jimenz) - испанский (Мексика)

source: Here is the check list for such case:
ja: 次のような場合のチェックリストはこちらです。
ru: В этом случае необходимо выполнить следующий список проверок:

source: How can I report a bug?
ja: バグを報告する方法は？
ru: Как я могу отчетить о ошибке?

source: How to check translations
ja: 翻訳をチェックする方法
ru: Как проверить переводы

source: I18n team meeting
ja: I18n チームミーティング
ru: Съезд инон-команды

source: IRC channel: ``#openstack-i18n`` on OFTC
ja: スタック
ru: `rxtx_factor` argument must be a float between 0 and `g`.

source: IRC meeting commands
ja: IRC会議コマンド
ru: Команды IRC-конференции

source: IRC web client
ja: IRC ウェブ クライアント
ru: IRC веб клиент

source: If a bug reports translation errors of a certain language, it could be called **translation bug**. The translation bug should be fixed in the translation tool.
ja: バグ報告における特定言語の翻訳エラーを報告した場合、この問題は翻訳ツールで修正する必要があります。
ru: Если отчет о ошибке содержит переводные ошибки определенного языка, это может быть называться **переводная ошибка**. Переводную ошибку необходимо исправить в инструменте перевода.

source: If a reported bug turns out to be bugs in a source project, You could help
ja: プロジェクトの報告されたバグが元のソースプロジェクトにBUGが発生している場合、助けて
ru: Если отчетная проблема оказывается уязвимостью в исходном проекте, Вы можете помочь.

source: If there is a translation bug on a stable version in Zanata, it is highly recommended to fix the same translation bug on the corresponding string in the master version.
ja: マスターは必ずしもサポートされません。
ru: Применить эти правила перевода: 'мастер' должен быть переведен как 'мастер'.

source: If you are a speaker of this language, you could help
ja: この言語を話す人なら助けてくれるでしょうか。
ru: Если вы говорите на этом языке, вы можете помочь.

source: If you are a translator of this language, you could help
ja: この言語の翻訳者として、助けてください。
ru: Если вы ищете перевод этого текста, я могу помочь.

source: If you are a translator or a person involved in I18n effort, you may be interested in triaging and fixing translation bugs :)
ja: 翻訳者またはI18nの取り組みに携わる人であれば、翻訳エラーをチェックし修正することは興味深いことです：
ru: Если вы переводчик или человек, участвующий в Efforte по internationalizации, может быть интересно оценивать и исправлять ошибки перевода.

source: If you are lucky to use a same name for launchpad and Zanata IDs, you do not need to do the above. Stackalytics will find your statistics automatically.
ja: These translation rules apply.
ru: Примените эти правила перевода: 'launch' должен быть переводим как 'запуск', 'stack' должен быть переводим как 'стек'.

source: If you are unfamiliar with translations in OpenStack, read the `Project Team Guide on Internationalization and Translation <http://docs.openstack.org/project-team-guide/i18n.html>`_ first.
ja: %(path)s はローカルストレージ上にありません: %(reason)s
ru: .. _i18n:

source: If you encounter more complicated things including translation tool chains or something others, the most recommended way is to ask it in the I18n mailing list ``openstack-i18n@lists.openstack.org``. Of course, you can file a bug against a related project directly.
ja: プロジェクトは 'プロジェクト'、スタックは 'スタック' と翻訳する必要があります。複雑なものが発生した場合、翻訳ツールチェーンや他のものについては、I18n マーリングリスト ``openstack-i18n@lists.openstack.org`` に問い合わせるのが最も推奨されます。ただし、関連するプロジェクトにバグを投げることもできます。
ru: Чтобы переводить 'project' в 'проект', а 'stack' - в 'стек'.

source: If you have a machine running DevStack, there are two ways.
ja: DevStackを実行しているマシンがあります。以下の2つの方法があります。
ru: Если у вас работает машина с DevStack, есть два способа.

source: If you have any, don't hesitate to share it :)
ja: このコンピュートノードのハイパーバイザーがサポートされる最小バージョンよりも古くなっています: %(version)s。
ru: Применяйте эти переводные правила: 'share' должно быть переведено как 'использование'.

source: If you visit `openstack-i18n launchpad <https://bugs.launchpad.net/openstack-i18n>`_, we can find **Report a bug** at the right-upper corner. Click to report a bug.
ja: OpenStack-I18Nのリポジトリを訪問することができます。<https://bugs.launchpad.net/openstack-i18n>。
ru: Запуск

source: If you want to help fix I18n bugs of OpenStack, we can find them in the following places:
ja: OpenStack のI18nバグを修正するには、以下の場所で探すことができます：
ru: Применять эти правила перевода: 'стек' должно быть переводено как 'стек'.

source: If you want to help to report bugs, add more wishlists, and improve them, you can report and fix bugs at `openstack-i18n in Launchpad <https://bugs.launchpad.net/openstack-i18n>`_. Mark bugs with a tag "tools".
ja: 起動を実行します。
ru: Ожидается запуск

source: If your Zanata ID is different from your launchpad ID, Stackalytics will not find your translation statistics. You need to let Stackalytics know your ID mappings. To do this, you need to add your user data into ``detault_data.json`` in `the Stackalytics repository <https://github.com/stackalytics/default_data/>`__.
ja: 起動は 'launch' から '起動' に、スタックは 'stack' から 'スタック' に、ユーザーは 'user' から 'ユーザー' に置き換えられます。
ru: Чтобы запустить этот образ, необходимо указать флаг images_volume_group для использования образов LVM.

source: If your Zanata ID is not included in the translator list, you need to update the list to include your Zanata ID. Contact your language coordinator, email the i18n mailing list. You can also submit a patch to update the list by yourself (For detail, see :ref:`sync-translator-list`).
ja: 送信を実行するには、Zanata IDがリストに含まれていない場合、リストに自分の Zanata ID を追加する必要があります。リストに自分の Zanata ID が含まれていない場合は、言語コーディネーターに連絡してください。i18nメールリストへの連絡も可能です。送信を実行するには、自分自身でリストを更新することもできます(詳細については :ref:`sync-translator-list` を参照してください)。
ru: Отправить. Если ваш Заната ID не включен в список переводчиков, необходимо обновить список, чтобы включить ваш Заната ID. Сंपरните координатора языка, электронно-южьте-mail на тему i18n. Вы также можете отправить patches для обновления списка самому (Для деталей, см. :ref:`sync-translator-list`).

source: Import latest translations
ja: 最新の翻訳をインポートします。
ru: Импорт последних переводов

source: In most cases, a source project would be one of:
ja: プロジェクトの場合、主なプロジェクトは次のいずれかになります。
ru: Применяйте эти правила перевода: 'проект' должен быть переведен как 'проект'.

source: Input a short introduction of yourself, including your name, as "Additional information", then click "Send message".
ja: 追加情報
ru: Дополнительно: Могу предоставить информацию о себе, но это не является функцией, поскольку я просто переводчик.

source: Internationalization (I18n) is essential to make OpenStack ubiquitous. The mission of OpenStack I18n team is to make OpenStack ubiquitously accessible to people of all language backgrounds, by enhancing OpenStack software internationalization, providing translation, maintaining a translation platform and managing translation process for better quality of outcomes.
ja: スタックの構築は有効ではありません。
ru: Применение международных стандартов (I18n) имеет решающее значение для того, чтобы OpenStack стал ubiquitous. Миссия команды по международной standardizации OpenStack - сделать OpenStack доступным для всех людей, независимо от их языковой основы, улучшая международную интернализацию OpenStack, предоставляя переводы, управление платформой перевода и управление процессом перевода с целью повышения качества результатов.

source: Is your Zanata ID different from your launchpad ID?
ja: ZanataのIDは、LaunchpadのIDと異なりますか。
ru: Запуск

source: (optional) Put your language name as bug tag.
ru: Недопустимое выражение исключения %r
