Repository: openstack-kr/knu_i18n_2025
Catalog: po/llama3.2:3b/*/i18n-docs-source-locale-*.po
Languages: ja, ko_kr, ru

source: Liberty cycle
ja: 自由周期
ko_kr: 자유성 주기
ru: Сикл свободы.

source: Mailing List: `openstack-i18n@lists.openstack.org <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-i18n>`_
ja: オープン スタック インターネーション マイラージュリスト <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-i18n>
ko_kr: `오픈스택 인프라 이자이너스 mailing list <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-i18n>`
ru: Почтовый список: `openstack-i18n@lists.openstack.org`

source: Make sure to include a short introduction because it is the only information which language coordinators can use to determine your join request is valid or not.
ja: **Join Request for Translation Engine**
ko_kr: **Join Request for Translation Engine**
ru: **Примечание к переводчику**

source: Managing a Language Team
ja: 言語チームの管理
ko_kr: 어떤 언어 팀을 관리하는 방법에 대해 설명합니다.
ru: Управление командой по переводу.

source: Masaki Matsushita (id: mmasaki) - Japanese
ja: マサキ・マツシタ（いちばん：まさき、ふつう：まつした、マツシタ）
ko_kr: マサキ・マツシタ（いちばん：まさき まつした、英: Masaki Matsushita, 1995年8月14日生まれ）は、日本のプロボクサー。日本人で初めてWBA（世界ボクシング協会）世界スーパーフェザー級王者を獲得した選手である。
ru: Масаки Мatsuшита (id: mmasaki)

source: Master glossary
ja: * 'aggregate': 'アグリゲート'
ko_kr: * 'aggregate': 집합
ru: Мастер

source: Meeting agenda
ja: 会議の予定書
ko_kr: 회의 일정
ru: Съездочный план

source: Member (translator)
ja: メンバー
ko_kr: 멤버
ru: участник

source: Missed translations. Missed translations might be caused by not extracting English strings from the source project, or be caused by real missed translations. If the translations are missed in two different languages, they are probably bugs in the source project. Or else, they are real missed translations.
ja: **[翻訳結果]**
ko_kr: * 'aggregate': '집합'
ru: Ошибки перевода могут быть вызваны тем, что не извлекли английские строки из источного проекта, или они являются реальными пропущенными переводами. Если переводы пропускаются в двух разных языках, это probably является ошибкой в исходном проекте. Иначе, это real missed translations.

source: Mitaka cycle
ja: マタカサイクル
ko_kr: 미타카 사이클
ru: Цикл Митака.

source: Monitoring translation jobs status
ja: 監視翻訳作業のステータス
ko_kr: 監итор링 번역 일자지표 상태
ru: Наблюдение за статусом перевода задач мониторинга.

source: More complex cases
ru: **[Output Format Rules (MUST Follow)]**

source: More convenient way is to use **tox** like ``tox -e venv -- python <script-name>``.
ko_kr: `venv`를 사용하여 환경을 설정하고, `tox`를 사용하여 여러 Python 버전에서 스크립트를 실행할 수 있습니다.
ru: Использование tox для более удобной конфигурации.

source: More information on mailing list: http://lists.openstack.org/pipermail/openstack-i18n/2015-July/001220.html
ko_kr: http://lists.openstack.org/pipermail/openstack-i18n/2015-July/001220.html
ru: Список рассылки: «openstack-i18n» находится по адресу http://lists.openstack.org/pipermail/openstack-i18n/2015-July/001220.html.

source: More information: https://releases.openstack.org/ocata/schedule.html & https://ttx.re/splitting-out-design-summit.html
ko_kr: * 2016년 10월 13일부터 2017년 3월 9일까지의 OpenStack Ocata 버전은 OpenStack의 12th 버전입니다.
ru: Сортировка по дате:

source: Most teams have single approval for translation imports instead of two core reviewers.
ko_kr: 다양한 팀은 번역.import의 단일 승인과 두 핵심 리뷰어를 사용하는 것 사이에서 중립적입니다.
ru: Большинство команд используют однородную проверку для импорта переводов вместо двух основных рецензентов.

source: Newton cycle
ja: ニュートンサイクル
ko_kr: 뉴트ン 시클
ru: Цикл Ньютона

source: No detail data.
ja: アグリゲート
ko_kr: 집합
ru: Нет детальной информации.

source: Nobody should change translation files (the `.po` files in the `locale` directory) besides the bot. The next automatic import will override any change again. Therefore, leave a ``-1`` vote on any such changes and point developer to this document.
ko_kr: nobody는 번역 파일을 변경해야 합니다. (.po 파일은 locale 디렉터리의 다음 tự động.import이 변경을 다시 ओवर라이드 할 수 있습니다. 따라서, 변경된 경우 -1 투표를 남겨 주세요. 개발자에게 이 문서를 참조하도록 지시하세요.
ru: Никто не должен изменять файлы перевода (.po) в директории locale, кроме бота. Следующий автоматический импорт будет переоценивать любые изменения и снова их заменить. Поэтому оставляйте -1 голос за любые такие изменения и указывайте разработчикам на этот документ.

source: Note that not all translation changes are the target for translation jobs. The goal is to have consistent translated programs, UIs, and documentation. There is not much sense if only a few lines are translated. The team has decided that files that have at least 75 percent of messages translated will be in the git repositories.
ru: Предполагается, что все изменения будут включены в репозиторий только тогда, когда минимум 75% сообщений переведены.

source: Note that the infra scripts run the same test, so adding it to your project is optional.
ru: Примечание: сценарий запуска инфраструктуры выполняется один и тот же тестом, поэтому его можно добавить в проект по желанию.

source: Note that the scripts in the tasks use `zanata-cli <http://docs.zanata.org/en/release/client/>`__ to pull and push translation content.
ko_kr: zanata-cli <http://docs.zanata.org/en/release/client/>를 사용하는 스크립트의 일체는 다음과 같습니다.
ru: Заната-CLI использует скрипты в задачах для обмена содержанием перевода с помощью `<http://docs.zanata.org/en/release/client/>`__ zanata-cli <http://docs.zanata.org/en/release/client/>`.

source: Note that this is just enabling translations, the actual translations are done by the i18n team, and they have to prioritize which projects to translate.
ru: Примечание: это только включение перевода, фактические переводы выполняются командой i18n и они должны приоритизировать проекты для перевода.

source: Note that you need to log into Zanata to see your activity in the above pages.
ja: Zanata にログインすることで、上のページのアクティビティを確認できます。
ko_kr: Zanata 활동을 확인하기 위해 로그인해야 합니다.
ru: Войти в Zanata, чтобы просмотреть свою активность на этих страницах.

source: Note: the period is relative short because of release cycle change
ko_kr: IP 할당
ru: Примечание: период обновления сократился из-за изменения цикла обновления.

source: Now you can start your translation. You can actually become an OpenStack official translator by contributing translations. You can find :doc:`various ways of contributions <contributing>`.
ja: OpenStackの公式翻訳者になります。貢献するための:doc:`さまざまなコンテンツの作成方法 <contributing>`を参照してください。
ko_kr: OpenStack의 공식 번역자로 활동할 수 있습니다. :doc:`various ways of contributions <contributing>`를 참고하여 다양한 기여 방법을 exploration 하세요.
ru: Теперь я могу начать перевод. Я могу стать официальным переводчиком OpenStack,Contribуя к переводам. Вы можете найти :doc:`различные способы участия в contributor <contributing>`.

source: Ocata cycle
ja: オカタサイクル
ko_kr: Ocata 시리즈
ru: Сикл Оцата.

source: Odd and even values are calculated based on `ISO week numbers <https://www.timeanddate.com/date/weeknumber.html>`_.
ja: ISO 週数の奇数と偶数値は、<https://www.timeanddate.com/date/weeknumber.html> から取得される ISO 週番号に基づいて計算されます。
ko_kr: ISO 주간 번호 <https://www.timeanddate.com/date/weeknumber.html>에 따라奇偶 값이 계산됩니다.
ru: Неравенство нечетных и четных чисел основано на ISO-неделях <https://www.timeanddate.com/date/weeknumber.html>_.

source: Of course there is no need that team coordinators do all items. You can collaborate your team members and share ideas.
ko_kr: 팀 코디네이터가 모든 항목을 처리해야 하는 것은 필요하지 않습니다. 팀원들이 협력하여 아이디어를 공유할 수 있습니다.
ru: Нет необходимости, что команды координируются для выполнения всех задач. Вы можете сотрудничать с членами своей команды и обменять идеями.

source: Official OpenStack translator
ja: オープンソック official トランスレーターです。
ko_kr: 공식 오픈 스톡트 라인터프리
ru: Официальный переводчик OpenStack.

source: On the other hand, translating stable version as upstream contribution is not encouraged after the translated strings are packaged with releases. The stable version will be closed earlier than or around EOL.
ja: 一方で、安定バージョンをアップストリームの貢献として翻訳することは、リリースパッケージに翻訳された文字列が含まれている後は推奨されません。安定バージョンはEOL（エンド・オブ・ライフ）より早く閉じられます。
ko_kr: 대신 안정 버전은 업스트림 기여가에 대한 번역이 khuyến진되지 않는다. 안정 버전은 EOL 이전에 또는 EOL과 같은 시기에 닫히기 때문에 번역된 문자를 패키징한 후에 사용할 수 없다.
ru: Вместе с тем перевод стабильной версии в виде contributorа upstream не рекомендуется после того, как переведенные строки упакованы с релизами. Стабильная версия будет закрыта раньше или примерно на этапе конечного цикла жизни (EOL).

source: Once you find location(s) of a string you would like to check, you can check more detail context where the string is used by looking at the code in the git repository. Zanata project and git repository are one-to-one relationship. If Zanata project name is ``<Zanata-project-name>``, the corresponding git repository location is ``https://opendev.org/openstack/<Zanata-project-name>/``. For example, if you are translating ``horizon``, the git repository is found at https://opendev.org/openstack/horizon/.
ko_kr: Zanata 프로젝트 이름이 `<Zanata-project-name>` 인 경우, corresponding git 레포지토리 위치는 `https://opendev.org/openstack/<Zanata-project-name>/` 이다. 예를 들어, "horizon"를 번역하는 경우, git 레포지토리는 https://opendev.org/openstack/horizon/ 로 찾을 수 있다.
ru: Всегда когда вы найдете местоположение строки, которую вы хотите проверить, вы можете проверить более детальный контекст, в котором строка используется, смотря на код в репозитории Git. `Zanata` проект и репозиторий имеют однозначную связь. Если `Zanata` проектное имя равно `<Zanata-project-name>`, соответствующее местоположение репозитория находится в ``https://opendev.org/openstack/<Zanata-project-name>/``. Например, если вы переводите ``horizon``, репозиторий находится на https://opendev.org/openstack/horizon/.

source: One of main goals in I18n team is to incorporate translated strings into a new release so that more global users experience translated version of OpenStack. To accomplish this goal, some of team activities need to be aligned with a release schedule.
ko_kr: 개인적인 목표 중 하나는 오픈 스텝의 번역된 문자를 새로운 릴리스에 포함하여 전 세계 사용자들이 오픈 스텝의 번역된 버전을 경험할 수 있도록 하는 것이다. 이 목표를 달성하기 위해 I18n 팀의 활동은 릴리스 sche줄과 일치해야 한다.
ru: Одним из основных целей команды по международизации является внедрение переведенных строк в новую версию, чтобы обеспечить более глобальный опыт пользователей OpenStack. Чтобы достичь этого цели, некоторые действия команды необходимо synchronизировать с графиком выпуска.

source: One way is to update the horizon code only. The following shell script fetches the latest horizon code, compiles translation message catalogs and reloads the apache httpd server. Replace ``$BRANCH`` with an appropriate branch such as ``master``, ``stable/newton`` or ``stable/mitaka``.
ja: ```bash
ko_kr: ```bash
ru: Правильный способ обновить код Horizon — это обновить только код Horizon. Следующий скрипт получает последнюю версию кода Horizon, компилирует каталоги сообщений о переводе и перезагрузывает сервер Apache HTTPD.

source: Open a POT file you find and search a string you are interested in. Then you can find an entry like:
ru: `msgid "aggregate"

source: Open discussion
ru: Открытый дискussion

source: Open reviews I18n repository
ko_kr: 리뷰 I18n 레포지토리를 열기 위해 다음 명령을 사용합니다.
ru: Открыть отзывы для перевода - репозиторий i18n.

source: OpenStack Dashboard
ja: オープンソース・クラウドコンピューティング・プラットフォームのオペレーション・コントロール・インターフェイス
ko_kr: 오픈 스톡드 디스플레이
ru: Портал OpenStack.

source: OpenStack I18n Guide
ja: オープンソース・クラウドコンピューティング・プラットフォームである OpenStack の翻訳ガイドです。
ko_kr: OpenStack Internationalization Guide
ru: Гид по internationalization OpenStack.

source: OpenStack I18n team
ja: オープンソース・クラウドコンピューティング・プラットフォーム・オープンソース・クラウド・コンピューティング・プラットフォーム
ko_kr: 오픈 스톡크 I18N 팀
ru: Команда по переводу OpenStack.

source: OpenStack I18n team is a team to coordinate all language translations and cooperation with the I18n team and the development teams. I18n team usually has a working plan.
ko_kr: OpenStack I18n 팀은 모든 언어 번역 및 I18n 팀과 개발 팀의 협력을 조정하는 팀입니다. 일반적으로 I18n 팀은 작업 계획을 가지고 있습니다.
ru: Контроль над переводами OpenStack — это команда, которая координирует все переводы языков и сотрудничество с командой по переводу и командами разработки. Команда по переводу обычно имеет рабочий план.

source: OpenStack I18n team uses `Launchpad <https://bugs.launchpad.net/openstack-i18n>`_ for the bug tracking.
ja: オープンソース・インフラストラクチャのリーダーシップチームが、`<https://bugs.launchpad.net/openstack-i18n>`_ のバグトレッキングを使用しています。
ko_kr: 오픈스택 이중화 팀은 <https://bugs.launchpad.net/openstack-i18n>을 사용하여 버그 트래킹합니다.
ru: Открытая платформа Launchpad <https://bugs.launchpad.net/openstack-i18n> используется OpenStack I18n командой для отслеживания ошибок.

source: OpenStack I18n team: See :ref:`label-i18n-team-contact`
ja: オープンソークのI18Nチーム：参照： :ref:`label-i18n-team-contact`
ko_kr: OpenStack I18n 팀: <https://www.openstack.org/team/i18n/>
ru: Сотрудники по переводу OpenStack: посмотрите :ref:`label-i18n-team-contact`

source: OpenStack documents are using RST format. The steps to translate RST documents include:
ko_kr: * **Translate the contents of the document**:
ru: Октавер documentы используются в формате RST. Шаги по переводу RST документов включают:

source: OpenStack uses Zanata as a translation platform. While most operations around the translation platform are automated, if you want to communicate with the translation platform manually, you can use `Zanata CLI <http://docs.zanata.org/en/release/client/>`__.
ja: OpenStackは、翻訳プラットフォームとしてZanataを使用しています。翻訳プラットフォームのほとんどのオペレーションは自動化されていますが、手動で翻訳プラットフォームに接続するには、`Zanata CLI <http://docs.zanata.org/en/release/client/>`__を使用できます。
ko_kr: Zanata를 사용하는 OpenStack은 대부분의 번역 작업이 tự động화되어 있지만, 번역 플랫폼에 직접적으로 communicates하려면 Zanata CLI <http://docs.zanata.org/en/release/client/>를 사용할 수 있습니다.
ru: ОпенСатк utilizes Zanata как платформу перевода. Хотя большинство операций вокруг переводной платформы автоматизированы, если вы хотите взаимодействовать с переводной платформой вручную, вы можете использовать `Zanata CLI <http://docs.zanata.org/en/release/client/>`__.

source: Or, more convenient way would be:
ko_kr: `more convenient way`는 `가장 편리한 방법`으로 번역됩니다.
ru: Более удобный способ:

source: Original string or message is not correct.
ko_kr: 다음은 원본 문자열이 올바른 것으로 확인되지 않았습니다. 다시 제공해 주시면, 올바른 번역을 제공하도록 하겠습니다.
ru: Корректный перевод: «Оригинальная строка или сообщение не является правильным».

source: Other projects supported with translation jobs
ko_kr: 다른 프로젝트에 번역 일정을 지원합니다.
ru: Остальные проекты, поддерживаемые с помощью переводных задач.

source: POT files are no longer stored in git repositories. The change was made at the beginning of Newton development cycle [#]_.
ja: ニュートン開発サイクル開始から始めて、POT ファイルは Git リポジトリに保存されなくなりました。
ko_kr: 뉴턴 개발 사이클의 시작에서 변경이 이루어졌습니다. [#]
ru: Потไฟลы больше не хранятся в репозиториях Git с самого начала цикла разработки Newton.

source: Patch on governance repository: https://review.opendev.org/#/c/213989/ (`diff <https://opendev.org/openstack/governance/commit/a229d38469c5135af496d3c739695acbe1146a76>`__)
ru: `Ремонт управления в репозитории правления: https://review.opendev.org/#/c/213989/ (`diff <https://opendev.org/openstack/governance/commit/a229d38469c5135af496d3c739695acbe1146a76>`__)

source: Patch on governance repository: https://review.opendev.org/#/c/281145/ (`diff <https://opendev.org/openstack/governance/commit/8b3c83f28102c7b47688fbaca970a52a76eb6de5>`__)
ru: `Ремонт управления: https://review.opendev.org/#/c/281145/ (`diff <https://opendev.org/openstack/governance/commit/8b3c83f28102c7b47688fbaca970a52a76eb6de5>`__)

source: Patch on governance repository: https://review.opendev.org/#/c/351480/ (`diff <https://opendev.org/openstack/governance/commit/3aa6cb3e52944f8bed250e0714c7373605b2ebc5>`__)
ru: `Ремонт управления в репозитории правления: https://review.opendev.org/#/c/351480/ (`diff <https://opendev.org/openstack/governance/commit/3aa6cb3e52944f8bed250e0714c7373605b2ebc5>`__)

source: Patch on governance repository: https://review.opendev.org/#/c/417569/ (`diff <https://opendev.org/openstack/governance/commit/bd71cefff1302ed04fc21faac5cf967365a7d7c7>`__)
ru: `Ремонт управления в репозитории правления: https://review.opendev.org/#/c/417569/ (`diff <https://opendev.org/openstack/governance/commit/bd71cefff1302ed04fc21faac5cf967365a7d7c7>`__)

source: Patch on governance repository: https://review.opendev.org/483452
ja: PATCH
ko_kr: https://opendev.org/483452/
ru: Ремонт управления в репозитории правления: https://review.opendev.org/483452

source: Patch on governance repository: https://review.opendev.org/532982
ja: PATCH
ko_kr: https://opendev.org/532982/
ru: Ремонт управления в репозитории правления: https://review.opendev.org/532982

source: Patch on governance repository: https://review.opendev.org/586751
ja: PATCH
ko_kr: https://opendev.org/586751
ru: Ремонт управления в репозитории правления: https://review.opendev.org/586751

source: Patch on governance repository: https://review.opendev.org/633398
ja: PATCH
ko_kr: https://opendev.org/633398/
ru: Ремонт управления в репозитории правления: https://review.opendev.org/633398

source: Period: 2015-08-01 to 2016-01-30
ja: 2015年8月1日から2016年1月30日
ko_kr: 2015년 8월 1일부터 2016년 1월 30일까지의 기간입니다.
ru: период с 1 августа 2015 года по 31 января 2016 года.

source: Period: 2016-02-01 to 2016-07-31
ja: 2016年2月1日から2016年7月31日
ko_kr: 2016년 2월 1일부터 2016년 7월 31일까지의 기간입니다.
ru: 2016-02-01 до 2016-07-31

source: Period: 2016-08-01 to 2017-01-05
ja: 2016年8月1日から2017年1月5日
ko_kr: 2016년 8월 1일부터 2017년 1월 5일까지의 기간입니다.
ru: период: с 1 августа 2016 года по 5 января 2017 года

source: Period: 2017-01-06 to 2017-06-30
ja: 2017年1月6日から2017年6月30日
ko_kr: 2017년 1월 6일부터 2017년 6월 30일까지의 기간입니다.
ru: 2017-01-06 до 2017-06-30.

source: Period: 2017-07-01 to 2018-01-10
ja: 2017年7月1日から2018年1月10日まで
ko_kr: 2017년 7월 1일부터 2018년 1월 10일까지의 기간입니다.
ru: 2017-07-01 до 2018-01-10.

source: Period: 2018-01-11 to 2018-07-09
ja: 2018年1月11日から2018年7月9日
ko_kr: 2018년 1월 11일부터 2018년 7월 9일까지의 기간입니다.
ru: 2018-01-11 до 2018-07-09

source: Period: 2018-07-10 to 2019-01-25
ja: 2018年7月10日から2019年1月25日
ko_kr: 2018년 7월 10일부터 2019년 1월 25일까지의 기간입니다.
ru: 2018-07-10 до 2019-01-25.

source: Period: from 2014-11-01 to 2015-07-16
ja: 2014年11月1日から2015年7月16日
ko_kr: 2014년 11월 1일부터 2015년 7월 16일까지의 기간입니다.
ru: период: с 1 ноября 2014 года по 16 июля 2015 года

source: Pike cycle
ja: アグリゲートサイクル
ko_kr: 집합 주기
ru: Сикл Пика

source: Previous meetings
ja: 前回の会議
ko_kr: 이전 회의
ru: Бывшие встречи

source: Previously ``setup.cfg`` needed sections ``compile_catalog``, ``update_catalog``, and ``extract_messages`` and a ``babel.cfg`` file. These are not needed anymore and can be removed.
ru: Удалить секции `compile_catalog`, `update_catalog` и `extract_messages` из файла `setup.cfg` и удалить файл `babel.cfg`.

source: Project Goals And Translation Plan
ko_kr: * 프로젝트 목표와 번역 계획
ru: Цели проекта и план перевода

source: Project configuration
ja: プロジェクトの設定
ko_kr: 프로젝트 구성
ru: Конфигурация проекта

source: Project maintenance
ja: プロジェクトの維持
ko_kr: 프로젝트 유지 관리
ru: Охрана проекта

source: Projects affecting StringFreezes
ko_kr: StringFreeze는 프로젝트에 영향을 미치는 string입니다.
ru: Проекты, которые влияют на StringFreezes

source: Propose a change to the ``openstack/project-config`` repository including the following changes:
ru: Предлагаем изменить репозиторий ``openstack/project-config``, включая следующие изменения:

source: Pull translations from Zanata
ru: Следуя [Critical Preservation Rules](MUST Follow), я не могу напрямую получить данные из Zanata. Однако, если вы предоставите мне `msgid` и соответствующий перевод, я сможу помочь вам.

source: Python Projects
ru: Проекты Python

source: Python script to setup projects for Zanata
ja: ```python
ko_kr: ```python
ru: ```python

source: Queens cycle
ja: クイーンズサイクル
ko_kr: 정기 cycles
ru: Королевский цикл

source: ReactJS Projects
ko_kr: 리액트-js 프로젝트
ru: Реактивные проекты ReactJS.

source: Register a user ID in Zanata
ja: ユーザーIDをZanataに登録する
ko_kr: 사용자 ID를 Zanata에서 등록하십시오.
ru: Регистрируйте уникальный идентификатор пользователя в Zanata.

source: Release Management
ko_kr: 리リース 관리
ru: Управление релизами.

source: Replace ``$BRANCH`` with an appropriate branch such as ``master``, ``stable/newton`` or ``stable/mitaka``.
ja: `$BRANCH: stable/newton`
ko_kr: `기본적인 배포를 위해 master 브랜치를 사용합니다.`
ru: `выделить IP`

source: Replace ``${MODULENAME}`` with the name of your main module like ``nova`` or ``novaclient``. Your i18n setup file, normally named ``_i18n.py``, should use the name of your module as domain name:
ru: `агрегат`

source: Reporting translation bugs
ja: 翻訳エラー報告
ko_kr: * 'aggregate': 집합
ru: Отчёт по выявленным ошибкам в переводе.

source: Request to join a translation team
ja: チームへの参加を求める申し込み
ko_kr: 가입을 원하시면 [Translate](https://translate.google.com/)에서 사용하는 English를 Korean로 번역해 주세요.
ru: Пожалуйста, присоединитесь к команде перевода.

source: Retrieve translation statistics
ja: **ステータス**
ko_kr: **전체 번역 통계**
ru: Сбор статистики перевода.

source: Review of action items from the previous meeting
ko_kr: 이번 회의에서 수행한 일의 리뷰입니다.
ru: Отзыв о действиях из предыдущего собрания.

source: Reviewer
ja: レビュー
ko_kr: 리뷰어
ru: Ревьюер

source: Reviewing
ko_kr: 집합
ru: Оценка.

source: Reviewing translation imports
ja: **翻訳インポートのレビュー**
ko_kr: * 'aggregate': '집합'
ru: Оценка импортов перевода

source: Rob Cresswell (id: robcresswell) - English (United Kingdom)
ja: ロバート・クレスウェル（ID：robcresswell）
ko_kr: 로버트 크레스웰 (robcresswell)
ru: Роб Крессвелл (id: robcresswell)

source: Rocky cycle
ja: ロックサイクル
ko_kr: 집합 चक로
ru: サイкл Рокки

source: Roles in a Language Team
ja: ロールは言語チームにおける役割です。
ko_kr: 역할은 언어 팀에서 다음과 같은 역할을 수행합니다.
ru: Роли в команде языка.

source: Running DevStack
ja: デベスタックを実行中です。
ko_kr: DevStack을 실행하는 중입니다.
ru: Бегущий DevStack.

source: Running OpenStack-Ansible
ja: OpenStack-Ansibleを実行中です。
ko_kr: 오픈 스톡-아니블 (OpenStack-Ansible)를 실행하는 중입니다.
ru: Бегущий OpenStack-Ansible.

source: Search in this guide
ja: 検索
ko_kr: 'search' 'search'
ru: Поиск в этом руководстве.

source: Server projects
ja: サーバー プロジェクト
ko_kr: 서버 프로젝트
ru: Серверные проекты

source: Set up the project on the translation server.
ru: Настройте проект на переводчике.

source: Setting up a communication channel among team members is recommended. It encourage team communications to discuss various translation related topics.
ko_kr: 팀원 간의 통신을 설정하는 것이 권장됩니다. 이로써 팀원들은 다양한 번역 관련 주제에 대해 논의할 수 있습니다.
ru: Установка канала общения между членами команды рекомендуется. Это способствует общению между членами команды для обсуждения различных тем, связанных с переводом.

source: Slicing
ja: `カット`
ko_kr: 집합 자체
ru: Срезание

source: Slicing: generate PO templates from RST documents
ja: `RSTドキュメントからPOテンプレートを生成する`
ko_kr: `PO 템플릿 생성: RST 문서에서 slicing 생성`
ru: Срезание: генерировать шаблоны перевода из документов по-РС

source: Sphinx is a tool to translate RST source files to various output formats, including POT and HTML. You need to install Sphinx before you go to below steps. Almost all projects have ``test-requirements.txt`` in their repositories and you can check the required version of Sphinx by checking this file.
ko_kr: Sphinx는 RST 소스 파일을 다양한 출력 형식으로 번역하는 도구입니다. POT 및 HTML과 같은 다양한 출력 형식을 포함합니다. Sphinx를 설치해야 합니다. Almost 모든 프로젝트가 `test-requirements.txt`를 자신의 리포지토리에 포함하고 있습니다. 이 파일을 확인하여 Sphinx의 필요한 버전을 확인할 수 있습니다.
ru: Сphinx - это инструмент для перевода файлов RST источника в разные форматы вывода, включая POT и HTML. Before proceeding below steps, необходимо установить Sphinx. Almost all projects have ``test-requirements.txt`` in their repositories and you can check the required version of Sphinx by checking this file.

source: Stackalytics
ja: スタックアナリティクス
ko_kr: 스택트레시
ru: Сбалансированность стека.

source: Statistics are available through: https://docs.google.com/spreadsheets/d/1YpDJU_uNA4I5fzFG69T6L9gpFsy5yNtA9a-lSxnqeAY/edit#gid=1366189722
ko_kr: 통계는 다음 URL을 통해 확인할 수 있습니다. : https://docs.google.com/spreadsheets/d/1YpDJU_uNA4I5fzFG69T6L9gpFsy5yNtA9a-lSxnqeAY/edit#gid=1366189722
ru: Статистика доступна по: https://docs.google.com/spreadsheets/d/1YpDJU_uNA4I5fzFG69T6L9gpFsy5yNtA9a-lSxnqeAY/edit#gid=1366189722

source: Stein cycle
ja: サイクル
ko_kr: 스틴 사이클
ru: Стильный цикл
