Repository: openstack-kr/knu_i18n_2025
Catalog: po/llama3.2:3b/*/i18n-docs-source-locale-*.po
Languages: ja, ko_kr, ru

source: To communicate with the translation platform, you need to prepare a project configuration file named ``zanata.xml`` in the top directory of a project you are interested in. OpenStack projects does not contain ``zanata.xml`` in their git repositories, so you need to create it manually.
ko_kr: OpenStack 프로젝트는 `zanata.xml` 파일을 포함하지 않기 때문에 Git 리포지토리에 포함되지 않는다. 따라서 OpenStack 프로젝트에 대한 번역 플랫폼과 상호 작용하기 위해서는 `zanata.xml` 파일을 수동으로 생성해야 한다.
ru: Чтобы общаться с платформой перевода, необходимо подготовить конфигурационный файл проекта `zanata.xml` в корне репозитория проекта, который вы интересуете. OpenStack-projects не содержат в своих репозиториях `zanata.xml`, поэтому необходимо его создать вручную.

source: To display translated messages in python server projects, you need to compile message catalogs and also need to configure your server services following instructions described at `oslo.i18n documentation <https://docs.openstack.org/oslo.i18n/latest/user/usage.html#displaying-translated-messages>`__.
ko_kr: 집합을 표시하여 Python 서버 프로젝트에서 번역 메시지를 표시하는 것은, 메시지 카탈로그를 컴파일하고, 또한 서버 서비스를 instructions에 설명된 방식으로 구성해야 합니다. <https://docs.openstack.org/oslo.i18n/latest/user/usage.html#displaying-translated-messages>
ru: Включение отображения переведенных сообщений в Python-серверных проектах требует compilation message catalogs и настройки своих сервисов, как описано в `oslo.i18n documentation <https://docs.openstack.org/oslo.i18n/latest/user/usage.html#displaying-translated-messages>`__.

source: To download translations from Zanata, run the following command after going into a project directory. You are usually interested in only a few of languages, so ``--locales`` option would be useful. For more options, see the output of ``zanata pull --help``.
ko_kr: Zanata에서 번역을ดาวloads 하기 위해서는 프로젝트 디렉토리에 들어가서 다음 명령어를 실행합니다. 일반적으로 단일 언어만 interested 하기 때문에 `--locales` 옵션은 유용합니다. 더 많은 옵션에 대한 정보는 `zanata pull --help`를 실행하여 확인할 수 있습니다.
ru: Чтобы скачать переводы из Zanata, запустите следующий команд после входа в папку проекта. Usually вы интересованы только несколькими языками, поэтому опция ``--locales`` полезна. Для более подробной информации посмотрите на вывод ``zanata pull --help``.

source: To fetch translated files regularly, execute this command manually or as a cron:
ja: `定期的に翻訳されたファイルを取得するには、手動で実行するか、またはカロム (cron) を使用して実行します。`
ko_kr: `기본적으로는 매일이지만, 원하는 시점에만 실행할 수 있는 경우에는 `crontab -e` 명령을 사용하여 스케줄을 설정할 수 있습니다. 예를 들어, 매일 12시에만 실행하고자 할 때는 `0 12 * * *`으로 설정할 수 있습니다.
ru: Чтобы получить переведенные файлы регулярно, выполните этот команду вручную или как скрипт через cron:

source: To help with translation, :doc:`become an official translator <official_translator>` and join your language team. Then go to `translation website <https://translate.openstack.org/>`_ to start translation. You can find prioritized translation jobs as I18n team at the top of the page.
ja: OpenStack の公式の翻訳者になるには、:doc:`翻訳者に登録する <official_translator>` となります。次に、言語チームに参加し、`<https://translate.openstack.org/>_` というサイトを利用して翻訳を開始します。優先順位付けされた翻訳作業は、I18n チームのトップページで見つけることができます。
ko_kr: 공식 번역자가 되고, 언어 팀에 가입하세요. then `ترجمة 웹사이트 <https://translate.openstack.org/>`_을 방문하여 시작합니다. 우선 순위를 가지는 번역 일정을 I18n 팀에서 위쪽에 찾을 수 있습니다.
ru: Чтобы помочь в переводе, :doc:`стать официальным переводчиком <official_translator>` и присоединитесь к своей команде переводчиков. Затем пойдите на `сайт перевода OpenStack <https://translate.openstack.org/>`_ , чтобы начать перевод. Вы можете найти приоритетные переводческие задачи как I18n-команду в верхней части страницы.

source: To not have too much churn and last minute string fixes lead to files get removed, there is also a lower threshold for releases of **66 percent** of messages translated as policy - which is only manually enforced.
ko_kr: 정책은 66% 이상의 메시지가 번역된 경우에만 수립됩니다. 이 정책은 수동으로 강제되는 것이며, 파일이 제거되는 것을 방지하기 위해 변경이 많이 발생하는 경우를 줄이는 데 도움이 됩니다.
ru: Чтобы избежать чрезмерного потока и последних минутных корректировок в строках, существует также более низкий порог для выпусков **66 процентов** переведенных текстов как политики, которые только ручным образом контролируются.

source: To report translation errors, see :doc:`bug_report`.
ja: エラー報告は、:doc:`bug_report`を参照してください。
ko_kr: 기안을 보고 있습니다.
ru: Чтобы отчетно сообщить об ошибках перевода, посмотрите :doc:`bug_report`.

source: To run the script:
ja: `スクリプトを実行するには、`
ko_kr: `스クリプ트를 실행하려면`
ru: Чтобы запустить скрипт:

source: To sync the translator list, run the following command:
ja: `sync-translation-database`
ko_kr: `sync-translation-list`
ru: Синхронизируйте список переводчика, executing следующий команд:

source: Tools
ja: ツール
ko_kr: 도구
ru: Тools

source: Train cycle
ja: サイクル
ko_kr: 循環
ru: サイкл обучения

source: Translate **master** version on Zanata.
ja: マスター
ko_kr: 마스터
ru: Мастер

source: Translated strings are automatically synced between translation server and Openstack infrastructure. The procedure is robust, but sometimes something can go wrong. For this reason there is a section :ref:`monitoring-translation-job-status` in the infrastructure chapter.
ko_kr: ترranslation string의 automatically synced는 translation server와 openstack infrastructure를 giữa에 automatically synced합니다. 그러나 이러한 이유로 인해 sometimes something can go wrong. 따라서 이에 대한 section :ref:`monitoring-translation-job-status`가 exists합니다.
ru: Передача переводов автоматически синхронизируется между сервером перевода и инфраструктурой OpenStack. Процедура robust, но иногда что-то может пойти не так. Следовательно, есть раздел :ref:`monitoring-translation-job-status` в chapters :ref:`infrastructure`.

source: Translating: manage the translation in Zanata, including the translation memory and glossary management
ko_kr: Zanata에서 번역 관리 및 번역 메모리 및 glossary 관리를 포함합니다.
ru: Управлять переводом в Zanata, включая управление переводной памятью и справочником.

source: Translation
ja: アグリゲート
ko_kr: 집합
ru: Транслитация

source: Translation Job Control
ko_kr: 작업 조절
ru: Контроль за работой перевода

source: Translation Statistics
ja: 統計情報
ko_kr: 통계 정보
ru: Статистика перевода

source: Translation activities with plans from language teams
ko_kr: activitys
ru: Деятельность с точки зрения планирования с командами языков.

source: Translation bugs
ja: * 'aggregate': 'アグリゲート'
ko_kr: 집합은 'aggregate'가 아니라 '집합'으로 번역됩니다.
ru: Ошибки перевода.

source: Translation bugs are tracked on `Launchpad <https://bugs.launchpad.net/openstack-i18n>`__. Often only the language teams are able to handle translation bugs, e.g. wrong translation words or senses. PTL fits thereon or designates bug triage liaison.
ko_kr: Launchpad에서 오penstack-i18n의 번역 오류를 tracking합니다. <https://bugs.launchpad.net/openstack-i18n> often language 팀이 오류를 처리할 수 있습니다. 예를 들어, 번역 단어나 의미가 잘못된 경우 PTL은 그에 대한 처리를 handling 할 수 있습니다. 또는 bug_triage_liaison을 designation합니다.
ru: Трансляционная ошибка отслеживаются на Launchpad <https://bugs.launchpad.net/openstack-i18n>`__. often only language teams могут решить проблему с переводами, например, неправильные переводы слов или смыслов. PTL может быть связан с этим или назначить liaison по отслеживанию проблем с переводами.

source: Translation bugs in all languages can be reported here.
ja: 報告する翻訳エラーはここです。
ko_kr: * translation bug report
ru: Ошибки в переводе в всех языках можно сообщить здесь.

source: Translation infrastructure
ko_kr: 인프라 전략
ru: Инфраструктура перевода

source: Translation infrastructure tasks and scripts
ko_kr: 인프라 전략 및 스크립트
ru: Задачи и скрипты инфраструктуры перевода

source: Translation infrastructure tasks are stored and managed in `openstack/project-config <https://opendev.org/openstack/project-config/>`__ repository. The translation infrastructure scripts are stored and managed in `openstack/openstack-zuul-jobs <https://opendev.org/openstack/openstack-zuul-jobs>`__ repository.
ru: Инфраструктура перевода задачы хранится и управляется в репозитории `openstack/project-config <https://opendev.org/openstack/project-config/>`__. Скрипты инфраструктуры перевода хранятся и управляются в репозитории `openstack/openstack-zuul-jobs <https://opendev.org/openstack/openstack-zuul-jobs>`__.

source: Translation is another kind of important contribution to OpenStack community. If you want to become a official translator, you need to finish following steps:
ja: オープンソースコミュニティのOpenStackに貢献するために、翻訳は重要な一つの貢献です。オフィシャル翻訳者になるには、以下のステップを完了する必要があります。
ko_kr: 오픈 스택 커뮤니티에 대한 다른 종류의 중요한 기여는 번역입니다. 오픈 스택 커뮤니티에서 공식적인 번역자로 बनन고 싶으려면 다음 단계를 완료해야 합니다.
ru: Перевод являетсяanother kind of важнойContributions кOpenStack сообществу. Если вы хотите статьофициальнымпереводчиком, вамнужнозакончитьследующиешаги:

source: Translation jobs
ja: 仕事
ko_kr: 작업이 있습니다.
ru: Работы по переводу

source: Translation tips
ja: * *アグリゲート*は、複数の物理的なサーバーやストレージをグループ化したものです。
ko_kr: * **사전 예고** : * *사전 예고*는 *예상*의 의미를 가지고 있습니다. *예상*은 *미래*에 대한 *추정*을 의미합니다.
ru: * *Примечание*: В этом разделе представлены переводы ключевых терминов, используемых в контексте cloud computing и virtualization.

source: Translation tools
ja: ツール
ko_kr: 기계 번역 도구
ru: Тools перевода

source: Translations
ja: * 'aggregate': 'アグリゲート'
ko_kr: * 'aggregate': 집합
ru: Транслитация

source: Translations are being imported into a project repository daily, so in most cases you do not need to pull translations from Zanata manually. What you need is to pull the latest horizon code.
ja: Zanata から最新の Horizon コードを Pull する必要があります。
ko_kr: 하ورizon 코드를 최신으로 업데이트하여 번역을 수집하는 것이 필요합니다.
ru: Получить последнюю версию кода Horizon каждый день для импорта переводов в репозиторий проекта.

source: Translations on master version in Zanata are normally recommended for upstream contribution.
ko_kr: 대상 마스터 버전은 일반적으로 Zanata에서 사용되는 translations에 대한 제안을 제공하는 것을 추천합니다.
ru: Транслитации на версию мастер в Zanata обычно рекомендуются для contributorов upstream.

source: Translators translate repositories using the `translation server <http://translate.openstack.org>`_ which runs the Zanata software.
ko_kr: 전역서에서 리포지토리를 번역하는 데는 `翻訳서버 <http://translate.openstack.org>`_이 사용됩니다. 이 소프트웨어는 Zanata를 실행합니다.
ru: Преобразители преобразуют репозитории с помощью сервера перевода `<http://translate.openstack.org>`_, который запускает программное обеспечение Zanata.

source: Update jobs for Zanata start after patches are merged on OpenStack project repositories, and Zuul starts to run tasks everyday at **6:00 UTC** for the updates on OpenStack project repositories.
ko_kr: Zanata 작업을 OpenStack 프로젝트 리포지토리에 대한 패치가 마ージ된 후 시작합니다. Zuul이 매일 **06:00 UTC**에 일정을 실행하여 OpenStack 프로젝트 리포지토리의 업데이트를 시작합니다.
ru: Обновление задач для Zanata начнется после того, как будут объединеныpatches в репозиториях проекта OpenStack и Зуул начнет выполнять задачи каждый день в **06:00 UTC** для обновления репозиторий проекта OpenStack.

source: Update your ``package.json`` file. It should contain references to the ``json2pot`` and ``po2json`` commands.
ru: ```json

source: Update your ``setup.cfg`` file. It should contain a ``packages`` entry in the ``files`` section:
ru: `агрегат конфигурации`

source: Uploading
ja: アップロード中
ko_kr: 업로드
ru: Загрузка

source: Uploading: Upload the translation resources to Zanata
ja: アップロード: Zanata にトランスラテーション リソースをアップロードする
ko_kr: 업로드: Zanata에 번역 자원 업로드
ru: Загрузка: Загрузить переводные ресурсы в Zanata.

source: User configuration
ja: ユーザー設定
ko_kr: 사용자 설정
ru: Настройки пользователя.

source: Using translations
ko_kr: 집합
ru: Сервис вычислительных ресурсов.

source: Usual topics
ru: Обычные темы

source: Visit `Stackalytics <http://stackalytics.com/>`__ and choose ``Translations`` as ``Metric`` dropdown menu at the upper-right.
ja: Stackalytics のトランスラテーション
ko_kr: Stackalytics > Translations
ru: Завизнуйте `Stackalytics <http://stackalytics.com/>` __ и выберите ``Переводы`` в качестве ``Метрики`` в верхнем правом углу.

source: We have two types of Zuul jobs for translations: syncing source strings into Zanata with the latest repositories and pushing translations from Zanata into the repositories. The first job is for Zanata-side updates. Up-to-date source strings to be translated are compared and updated between OpenStack project repositories and Zanata. If source texts in OpenStack project repositories are changed, then change sets are pushed into Zanata so translators deal with up-to-date source strings. On the other hand, the second job is aimed to reflect changes in translated strings in Zanata (after translators do translation activities) into corresponding OpenStack project repositories. The job will propose changes as :doc:`Translation Import <reviewing-translation-import>` Gerrit patches.
ko_kr: Zuul jobs는 두 가지로 나뉘어 있습니다. 첫 번째 jobs는 Zanata-side updates를 위해 사용됩니다. 이 jobs는 OpenStack 프로젝트 리포지토리와 Zanata 사이의 소스 문자열을 비교하고 업데이트합니다. OpenStack 프로젝트 리포지토리의 소스 문자열이 변경되면, Zanata에 변경 세트를 푸시하여 번역자에게 최신 소스 문자열을 제공합니다. 두 번째 jobs는 번역자 활동 후 Zanata의 번역된 문자열에 대한 변경을 OpenStack 프로젝트 리포지토리에 반영하는 것을 목표로 합니다. 이 jobs는 :doc:`Translation Import <reviewing-translation-import>` Gerrit 패치를 제안합니다.
ru: Мы имеем два типа задачи Zuul для переводов: синхронизация источных строк с Zanata с последними репозиториями и передача переводов из Zanata в репозитории. Первая задача — для Zanata-side обновления. Сравнивая актуальные источные строки, обновляются между OpenStack проектными репозиториями и Zanata. Если источные тексты в OpenStack проектных репозиториях изменились, то измененные наборы изменений отправляются в Zanata, чтобы переводчики работали с atualizirovannymi источными строками. С другой стороны, вторая задача направлена на отражение изменений в переведенных строках в Zanata (после того, как переводчики выполняют переводные действия) в соответствующие OpenStack проектные репозитории. Эта задача предлагает изменения в виде :doc:`Translation Import <reviewing-translation-import>` Gerrit patch.

source: We strongly recommend to follow the above guideline, but in some cases this behavior does not satisfy your project structure. For example,
ru: Мы强оемся следовать вышеуказанным правилам, но в некоторых случаях это поведение не удовлетворяет нашему структуру проекта.

source: We use :ref:`Zanata CLI <zanata-cli>` to download the translated PO files from the translation platform.
ko_kr: :ref:`zanata-cli`를 사용하여 번역 플랫폼에서 PO 파일을 downloaded합니다.
ru: Мы используем :ref:`CLI Zanata <zanata-cli>` для загрузки переведенных файлов PO из платформы перевода.

source: We use :ref:`Zanata CLI <zanata-cli>` to upload the POT file to the translate platform.
ko_kr: :ref:`zanata-CLI를 사용하여 POT 파일을 번역 플랫폼에 업로드합니다.`
ru: Мы используем :ref:`CLI Zanata <zanata-cli>` для загрузки файла POT на платформу перевода.

source: We use sphinx-build to translate RST files to POT files. Because we want to have a single POT file per document, we use msgcat to merge those POTs after sphinx-build.
ru: Мы используем SphinxBuild для перевода файлов RST в POT, поскольку нам нужно иметь отдельный POT-файл за каждый документ. Чтобы объединить эти POT-faily после SphinxBuild, мы используем msgcat.

source: What is wrong? What should be improved?
ja: I can provide you with some suggestions for improvement.
ko_kr: I can identify a few areas that need improvement:
ru: Nothing. Your request was clear and concise. I will translate the text from English to Russian.

source: When a filename is ``workflows.py`` or ``forms.py``, it means it is used in a form for creating or editing something.
ja: ワークフロー ファイルである「workflows.py」または「forms.py」は、作成または編集するもののフォームで使用されるためとみなされます。
ko_kr: `워크플로우.py` 또는 `포rm.py`는 생성 또는 편집하는 것에 사용되는 형식입니다.
ru: Каждый файл с расширением `.py` в директории `workflows` или `forms` используется для создания или редактированияsomething.

source: When a new member request is received, a coordinator approves (or rarely rejects) the request. At the moment, Zanata provides no way to communicate with language team members, so it is better to inform the new member of ways usually used in the language team.
ko_kr: 새 멤버 요청이 받을 때는 조정자는 일반적으로 승인(또는 드물게 거절)합니다. 현재 Zanata는 언어 팀 멤버와의 통신 방법을 제공하지 않기 때문에, 새로운 멤버에게 일반적으로 사용되는 방법을 알려주어야 합니다.
ru: Когда получается запрос на новую членство, координатор approving (или редко отклоняет) запрос. В настоящее время Zanata не обеспечивает способа общения с членами языковой команды, поэтому лучше информировать нового члена о путях, обычно используемых в языковой команде.

source: When a translation period towards a new OpenStack release approaches, it is recommended to coordinate and prioritize translation efforts.
ko_kr: 새로운 오픈 스톡스 릴리스로의 번역 기간이 접근할 때는 번역 노력에 대한 협조와 우선 순위를 조정하는 것이 권장됩니다.
ru: Когда подходят к новому периоду перевода в OpenStack, recommends координировать и расставлять приоритеты усилия по переводу.

source: When proposing extra ATCs at that time, some translators were not included in `translation_team.yaml <https://opendev.org/openstack/i18n/src/commit/73a36041dbdc45212051c60cbeef3f7783200fd2/tools/zanata/translation_team.yaml>`__ file. It seems that 1) new translators were joined and the statistics was calculated but the file was already created, or 2) there might be some lack of communication with language coordinators, since I18n encouraged each language coordinator to update this file.
ko_kr: 이러한 अतिर부수 ATC를 제안할 때, 일부 번역자들이 `translation_team.yaml <https://opendev.org/openstack/i18n/src/commit/73a36041dbdc45212051c60cbeef3f7783200fd2/tools/zanata/translation_team.yaml>` 파일에 포함되지 않았을 것으로 보입니다. 1) 새로운 번역자들이 합류하여 통계가 계산되었지만 이미 파일이 생성된 경우, 또는 2) I18n에서 언어 조정자에게 이러한 파일을 업데이트하도록 khuyến진했기 때문에 일부 경우에는 의사소통의 부족이 있을 수 있습니다.
ru: Когда предлагалось добавить дополнительные ATCs в тот момент, некоторые переводчики не были включены в `translation_team.yaml <https://opendev.org/openstack/i18n/src/commit/73a36041dbdc45212051c60cbeef3f7783200fd2/tools/zanata/translation_team.yaml>` файл. Это может быть из-за следующих причин:

source: When submitting the change to ``openstack/project-config`` for review, use the ``translation_setup`` topic so it receives the appropriate attention:
ru: Когда подача изменения в ``openstack/project-config`` для оценки, используйте тему ``translation_setup``, чтобы она получила подходящее внимание.

source: When you add a new entry to the glossary, it is highly recommended to add the entry to the master glossary ``glossary/locale/glossary.pot``. By doing this, all language teams can share the glossary.
ru: При добавлении нового записи в словарь strongly recommends добавить запись в основной словарь ``glossary/locale/glossary.pot``. Это позволяет всем командам языка делиться словарем.

source: When you are using OpenStack (including the dashboard, API or CLI) or are reading translated documentations, if you find something wrong, something you cannot understand, something you cannot agree, or something to be improved, please consider reporting it.
ja: OpenStack のドキュメントや CLI/API を使用した場合、または翻訳されたドキュメンテーションを読んだ場合に、誤りがあるか、わかりませんか、理解できませんか、改善されていないか、という場合は、報告してください。
ko_kr: OpenStack의 문서나 UI를 사용할 때 오류가 발생하거나 이해하기 어렵거나 동의하지 못하는 경우, 또는 개선이 필요한 경우에만 신고하십시오.
ru: Если вы используете OpenStack (включая дашборд, API или CLI), или читаете переведенные документы, и обнаруживаете что-то неправильное, что не понимаете, что не соглас yourselves с, или что можно улучшить, то, пожалуйста, обратитесь в нас за отчетом.

source: When you want to update a glossary of your language, edit a corresponding glossary file using your favorite editor and propose a change to the Gerrit review system.
ja: アグリゲート
ko_kr: 집합
ru: агрегат

source: When your request is approved, add an item in "Local Translation Teams" in the wiki page, create a wiki page under page `I18nTeam <https://wiki.openstack.org/wiki/I18nTeam/team>`_ (for example, I18nTeam/team/zh_cn) to introduce your team, with the following information at least: the contact information, the web page, and the work items.
ko_kr: 집합
ru: **[Raw Translated Text]**

source: When your request is approved, you will get an email notification.
ja: 承認されたリクエストに当たった場合、承認されたリクエストに当たった場合、承認されたリクエストに当たった場合、承認されたリクエストに当たった場合、承認されたリクエストに当たった場合、承認されたリクエストに当たった場合、承認されたリクエストに当たった場合、承認されたリクエストに当たった場合、承認されたリクエストに当たった場合、承認されたリクエストに当たった場合、承認されたリクエストに当たった場合、承認されたリクエストに当たった場合、承認されたリクエストに当たった場合、承認されたリクエストに当たった場合、承認されたリクエストに当たった場合、承認されたリクエストに当たった場合、承認されたリクエストに当たった場合、承認されたリクエストに当たった場合、承認されたリク
ko_kr: N/A
ru: Когда ваш запрос будет одобрен, вы получите уведомление по электронной почте.

source: Where a string is used in Dashboard UI?
ja: `Dashboard UI` の `string` は、`label` または `title` として使用されます。
ko_kr: Dashboard UI에서 사용되는 문자는 'dashboard ui'입니다.
ru: Где строка используется в интерфейсе Дашборда.

source: Where a string is used in source code?
ja: `ソースコード内で文字列の使用`
ko_kr: `원문에서 문자열이 사용되는 경우`
ru: Точка входа API

source: Where can I report a bug?
ja: バグを報告する場所はどこですか。
ko_kr: Bugs를 보고 싶은 경우, [GitHub Issue](https://github.com/your-username/your-repo/issues)에서 Bug Report을 작성하거나, [Support Email](mailto:support@example.com)로 이메일을 보세요.
ru: Вы можете сообщить о ошибке на сайте [главной страницы](http://example.com).

source: Where you find a bug you are reporting?
ja: [/usr/bin/python -m unittest discover -s /usr/share/doc/python/ -p 'test*.py']
ko_kr: IP 할당
ru: Я нашел ошибку в [Glossary] секции.

source: Who can help you?
ja: * *誰かが助けることができます:*
ko_kr: * *사용자*: 사용자가 도움을 benöt기 때문에 사용자가 도움을 받을 수 있습니다.
ru: Вам может помочь *пользователь*.

source: With these changes merged, the strings marked for translation are sent to the translation server after each merge to your project. Also, a periodic job is set up that checks daily whether there are translated strings and proposes them to your project together with translation source files. Note that the daily job will only propose translated files where the majority of the strings are translated.
ru: С этими изменениями объединены строки для перевода, передаваемые на переводческий сервер после каждого объединения, а также задается периодический задача, которая каждый день проверяет, есть ли переведенные строки и предлагает их вместе с переводческими источниками в проект.

source: Write an email to "openstack-i18n@lists.openstack.org" to introduce yourself and the language team you want to create, together with your ID on Zanata.
ko_kr: Subject: Introduction of Korean Language Team for OpenStack
ru: Представляемся на почте openstack-i18n@lists.openstack.org.

source: You also need to setup your repository following the instruction for Python and/or Django project above appropriately.
ru: агрегат

source: You are encouraged to register with your business email, which will help your company to get the credit. If you don't want to, use your personal email will be OK too.
ja: お客様は、企業のメールアドレスで登録することをお勧めします。 これにより、企業にクレジットがもたらされます。 しかし、登録しない場合は、個人的なメールアドレスでも構いません。
ko_kr: 당신은 회사 이메일을 등록하여 비즈니스 이메일로 사용할 수 있습니다. 이는 회사의 신뢰를 얻는 데 도움이 됩니다. 그러나 muốn registration하지 않는다면, 개인 이메일을 사용하셔도 됩니다.
ru: Вы можете зарегистрироваться с своей бизнес-электронной почтой, что поможет вашему компанию получить кредит.

source: You can also check:
ko_kr: `N/A`
ru: Вы можете также проверить:
