Repository: openstack-kr/knu_i18n_2025
Catalog: po/llama3.2:3b/*/i18n-docs-source-locale-*.po
Languages: ja, ko_kr, ru

source: Steps to become a OpenStack translator
ja: * OpenStack の翻訳を開始するには、まず OpenStack のドキュメントに記載されている翻訳ガイドラインを理解する必要があります。
ko_kr: 1. **OpenStack의 개념을 이해하십시오**. OpenStack는 오픈 소스 인프라 플랫폼으로, 클라우드 컴퓨팅, 스토리지, 네트워크 및 보안 서비스를 제공합니다.
ru: Чтобы стать переводчиком OpenStack, необходимо выполнить следующие шаги:

source: Sync the translator list with Zanata
ja: **[Glossary]**
ru: Синхронизировать переводчик с Zanata...

source: TBD
ja: 未実行
ru: ТБД

source: Team activities with release
ko_kr: 팀 활동과 릴리스
ru: Деятельность команды с использованием релиза.

source: The I18n project maintains a list of language teams and their members. The list is used by Stackalytics to gather translation statistics (See :ref:`stats-stackalytics` for detail). It is also used by the scripts below.
ko_kr: 이 프로젝트는 언어 팀과 그 회원들의 목록을 유지하고 있습니다. 이 목록은 스택아탈리틱스에 의해 번역 통계를 수집하는 데 사용됩니다. (See :ref:`stats-stackalytics`에 대한รายละเอียด 참조). 또한 아래 스크립트에 의해 사용됩니다.
ru: Проект I18n поддерживает список команд по языкам и их участников. Список используется для сбора статистики перевода (Просмотр :ref:`stats-stackalytics» для подробной информации). Это также используется в скриптах ниже.

source: The I18n team welcomes any kinds of contribution.
ja: 国際化チームは、どんな種類の貢献でも歓迎しています。
ko_kr: 이국제화 팀은 모든 종류의 기여를 환영합니다.
ru: Давайте приветствуют любые виды вклада.

source: The OpenStack infra scripts executed by tasks currently download new files that are at least **75 percent** translated and if files grow over time but do not get new translations (or strings change too much), they will be removed again automatically from the project with a lower threshold of currently **40 percent**.
ko_kr: OpenStack 인프라 스크립트가 현재 task에 의해 실행되는 동안, 새로운 파일이 **75%** 이상 번역되어 있음을 확인합니다. 파일이 시간이 지남에 따라 크지만 새로운 번역이 없거나 (또는 문자열이 많이 변경되지 않음) 다시 프로젝트에서 제거되도록 automatically lower threshold인 현재 **40%**를 사용합니다.
ru: Операции OpenStack инфраструктуры сценарии, которые выполняются задачамиcurrently загружают новые файлы, которые не менее **75 процентов** переведены и если файлы растут по времени, но не получают новых переводов (или строки изменяются слишком много), они будут удалены снова автоматически из проекта с более низким порогом currently **40 процентов**.

source: The POT file is found under ``http://tarballs.openstack.org/translation-source/<Zanata-project-name>/<Zanata-project-version>/<path>/<resource>.pot``, where:
ko_kr: http://tarballs.openstack.org/translation-source/<Zanata-프로젝트-이름>/<Zanata-프로젝트-バージョン>/<path>/<resource>.pot
ru: Оставшиеся файлы перевода находятся в `` http://tarballs.openstack.org/translation-source/<Zanata-project-name>/<Zanata-project-version>/<path>/<resource>.po ``, где `<Zanata-project-name>` — имя проекта, `<Zanata-project-version>` — версия проекта, `<path>` — путь к ресурсу и `<resource>` — название ресурса.

source: The `Zuul Builds Page <https://zuul.opendev.org/t/openstack/builds>`__ provides us a convenient way to check the translation job status.
ru: Зуул Build Page <https://zuul.opendev.org/t/openstack/builds> обеспечивает удобный способ проверить статус перевода задачи.

source: The above run the following internally:
ja: 内部で実行する
ko_kr: 내부에서 다음을 실행합니다.
ru: Интерналированный процесс запускается.

source: The bug triaging process are following the `general bug triaging process <https://wiki.openstack.org/wiki/BugTriage>`_. If you want to help bug triaging tasks, join the `OpenStack I18n bug team <https://launchpad.net/~openstack-i18n-bugs>`_ first.
ja: バグトライアルプロセスは、一般的なバグトライアルプロセス <https://wiki.openstack.org/wiki/BugTriage> に従っています。 OpenStack I18n bug team <https://launchpad.net/~openstack-i18n-bugs> に加わりたい場合は、まず参加してください。
ko_kr: BUG_triage_process는 일반적인 버그 트리밍 프로세스 <https://wiki.openstack.org/wiki/BugTriage>을 따릅니다. OpenStack I18n Bug 팀 <https://launchpad.net/~openstack-i18n-bugs>_에 참여하여 버그 트리밍 task를 도와주세요.
ru: Процесс устранения ошибок является следующим по порядку:

source: The change is done by a bot. If anything looks wrong with it, you need to actively reach out to the :ref:`OpenStack I18n team <openstack_i18n_team>` and point the problem out.
ru: Контрольные изменения выполняются ботом. Если что-то parece не так, необходимо активно обратиться к :ref:`команде OpenStack по переводу <openstack_i18n_team>`, и указать проблему.

source: The convention for heading levels is as follows::
ja: ### Heading Level 1
ko_kr: ### Heading Level 1
ru: Конвенция для уровня заголовков:

source: The easiest way would be to open http://tarballs.openstack.org/translation-source and then follow ``<Zanata-project-name>``, ``<Zanata-version>`` and corresponding links.
ja: http://tarballs.openstack.org/translation-source/translate/?project=openstack-heat&version=rocky
ko_kr: OpenStack 번역 소스에 대한 URL을 제공합니다.
ru: Чтобы сделать это наименьше сложным, сначала откройте http://tarballs.openstack.org/translation-source и следуйте за ``<Zanata-project-name>``, ``<Zanata-version>`` и соответствующими ссылками.

source: The filename of the list is ``tools/translation_team.yaml``.
ko_kr: ```yml
ru: `агрегат`

source: The following is an example of ``local.conf`` for Newton release which runs core components (keystone, nova, glance, neutron, cinder), horizon, swift and heat. The components which the main horizon code supports are chosen.
ru: Представлен пример `local.conf` для релиза Newton, который запускает основные компоненты (Keystone, Nova, Glance, Neutron, Cinder), Horizon, Swift и Heat. Выбранные компоненты, которые поддерживаются основным кодом Horizon.

source: The following is an example of ``zanata.xml``. In most cases, what you need to edit are **project** and **project-version**.
ko_kr: ```xml
ru: `Заната` (Zanata) — это платформа для перевода и локализации.

source: The followings are useful links when writing documents in RST.
ja: * [RST Syntax](https://www.restructuredtext.org/rst/4.html)
ko_kr: 다음은 RST 문서 작성에 유용한 링크입니다.
ru: Следующие ссылки полезны при написании документов в RST.

source: The goal of the review is that the structure of the change is fine, it's not that the strings are translated properly. The review of translated strings is done by teams using the translation server.
ko_kr: `리뷰 목적은 구조가 잘되어 있지만, 문자열이 적절히 번역되지 않은 것이 아니라, 번역된 문자열의-quality를 평가하는 것입니다. 리뷰 팀은 번역 서버를 사용하여 번역된 문자열을 리뷰합니다.`
ru: Оценка структуры изменения удовлетворительна, но переводимые строки не переведены правильно. Оценка перевода строк производится командами по переводу с помощью сервера перевода.

source: The guide is written in reStructuredText (RST) markup syntax with Sphinx extensions. Most conventions follow `those of the openstack-manuals project <http://docs.openstack.org/contributor-guide/rst-conv.html>`__.
ja: .. _aggregate:
ko_kr: * **Aggregate**: 집합
ru: Справочник написан на языке reStructuredText (RST) с использованием Sphinx расширений, следуя темам openstack-manuals проекта <http://docs.openstack.org/contributor-guide/rst-conv.html>_.

source: The infra scripts consider a project as a Django project when your repository name ends with ``-dashboard``, ``-ui``, ``horizon`` or ``django_openstack_auth``. Otherwise your project will be recognized as a Python project. Projects using ReactJS need special treatment.
ru: Проекты, которые рассматриваются инфраструктурными скриптами как Django-проекты, когда в репозитории есть фрагмент `dashboard`, `ui`, `horizon` или `django_openstack_auth`, будут признаны как Django-проекты. В противном случае проект будет распознаваться как Python-проект. Проекты, которые используют ReactJS, требуют особого обращения.

source: The infra scripts for translation setup work as follows:
ru: Инфраструктура сценариев настройки перевода работает следующим образом.

source: The infra scripts recognize a project type based on its repository name. If the repository name ends with ``-dashboard``, ``-ui``, ``horizon`` or ``django_openstack_auth``, it is treated as a Django project. Otherwise it is treated as a Python project.
ru: Правила распознавания инфраструктуры сценария признания проекта на основе названия репозитория. Если название репозитория заканчивается на `-dashboard`, `-ui`, `horizon` или `django_openstack_auth`, оно рассматривается как Django-проект. Стоит отметить, что в противном случае это будет Python-проект.

source: The master glossary is an usual POT file. You can edit it in your favorite editor as usual.
ru: Сервер не доступен.

source: The other way is to rerun DevStack. Ensure to include ``RECLONE=True`` in your ``local.conf`` before running ``stack.sh`` again so that DevStack retrieve the latest codes of horizon and other projects.
ko_kr: 다른 방법은 DevStack을 다시 실행하는 것입니다. `RECLONE=True`를 포함하여 `local.conf`에 추가하고 `stack.sh`를 다시 실행하여 Horizon과 다른 프로젝트의 최신 코드를 retrieves합니다.
ru: Чтобы использовать другую метод, сначала перезагрузите DevStack. Убедитесь, что в ``local.conf`` включен параметр ``RECLONE=True``, чтобы DevStack мог получить последние коды Horizon и другие проекты.

source: The proposal bot also removes files, it removes files that have very few translations in them. Note that no translations will be lost, they are still in the translation server.
ko_kr: 제안봇은 파일을 제거합니다. 제안봇은 매우 적은 번역이 있는 파일들을 제거합니다. 번역이 남아 있지만 원래의 번역 서버에 유지됩니다.
ru: Бот предложения также удаляет файлы, удаляя те, которые содержат очень мало переводимых текстов. Однако, как и в случае с переводимыми текстами, все файлы сохранены на сервере перевода.

source: The script ``tools/zanata/zanata_stats.py`` helps retrieving translation statistics from Zanata.
ko_kr: Zanata 통계를 얻기 위한 스크립트는 `tools/zanata/zanata_stats.py`입니다.
ru: Скрипт `tools/zanata/zanata_stats.py` помогает получить статистику перевода из Zanata.

source: The script ``tools/zanata/zanata_userinfo.py`` helps this. It generates a CSV file by reading a YAML file which contains the list of translators (e.g., ``translation_team.yaml``) with user name and e-mail addresses by interacting with Zanata API.
ko_kr: ```python
ru: `простой скрипт `tools/zanata/zanata_userinfo.py` помогает этому. Он генерирует CSV-файл, прочитав YAML-файл, содержащий список переводчиков (например, `translation_team.yaml`) с именами пользователя и электронными адресами, взаимодействуя с API Zanata.`

source: The scripts below depend on several python modules. To install these dependencies, run ``pip install -e requirements.txt``.
ko_kr: `설치 의존성은 pip install -e requirements.txt 명령을 사용하여 설치해야 합니다.`
ru: Пакеты необходимы для запуска скрипта: pip install -e requirements.txt

source: The statistics are calculated using `a Python script <https://opendev.org/openstack/i18n/src/tools/zanata/zanata_stats.py>`__ powered by `Zanata statistics API <http://zanata.org/zanata-platform/rest-api-docs/resource_StatisticsResource.html>`__ Translator list is maintained by `translation_team.yaml <https://opendev.org/openstack/i18n/src/tools/zanata/translation_team.yaml>`__ stored in `openstack/i18n git repository <https://opendev.org/openstack/i18n>`__.
ja: 統計はPythonスクリプト `<https://opendev.org/openstack/i18n/src/tools/zanata/zanata_stats.py>`__ で計算され、Zanata統計API `<http://zanata.org/zanata-platform/rest-api-docs/resource_StatisticsResource.html>`__ を利用しています。翻訳リストは `translation_team.yaml` <https://opendev.org/openstack/i18n/src/tools/zanata/translation_team.yaml>`__ で管理され、OpenStack i18n Git リポジトリ `<https://opendev.org/openstack/i18n>`__ に保存されています。
ko_kr: 통계는 Python 스크립트 <https://opendev.org/openstack/i18n/src/tools/zanata/zanata_stats.py>를 사용하여 계산됩니다. <http://zanata.org/zanata-platform/rest-api-docs/resource_StatisticsResource.html> Zanata 통계 API에 의해 제공됩니다. 번역자 목록은 `translation_team.yaml` <https://opendev.org/openstack/i18n/src/tools/zanata/translation_team.yaml>`__에 유지 관리され 있으며, <https://opendev.org/openstack/i18n/>의 openstack/i18n Git 저장소에 저장됩니다.
ru: Статистика рассчитывается с помощью Python-скрипта <https://opendev.org/openstack/i18n/src/tools/zanata/zanata_stats.py> powered by Zanata statistics API <http://zanata.org/zanata-platform/rest-api-docs/resource_StatisticsResource.html> Переводчикская lista maintained by translation_team.yaml <https://opendev.org/openstack/i18n/src/tools/zanata/translation_team.yaml> stored in openstack/i18n git repository <https://opendev.org/openstack/i18n/>.

source: The translatable strings are extracted from a source project. So some i18n bugs might be caused by bugs in the original strings/source codes of a source project which contains these translatable strings. Those kind of bugs should be fixed in the source project.
ja: IP の割り当て
ko_kr: `원본 프로젝트의 오류가 인자이기 때문에 i18n 오류가 발생할 수 있습니다. 원본 프로젝트에서 발견된 오류를修复하는 것이 중요합니다.`
ru: Всего 1 перевод:

source: The translated PO files will converted into JSON and placed into the ``./i18n/locales`` directory.
ru: Контрольные правила перевода:

source: The translation plan is announced on `Zanata <https://translate.openstack.org>`__ and contains the projects with the highest priority in translation. Usually these are all user-visible projects, like Horizon.
ko_kr: Zanata에서 번역 계획이 발표되어 있으며, 가장 높은 우선순위를 받는 프로젝트는 일반적으로 사용자에게 보이는 프로젝트가 많습니다. 예를 들어, Horizon과 같은 사용자에 대한 프로젝트가 주로 포함됩니다.
ru: План перевода объявлен на Zanata <https://translate.openstack.org> и содержит проекты с наибольшей приоритетностью в переводе. Обычно эти все пользовательские проекты, такие как Horizon.

source: The translation team is translating stable branches only for GUI projects, so for horizon and its plugins.
ru: Сборная группа переводчиков переводит только стабильные ветки для проектов GUI, поэтому для Horizon и его плагинов.

source: Then, for every PO file, we should execute the following command to build into MO file:
ru: Затем для каждого файлов .po, мы должны выполнить следующую команду, чтобы построить из нее файл .mo.

source: Then, your locale translation team is created successfully. You can enroll more people to join and start your translation work.
ko_kr: Translation Team Created Successfully
ru: Теперь создана локализационная команды по переводу с английского на русский язык. Вы можете зарегистрироваться и начать работать над переводом.

source: There are cases where you cannot see your translation statistics in Stackalytics even after you translate strings in Zanata.
ja: アグリゲートの存在有無
ko_kr: 집합은 실제로 존재하지 않습니다.
ru: В некоторых случаях вы не сможете увидеть свои статистики перевода в Stackalytics даже после перевода строк в Zanata.

source: There are several ways to know your translation activity.
ja: アクティビティを知るためのさまざまな方法があります。
ko_kr: 가정에서 활동을 확인하는 방법은 여러 가지가 있습니다.
ru: Возможны несколько способов определить свою переводную активность.

source: There are three different roles in a translation team:
ja: 役割は３つあります。
ko_kr: 역할은 세 가지로 나뉘어져 있습니다.
ru: Были три разных роли в команде перевода.

source: This `Script in I18n repo <https://opendev.org/openstack/i18n/src/tools/zanata/zanata_users.py>`__ collects all users and their activities.
ko_kr: 이 `Script in I18n repo <https://opendev.org/openstack/i18n/src/tools/zanata/zanata_users.py>` __는 모든 사용자와 활동을 수집합니다.
ru: Этот скрипт в репозитории i18n OpenStack <https://opendev.org/openstack/i18n/src/tools/zanata/zanata_users.py> собирает всех пользователей и их активности.

source: This document explains to reviewers details about the automatic import of translations from Zanata.
ja: Zanata から自動的に翻訳された情報をインポートする際の詳細なレビューの説明書です。
ko_kr: Zanata에서 tự động으로 번역을.import하는 방법에 대한 리뷰어에게 설명하는 दस장입니다.
ru: Этот документ предоставляет отзывчикам подробную информацию о автоматическом импорте переводов из Zanata.

source: This document gives additional information.
ja: このドキュメントは、追加の情報を提供します。
ko_kr: 이 दस장은 추가 정보를 제공합니다.
ru: Этот документ предоставляет дополнительную информацию.

source: This following statistics data is calculated using up-to-date `translation_team.yaml <https://opendev.org/openstack/i18n/src/commit/a67e08d86cc78907da38d5f09b8be6f71d1979a0/tools/zanata/translation_team.yaml>`__ (date: Jan 15, 2017).
ko_kr: 2023년 1월 15일 OpenStack i18n의 translation_team.yaml에 있는 데이터를 사용하여 다음 통계를 계산했습니다.
ru: Эти следующие статистические данные рассчитаны по последней версии `translation_team.yaml <https://opendev.org/openstack/i18n/src/commit/a67e08d86cc78907da38d5f09b8be6f71d1979a0/tools/zanata/translation_team.yaml>`__ (дата: 15 января 2017 года).

source: This guide itself is I18n-ed and you can translate it into your language. To translate it, visit `i18n <https://translate.openstack.org/project/view/i18n>`__ project in `Zanata <https://translate.openstack.org/>`__. Document **doc** in **i18n** project corresponds to this guide. You can translate it in the same way as you do for other projects like dashboard or manuals. Once the translation progress becomes higher than the threshold (For more information on the threshold, see :ref:`translation-jobs`), the translated version of the guide will be published.
ja: このガイド自体がI18n化されており、OpenStackのI18nプロジェクトのZanataで翻訳できます。
ko_kr: 집합 가이드 자체가 I18n-ized되어 있습니다. 이 가이드를 한국어로 번역할 수 있습니다. 번역을 위해 `i18n <https://translate.openstack.org/project/view/i18n>`__ 프로젝트에 방문하여 `Zanata <https://translate.openstack.org/>`__에서 프로젝트의 **doc** 섹션을 확인하세요. 이 가이드는 다른 프로젝트와 마찬가지로 **dashboard** 또는 **manuals**와 같은 프로젝트와 같이 번역을 수행할 수 있습니다. 번역 진행률이 임계치(번역 jobs에 대한 더 많은 정보를 참조하십시오) 초과하면, 번역된 가이드의 버전이 출판됩니다.
ru: Этот руководство уже переведено на multiple languages и можно использовать в качестве источника для перевода других документов. Чтобы перевести это руководство, вы можете использовать Zanata <https://translate.openstack.org/>__.

source: This guide provides detailed instructions on the I18n contribution workflow and conventions to be considered by all contributors.
ja: このガイドは、すべてのコントリビュータが考慮するI18n貢献ワークフローと規約について詳細な説明を提供します。
ko_kr: 이 가이드는 모든 기여자들이 고려해야 하는 I18n 기여도 워크플로우와 규칙에 대한 세부 정보를 제공합니다.
ru: Этот руководство предоставляет подробную информацию о потокеContributions I18n и общественных норм, которые должны учитываться всеми участниками.

source: This is a useful commands for the IRC meeting.
ja: このコマンドは、IRC会議で有用なものです。
ko_kr: 이것은 IRC 회의에서 유용한 명령입니다.
ru: Эти команды полезны для IRC-конференции.

source: This is written about openstack-manuals project. As of the end of Pike development cycle, `the document migration community-wide effort <https://specs.openstack.org/openstack/docs-specs/specs/pike/os-manuals-migration.html>`__ is being done. The process documented here might be changed in near future.
ko_kr: 이 문서는 OpenStack-manuals 프로젝트에 관한 것입니다. Pike 개발 사이클의 끝까지, <https://specs.openstack.org/openstack/docs-specs/specs/pike/os-manuals-migration.html>라는 커뮤니티-wide effort가 진행 중입니다. 이 과정은 가까운 미래에 변경될 수 있습니다.
ru: Эта информация написана о проекте openstack-manuals. В конце цикла Pike развития, сообщество проводит общие усилия по миграции документов <https://specs.openstack.org/openstack/docs-specs/specs/pike/os-manuals-migration.html>. Процесс, описанный здесь, может быть изменен в ближайшем будущем.

source: This list is a cache of information on Zanata, and we need to keep it synced with Zanata.
ja: Zanataの情報をキャッシュとして保持し、Zanataと同期する必要があります。
ko_kr: Zanata의 정보를 유지하기 위해 다음을 사용합니다.
ru: Этот список является кэшем информации о Zanata и нам нужно synchronизировать его с Zanata.

source: This means "Aggregates" menu in "Admin" group in the left side menu. In Horizon code, the second level corresponds to a dashboard group like "Project" or "Admin" and the third level corresponds to a panel like "Aggregates" (in this example), "Instances" or "Networks".
ja: アグリゲート
ko_kr: 집합
ru: `Меню «Агрегаты» в группе «Правительство» в левой части меню`

source: This page collects small tips and tricks around translations.
ja: このページでは、翻訳の小さなトリックやヒントを集めています。
ko_kr: 이 페이지는 번역에 대한 작은 팁과 트릭을 수집합니다.
ru: Эта страница собирает небольшие советы и трюки по переводам.

source: This page covers various operations around i18n activities.
ja: このページでは、i18n 活動のさまざまなオペレーションについて説明しています。
ko_kr: 이 페이지는 이18n 활동에 대한 다양한 연산을 covering합니다.
ru: Эта страница охватывает различные операции вокруг деятельности i18n.

source: This page describes how end users can report translation bugs.
ja: このページでは、翻訳エラーを報告するユーザーの手順について説明しています。
ko_kr: 이 페이지는 번역 오류를 보고하는 사용자들이 어떻게 báo cáo할 수 있는 방법에 대해 설명합니다.
ru: Эта страница описывает, как пользователи могут сообщить о ошибках перевода.

source: This page describes the conventions and tips on writing this guide itself.
ja: このガイドの書き方に関する規則とアドバイスについて説明します。
ko_kr: 이 가이드를 작성하는 방법에 대한 규칙과 지침을 설명합니다.
ru: Эта страница описывает нормы и рекомендации по написанию этой руководства самому себе.

source: This page documents what I18n team concerns and which things are needed to do with OpenStack releases. Each OpenStack release has around 6-month cycle and the corresponding schedule is available on https://releases.openstack.org/ (e.g., https://releases.openstack.org/ocata/schedule.html describes Ocata release schedule).
ko_kr: 이 페이지는 I18n 팀의 우선순위를 설명하고, OpenStack 릴리스에 대한 작업을 수행해야 하는 것들을 설명합니다. 각 OpenStack 릴리스는 약 6개월 주기로 진행되며, corresponding schedule은 https://releases.openstack.org/ (예: https://releases.openstack.org/ocata/schedule.html )에서 제공됩니다.
ru: Эта страница документирует проблемы и задачи, связанные с переводом на 18N-команда OpenStack, а также необходимые действия для каждого выпуска OpenStack. Каждый выпуск OpenStack имеет примерно 6-месячный цикл и соответствующий расписной доступен на https://releases.openstack.org/ (например, https://releases.openstack.org/ocata/schedule.html описывает расписание выпуска Ocata).

source: This script requires Zanata admin privilege.
ko_kr: 이 스크립트는 Zanata 관리자 권한이 필요합니다.
ru: Этот скрипт требует прав администратора Zanata.

source: This section tries to share best practices on how team coordinators manages their language team. Feel free to add useful information!
ko_kr: 팀 코디네이터가 언어 팀을 관리하는最佳 관행에 대한 이 부분은 팀의 성과를 향상시키는 데 도움이 될 수 있는 유용한 정보를 제공합니다.
ru: Контролируемая практика управления командой по переводу:

source: This should be done after a stable version on Zanata is created.
ja: このタスクは、Zanataで安定バージョンが作成された後に行う必要があります。
ko_kr: 이 작업은 안정적인 버전이 Zanata에서 생성된 후에 수행해야 합니다.
ru: Эта задача должна быть выполнена после стабильной версии на Zanata.

source: Three new dependencies are required : ``react-intl``, ``babel-plugin-react-intl``, and ``react-intl-po``.
ru: Три новые зависимости необходимы: `react-intl`, `babel-plugin-react-intl` и `react-intl-po`.

source: Titles
ja: * 'タイトル'
ko_kr: * 'title': '제목'
ru: * 'агрегат'

source: To add a link to a generated document, you need to update the file ``www/<lang>/index.html`` in the ``master`` branch of the ``openstack-manuals`` repository. Note that the web pages are published from ``master`` branch, which contains the pages for all releases, such as Liberty. Therefore, you don't need to update the file ``www/<lang>/index.html`` in the stable branch.
ja: `www/<lang>/index.html` を `openstack-manuals` リポジトリの `master` ブランチにアップデートすることで、生成されたドキュメントへのリンクを追加できます。注意してくださいが、Web ページは `master` ブランチから公開されます。これには、リリースのすべてのページ、たとえばリバティー (Liberty) などが含まれます。そのため、`www/<lang>/index.html` を `stable` ブランチにアップデートする必要はありません。
ko_kr: 위에 있는 문서를 생성하여 링크를 추가하려면 `www/<lang>/index.html` 파일을 `master` 브랜치의 `openstack-manuals` 리포지토리에서 업데이트해야 합니다. 주의할 점은 `master` 브랜치는 모든 릴리스의 페이지를 포함하는 것으로, 따라서 릴리스에 대한 페이지가 필요하지 않다면 `stable` 브랜치를 업데이트할 필요는 없습니다.
ru: Чтобы добавить ссылку на созданный документ, необходимо обновить файл `www/<lang>/index.html` в ветке `master` репозитория `openstack-manuals`. Примечание: страницы веб-страницы публикуются из ветки `master`, которая содержит страницы для всех выпусков, таких как Либerty. Следовательно, не нужно обновлять файл `www/<lang>/index.html` в ветке стабильной версии.
