Repository: openstack-kr/knu_i18n_2025
Catalog: po/llama3.2:3b/*/i18n-docs-source-locale-*.po
Languages: ja, ko_kr, ru

source: (optional) Put your language name as bug tag.
ja: bug: English to Japanese translation
ko_kr: bug: English to Korean (South Korea)
ru: bug: russian

source: **Make sure to include your English language name in a bug summary**. It is also suggested to write a bug summary in English. For example:
ja: I'm sorry I couldn't fulfill your request as I am only able to respond with Japanese text.
ko_kr: I'm sorry to inform you that there was an issue with the translation of "compute service" to Korean (South Korea). The correct translation should be "" instead of "".
ru: Нет.

source: **tox** is available on PyPI and also available in various Linux distribution. ``pip install tox`` or ``apt-get install python-tox`` (in case of Ubuntu) installs **tox**.
ko_kr: `tox`는 PyPI에 availability와 함께 다양한 리눅스 배포판에서 사용할 수 있습니다. `pip install tox` 또는 `apt-get install python-tox` (Ubuntu의 경우)로 `tox`를 설치할 수 있습니다.
ru: Токс доступен на PyPI и также доступен в различных дистрибутивах Linux. ``pip install tox`` или ``apt-get install python-tox`` (в случае Ubuntu)(install tox).

source: :doc:`Your language team <lang_team>` may have useful information to help our translation efforts including translation guidelines, priorities, communication tools and so on. It is worth visited. You can find your language team page at https://wiki.openstack.org/wiki/I18nTeam/team. If you have questions, you can contact your coordinators.
ja: :doc:`あなたの言語チーム <lang_team>` は、翻訳活動に役立つ情報を提供する可能性があります。翻訳ガイドライン、優先度、コミュニケーションツールなどが含まれています。 これらのリソースは必ず訪問する価値があります。 :doc:`あなたの言語チームのページ <https://wiki.openstack.org/wiki/I18nTeam/team>` を見つけられます。質問がある場合は、コーディネーターに連絡してください。
ko_kr: :doc:`Your `
ru: Ваш языковый комитет <lang_team> может иметь полезную информацию для содействия нашим переводческим усилиям, включая руководства по переводу, приоритеты, коммуникационные инструменты и так далее. Это стоит того посмотреть. Вы можете найти страницу вашего языкового комитета на https://wiki.openstack.org/wiki/I18nTeam/team. Если у вас есть вопросы, вы можете связаться с координаторами.

source: :ref:`search`
ja: 検索
ko_kr: :search
ru: Поиск

source: A glossary file of your language is found at ``glossary/locale/<lang>/LC_MESSAGES/glossary.po`` in the i18n repository. The file is a usual PO file.
ja: アグリゲート
ru: агрегат

source: A person who can proofread translations and mark them as reviewed (approved) or rejected.
ja: **[翻訳検証者]**
ko_kr: * **Proofreading**:
ru: **[Review]**

source: A person who can submit translations.
ja: 人事が翻訳を提出できる人物です。
ko_kr: 인물이 번역을 제출할 수 있는 사람입니다.
ru: Человек, который может подать переводы.

source: A privileged member in a translation team who can help in team management tasks, such as approving new members and reviewing contributions to that language. We also have task coordinators for specific tasks.
ko_kr: 우리는 자격 증명서를 사용하여 ID 제공자와 ID 서비스를 연결합니다.
ru: Представитель с привилегированным правом в команде перевода, который может помочь в задачах управления командой, такие как Approbation новых участников и обзор вклада в этот язык. Мы также имеем координаторов задач для конкретных задач.

source: A series of tasks in OpenStack infrastructure is used to manage translation changes in Zanata. Without running the tasks, translation changes will not be reflected into OpenStack projects. This page explains how the infrastructure tasks run actual scripts as `Zuul <https://docs.openstack.org/infra/zuul/>`_ jobs and monitor the job status.
ko_kr: Zanata 번역 변경을 OpenStack 프로젝트에 반영하기 위해 오픈 스텝 (OpenStack)infrastructure의 일련된 task를 사용합니다. 오픈 스텝 task를 실행하지 않으면, Zanata에서 번역 변경이 오픈 스텝 프로젝트에 반영되지 않습니다. 이 페이지는 오픈 스텝 task가 실제 스크립트를 `Zuul <https://docs.openstack.org/infra/zuul/>`_ job으로 실행하고, job 상태를 모니터링하는 방법을 설명합니다.
ru: Серия задач в инфраструктуре OpenStack используется для управления изменениями перевода в Zanata. Без выполнения задач изменения перевода не будут отражены в проектах OpenStack. Эта страница объясняет, как работают инфраструктурные задачи, которые запускают действительные сценарии как `Zuul <https://docs.openstack.org/infra/zuul/>`_ задачи и мониторят статус задачи.

source: A template is a skeleton of static HTML files. In this case, the string is perhaps used in "Update" form in "Container" menu.
ja: テンプレートは静的なHTMLファイルの骨格です。この場合、`Update`フォームに使用される文字列は「コンテナ」メニュー内で使用されます。
ko_kr: `테ンプ릿은 정적 HTML 파일의 뼈대입니다. 이 경우, `Container` 메뉴의 "Update" 형식에서 사용되는 문자열이 될 수 있습니다.`
ru: Шаблон представляет собой кости статического HTML-файла. В этом случае строка может использоваться в обновлении формулы в меню "Контейнер".

source: ATC Statistics in past releases
ja: ATC (Air Traffic Control) スtatistics の過去のリリース
ko_kr: past 릴리스에서 ATC 통계를 보는 방법은 다음과 같습니다.
ru: Статистика ATC в прошлых выпусках.

source: ATC candidates are translators who has translated more than 200 words and reported their e-mail and name to language coordinators, and also signed ICLA.
ko_kr: ATC(Advanced Translation Candidate) 후보자들은 200 단어 이상의 번역을 완료하고 언어 조정자에게 이메일과 이름을 보고 ICLA를 서명한 번역자이다.
ru: Кандидаты на ATC - это переводчики, которые перевели более 200 слов и сообщили о своем электронном адресе и фамилии коordinаторам языка, а также подписали ICLA.

source: ATC members of I18n project
ja: ATC の I18n プロジェクトのメンバーです。
ko_kr: ATC 구성원은 I18n 프로젝트의 구성원입니다.
ru: Члены ATC (Аналитическая группа по переводу) проекта i18n.

source: About this guide
ja: このガイドについて
ko_kr: 이 가이드에 대해 알려드릴게요.
ru: Этот руководство.

source: Add Translation Server Support
ru: Поддержка сервера перевода.

source: Add the jobs to your pipelines.
ru: Добавьте задачи в pipeline.

source: After the documents are translated and reviewed well, updating existing ``www/<lang>/index.html`` or creating a new language landing page is needed.
ko_kr: 다음 문서가 잘 번역된 후에, 존재하는 www/<lang>/index.html을 업데이트하거나 새로운 언어의 랜딩 페이지를 만들 필요가 있습니다.
ru: После перевода и проверки документов, необходимо обновить существующий ``www/<lang>/index.html`` или создать новый лендинг для языка `<lang>`.

source: After the official release, translating master version is welcome for upstream translation contribution, but the original strings may be changed frequently due to upstream development on the projects.
ja: アップストリームの公式リリース後、オフicialリリースバージョンのマスター版を使用してアップストリームへの翻訳貢献がwelcome です。ただし、上流開発でプロジェクトのオリジナルスตรングが頻繁に変更される可能性があります。
ko_kr: 공식 릴리스 후 공식 버전은 상위 번역에 환영되지만, 원본 문자는 자주 업스트림 개발로 인해 변경될 수 있기 때문에.
ru: После официального выпуска, перевод мастерной версии приветствуется для вклада в перевод на upstream, но исходные строки могут быть изменены часто из-за разработки upstream на проектах.

source: After you edit the master glossary, ensure to reflect the change to all language glossary files. To do this, run the following command.
ru: Проведите следующие команды для обновления всех файлов glossary в разных языках.

source: All upstream OpenStack documents in ``openstack-manuals`` and project repositories use ``master`` branch and can have stable branches depending on release models and maintaining documents in different project teams. Cross-project liaisons are strongly encouraged to communicate with I18n team so that I18n team can discuss and decide which stable documents are the target in I18n team and when translators start to translate stable documents.
ko_kr: 전체 상위 OpenStack दस्तव이아 ``openstack-manuals`` 및 프로젝트 리포지토리에서 ``master`` 브랜치를 사용하고, 릴리스 모델과 유지 관리하는 दस्तव이아가 다른 프로젝트 팀에 의해 유지 관리되는 경우 안정적인 브랜치는 릴리스 모델에 따라 다를 수 있습니다. 상호 프로젝트 협력자는 강조된 경우 I18n 팀과 소통하여 I18n 팀이 안정적인 दस्तव이아가 목표가 되는지, 그리고 번역자들이 안정적인 दस्तव이아를 번역할 때의 시점을 결정하는 것을 discussing 할 수 있습니다.
ru: В всех upstream OpenStack документах в ``openstack-manuals`` и проектных репозиториях используется ветка ``master`` и могут использоваться стабильные ветки в зависимости от моделей выпуска и поддержания документов в разных командах проекта. Кросс-проектным лиасонам strongly recommended communicate with I18n team, чтобы I18n team could discuss and decide which stable documents are the target in I18n team and when translators start to translate stable documents.

source: Also, release notes translations are only needed on master since release notes are published only from master, the translations get removed on stable branches.
ko_kr: * 'release notes': '리リース 노트'
ru: Остальные переводы не требуют.

source: Although each language team could follow the I18n team working plan, your team may also decide your own work items and priorities as a language team.
ko_kr: 어떤 언어 팀은 I18n 팀의 작업 계획을 따르지만, 우리 팀도 자신의 작업 항목과 우선순위를 결정할 수 있습니다.
ru: Хотя каждая команду по переводу может следовать плану по переводу команды I18N, ваша команда может также решить свои собственные задачи и приоритеты как команде по переводу.

source: Amandeep Singh Saini (jimidar) - Punjabi (India)
ja: アMANDEEP・シング・サインイ (ジマダール) - インド (パunjャバン)
ko_kr: ਆਮੰਦੇਪ ਸਿੰਘ ਸੈਣੀ (ਜੀਮੀਡਾਰ) - ਪੰਜਾਬੀ (ਭਾਰਤ)
ru: АмандEEP Синг СAINИ (Джимидар) - Пंजаби (Индия)

source: Another convenient way is to check dashboard translations is to run DevStack in your local environment. To run DevStack, you need to prepare ``local.conf`` file, but no worries. Several ``local.conf`` files are shared on the Internet and a minimum example is shown below. From our experience, you need a machine with two or four CPU cores, 8 GB memory and 20 GB disk to run DevStack comfortably. If you enable just major OpenStack projects, the machine requirement would be much smaller like 2~4GB memory.
ja: DevStackをローカル環境で実行することで、ダッシュボードの翻訳をチェックする便利な方法があります。DevStackを実行するには、``local.conf``ファイルを準備する必要がありますが、心配する必要はありません。インターネット上に ``local.conf`` ファイルが共有されており、最小の例は以下のようになっています。
ko_kr: 다음은 데브 스택을 로컬 환경에서 실행하는 것을 통해 디스플레이어 번역을 확인하는 방법입니다. 데브 스택을 실행하려면 ``local.conf`` 파일을 준비해야 합니다. 하지만 keine Sorge, 여러 ``local.conf`` 파일이 인터넷에 공유되어 있으며 최소한의 예를 보여주는 것만으로도 충분합니다. 우리가 경험한 결과는 2개 이상의 CPU 코어, 8GB 메모리 및 20GB 디스크가 데브 스택을 편안하게 실행할 수 있는 기기에 필요합니다. 만약 단일 주요 오픈 스탁 프로젝트만 활성화한다면, 기기에 필요한 메모리는 2~4GB 정도입니다.
ru: Другой удобный способ проверить переводы на панели управления — запустить DevStack в своей местной среде. Чтобы запустить DevStack, необходимо подготовить файл ``local.conf``, но не беспокойтесь. Several ``local.conf`` files доступны в Интернете и минимальный пример показан ниже. Из нашего опыта, вам понадобится компьютер с двумя или четырьмя ядрами процессора, 8 ГБ ОЗУ и 20 ГБ диска, чтобы запустить DevStack комфортно. Если вы включили только основные проекты OpenStack, требования к компьютеру будутmuch меньше, например 2~4ГБ ОЗУ.

source: As a minimal check that the translation files that are imported are valid, you can add to your lint target (``pep8`` or ``linters``) a simple ``msgfmt`` test:
ru: агрегат

source: As a translator, if reported bugs turns out beyond a translation bug, it is better to ask I18n team members via the mailing list or the IRC channel. They can handle such bugs.
ja: アプリケーションは、リリース後に報告されたバグが翻訳の問題であるかどうかを確認する必要があります。ただし、翻訳の問題ではありません。そうでない場合、I18n チームメンバーにメールリストまたはIRCチャンネルを通じて報告してください。
ko_kr: IP 할당이 beyond translation bug인 경우, I18n 팀 멤버를 이메일 목록이나 IRC 채널을 통해 연락하십시오. 그들은 이러한 문제를 처리할 수 있습니다.
ru: Были обнаружены ошибки, которые выходят за рамки перевода. Бेहतर всего обратиться в I18n-команду через почту или IRC-канал, чтобы они могли обработать такие проблемы.

source: As with I18n Core Team, the same things apply here. Launchpad I18n Core Team focuses on determining the importance of a translation and/or I18n bug and triaging bug priorities. You can find the member list on `Launchpad I18n Core Member list <https://launchpad.net/~openstack-i18n-core>`__.
ko_kr: Launchpad I18n Core 팀은 번역 및 I18n 오류의 중요도와/or 오류 우선순위를 결정하고, 오류 우선순위를 정리하는 데 초점을 맞추고 있습니다. Launchpad I18n Core 팀 구성원 목록은 `Launchpad I18n Core Member list <https://launchpad.net/~openstack-i18n-core>`__에서 확인할 수 있습니다.
ru: С точки зрения команды по переводу, то же самое applies here. Команда по переводам Launchpad I18n Core Team фокусируется на определении важности перевода и/или ошибки в области internationalization (I18n) и отслеживании приоритетов ошибок. Вы можете найти список участников на `Launchpad I18n Core Member list <https://launchpad.net/~openstack-i18n-core>`__.

source: Before use sphinx-build to build HTML file, we need to feed the translations from the single PO file into those small PO files. For example:
ko_kr: `./sphinx-translation-tool.py -i input.po -o output.po -t korean`
ru: Мы должны передать переводы из одного файла PO в несколько меньших файлов PO, прежде чем использовать Sphinx-build для построения HTML-файла.

source: Bugs in a source project
ja: バグが存在するソースプロジェクト
ko_kr: Bugs in a 소스 프로젝트
ru: Буги в исходном проекте.

source: Bugs in tool chains
ja: バグがtool chainに含まれている
ru: Буги в инструментах цепочки

source: Bugs in translated documents or dashboard are mainly classified into the following areas:
ja: バグは翻訳されたドキュメントやダッシュボードに主に以下の領域で分類される。
ko_kr: BUGS IN TRANSLATED DOCUMENTS OR DASHBOARD는 다음의 영역으로 분류됩니다.
ru: Буги в переведенных документах или дашборда в основном классифицируются по следующим областям:

source: Bugs to report English strings are hard to translate in your language. For example, translators cannot control the order of words, or a plural form is not supported. Usually, this kind of bugs are in the original strings and cannot be fixed just by changing the strings and more work is needed.
ja: バグを報告する English ストリングは、言語の翻訳が困難です。たとえば、翻訳者は単語の順序を制御できません。また、複数形はサポートされていません。通常、この種のバグは元のスクリプトで発生し、単にスクリプトを変更するだけで解決できないため、さらに多くの作業が必要です。
ko_kr: 집합은 여러 개의 요소를 포함하는 집합입니다.
ru: Буги отчета о ошибках перевода английские строки имеют трудности с переводом в наше языки. Например, переводчики не могут контролировать порядок слов или не поддерживаются множественные формы. Usually, это типы ошибок, которые находятся в исходных строках и не могут быть исправлены только изменением строк и требуют большего труда.

source: Building
ja: 建造
ko_kr: 건설
ru: Строение

source: Building: Build HTML from RST documents and the translated results.
ko_kr: **HTML 결과**
ru: Создание: Составление HTML из документов по-русски и переведенных результатов.

source: Builds release notes in both the original (English) version and translated versions (if any).
ja: **Original English Version**
ko_kr: **Original English Version**
ru: **Original English Version**

source: CLI (command line interface)
ja: コマンドラインインターフェース
ko_kr: 명령어 인터페이스
ru: Клиентская интерфейса командной строки.

source: Carries out the second Zuul job (Syncing into repos) by executing `propose_translation_update.sh <https://opendev.org/openstack/openstack-zuul-jobs/src/roles/prepare-zanata-client/files/propose_translation_update.sh>`__
ru: Возглашает второе задание Zuul (Синхронизация в репозитории) путем выполнения `propose_translation_update.sh <https://opendev.org/openstack/openstack-zuul-jobs/src/roles/prepare-zanata-client/files/propose_translation_update.sh>`__

source: Check from time to time open reviews on `I18n repo <https://review.opendev.org/#/q/project:openstack/i18n+status:open>`__. In addition to the PTL, the core reviewers are responsible.
ko_kr: * I18n repo <https://review.opendev.org/#/q/project:openstack/i18n+status:open>에서 열린 리뷰를 주기적으로 확인합니다.
ru: Правильный перевод:

source: Checking Translation Imports
ru: Оценка переводных импортов.

source: Click "..." on the right, and select "Request to join team".
ja: チームに参加する申請
ko_kr: 팀에 참여하실 것을 요청합니다.
ru: Кликните на "... в правом углу и выберите "Запрос присоединения к команде".

source: Click "Languages" on the top, all languages will be listed.
ja: 言語選択
ko_kr: *언어*
ru: Следуйте за linkом на главной странице.

source: Click "Log in" button.
ja: ログインボタンをクリックします。
ko_kr: 로그인 버튼을 클릭하세요.
ru: Нажмите на кнопку "Войти".

source: Click the language you want to translate, the language page will be shown.
ja: **日本語**
ko_kr: English
ru: Кликните на язык, который вы хотите перевести, и страница языков будет показана.

source: Common code used by **propose_translation_update.sh** and **upstream_translation_update.sh**
ja: ```bash
ko_kr: ```bash
ru: ```bash

source: Contents
ja: コンテンツ
ko_kr: 내용
ru: Содержание

source: Contributing
ja: 貢献
ko_kr: 참여하십시오.
ru: Участие

source: Convention
ja: アーキテクチャー
ru: Конвенция

source: Coordinator
ja: コーディネーター
ko_kr: 연결자
ru: Координатор

source: Creating a Language Team
ja: 言語チームの作成
ko_kr: 언어 팀을 만들기 위해 다음 단계를 따르십시오.
ru: Создание команды по переводу языков.

source: Cross Project Liaisons
ko_kr: 가속 프로젝트 상호 협력
ru: Кросс-проектные связи

source: Daily Work
ko_kr: 일상 일관
ru: Рабочий день.

source: Discuss and review glossary changes in your language team before you propose changes to the Gerrit review system. Reviewers in the Gerrit review system cannot understand your language in most cases, so they can only check syntax or conventions.
ja: アグリゲート
ko_kr: 집합
ru: Агрегат

source: Django Projects
ko_kr: 다니고 (Django) 프로젝트
ru: Дjangо-проекты

source: Documentation
ja: ドキュメント
ko_kr: *기본 문서*
ru: Документация

source: Documentation projects
ko_kr: 다음은 문서 프로젝트에 대한 설명입니다.
ru: Документационные проекты

source: Downloading
ja: ダウンロード中
ko_kr: 다운로드 중입니다.
ru: Загрузка

source: Downloading: Download the translated results by automation scripts.
ko_kr: 다운로드 중: 자동 스크립트를 사용하여 번역 결과를 다운로드합니다.
ru: Загрузка: Загружать переведенные результаты с помощью автоматизированных скриптов.

source: During translating a dashboard related project, you may want to know "where is this string used in the dashboard?".
ja: このテキストは、ダッシュボードのどこに使用されているのかを知りたい場合があります。
ko_kr: 이 문자는 댜시보드에 사용되는 위치를 알고 싶을 수 있습니다.
ru: Где этот текст используется в дашборde.

source: Each language team has useful information to help our translation efforts. It is worth visited. You can find your language team at https://wiki.openstack.org/wiki/I18nTeam/team.
ja: 各言語チームは、翻訳の努力に役立つ有用な情報を提供しています。 これらの情報を調べるには、https://wiki.openstack.org/wiki/I18nTeam/team を訪問してください。
ko_kr: https://wiki.openstack.org/wiki/I18nTeam/team
ru: Каждый команду языков имеет полезную информацию, которая помогает нашим усилиям по переводу. Это стоит того, чтобы посетить ее. Вы можете найти свою команду языка на https://wiki.openstack.org/wiki/I18nTeam/team.

source: Each language team may have useful information to help our translation efforts including translation guidelines, priorities, communication tools and so on. It is worth visited. You can find your language team page at https://wiki.openstack.org/wiki/I18nTeam/team. If you have questions, you can contact your coordinators.
ko_kr: 각 언어 팀은 번역에 도움이 될 수 있는 정보를 제공할 수 있습니다. 번역 지침, 우선 순위, 통신 도구와 같은 것들을 포함합니다. 이 정보는 방문할 수 있습니다. 언어 팀의 trang chủ page를 https://wiki.openstack.org/wiki/I18nTeam/team에서 찾을 수 있습니다. 질문이 있으면 의사 협력자에 연락해 보세요.
ru: Каждый команду языков может иметь полезную информацию для содействия нашим усилиям по переводу, включая руководства по переводу, приоритеты, инструменты связи и так далее. Это стоит того посетить. Вы можете найти страницу команды языка на https://wiki.openstack.org/wiki/I18nTeam/team. Если у вас есть вопросы, вы можете связаться с координаторами.

source: Edit file ``gerrit/projects.yaml`` and add the ``translate`` option:
ru: `переработать файл `projects.yaml` в `gerrit` с добавлением опции `translate`:

source: Edit file ``zuul.d/projects.yaml`` and add a template which defines translation jobs to your repository:
ru: `проекты/zuul.d/projects.yaml`

source: Every day, new translations get imported into the repositories using a proposal job. These need to have a review on whether the bot worked properly. You can see all open reviews in `Gerrit <https://review.opendev.org/#/q/status:open+topic:zanata/translations,n,z>`_. The subject of these patches is always "Imported Translations from Zanata".
ko_kr: 제가 제대로 작동했는지 확인하기 위해 매일 새로운 번역이 import 된 repositories에 추가되는 프로POSAL Job을 사용하여 new 번역이.import됩니다. 이 번역들은 always `Gerrit <https://review.opendev.org/#/q/status:open+topic:zanata/translations,n,z>`_에서 open review를 볼 수 있습니다. 이러한 patches의 주제는 always "Imported Translations from Zanata"입니다.
ru: Каждый день новые переводы загружаются в репозитории с помощью задачи по предложению, которые проходят рецензирование, чтобы проверить, работал ли бот правильно. Вы можете увидеть все открытые отзывы в `Gerrit <https://review.opendev.org/#/q/status:open+topic:zanata/translations,n,z>`_. Подъем этих(patchей всегда имеет одинаковый sujet "Импорт переводов из Zanata".

source: Everybody can propose agenda topics on `I18nTeamMeeting Wiki Page <https://wiki.openstack.org/wiki/Meetings/I18nTeamMeeting#Agenda_for_next_meeting>`_. If there are no topics proposed, the meeting might be canceled for that week.
ko_kr: 모든 사람들은 `I18nTeamMeeting Wiki Page <https://wiki.openstack.org/wiki/Meetings/I18nTeamMeeting#Agenda_for_next_meeting>` 에서 주제를 제안할 수 있습니다. 만약 주제가 제안되지 않으면, 이.week의 회의는 취소될 수 있습니다.
ru: Всего может предложить темы для повестки дня на странице `I18nTeamMeeting Wiki Page <https://wiki.openstack.org/wiki/Meetings/I18nTeamMeeting#Agenda_for_next_meeting>`_. Если нет тем, то встреча может быть отменена за этот месяц.

source: Everyone in the OpenStack community is glad to help you.
ja: オープンソースコミュニティの全員があなたを支援することになります。
ko_kr: 모든 오픈 스톡 커뮤니티는 आपक을 도와드릴 것입니다.
ru: Всяgemeина сообщества OpenStack с удовольствием помогает вам.

source: Extract Zanata user information
ru: Ни одной информации о пользователе Zanata не предоставляется.

source: Extracting
ko_kr: 집합
ru: Вывод

source: FAQ: I cannot find my name in Stackalytics
ja: お名前がStackalyticsで見つかりません。
ko_kr: 네임 스페이스에서 이름을 찾지 못한 경우에는 다음을 시도해 보세요:
ru: Вопрос: Я не могу найти свой номер в Stackalytics.

source: Finally, we could generate HTML files by
ko_kr: 마침내, HTML 파일을 생성할 수 있습니다.
ru: Наконец, мы могли создать HTML-файлы с помощью

source: Finding and reporting translation bugs is an important step towards better quality of translations in OpenStack.
ja: オープンソックの翻訳品質を向上させるために、翻訳エラーを探し出して報告することは非常に重要です。
ko_kr: finding 및 보고하는 번역 오류는 오픈 스톡크의 번역品질을 향상시키는 데 중요한 단계입니다.
ru: Найти и отчетить о ошибках перевода является важным шагом для улучшения качества переводов в OpenStack.

source: First enable translation in your project, depending on whether it is a Django project, a Python project or a ReactJS project.
ru: **English**

source: Fixing I18n bugs
ja: 修正I18nバグ
ko_kr: * 'I18n'를 '국가 표준화 기구 (ISO 639-1) 번호'로 바꾸기
ru: Ремонт ошибок internationalization (I18N).

source: Follow :doc:`the step <official_translator>` to register an ID in the translation website.
ko_kr: ID를 공식 번역 사이트에 등록하십시오.
ru: Зарегистрируйте ID на trangе перевода по official_translator.

source: For a document in a stable branch, such as the installation guide for Liberty, you need to update the file ``doc-tools-check-languages.conf`` in the target stable branch directly.
ja: `doc-tools-check-languages.conf` をターゲット スタビリティ ブランチで直接 `liberty` スタブ ブランチのファイルを更新する必要があります。
ko_kr: 안정적인 브랜치에 있는 दस기본을 포함하는 문서를 예로 들어서, 리버티 설치 가이드와 같은 안정적인 브랜치를 사용할 때, doc-tools-check-languages.conf 파일을 직접 목표 안정적인 브랜치에서 업데이트해야 합니다.
ru: Для документа в стабильной ветке, например, руководства по установке Liberty, необходимо обновить файл ``doc-tools-check-languages.conf`` в целевой стабильной ветке напрямую.

source: For documentations, URL and a detail place would be great.
ja: * ドキュメンテーション: [ドキュメンテーションのためのガイドライン](https://docs.openstack.org/openstack-manuals/latest/)
ko_kr: * '도서': '도서'
ru: Документация
