Repository: openstack-kr/knu_i18n_2025
Catalog: po/llama3.2:3b/*/sample.po
Languages: ja, ko_kr, ru, zh_cn

source: Fixed cross-policy object copies. Previously, copied data would always be written using the source container's policy. Now, the destination container's policy will be used, avoiding availability issues and unnecessary container-reconciler work.
ja: コンテナーに基づく交差ポリシーのオブジェクトのコピーを適用しました。以前、コピーされたデータは常にソース コンテナのポリシーで書き出されていましたが、現在、宛先コンテナのポリシーが使用されるようになります。これにより、利用可能性の問題と無駄なコンテナの再調整作業を回避できます。
ko_kr: 컨테이너를 사용하여 이fix를 적용했습니다. 이전에는 항상 소스 컨테이너의 정책을 사용하여 복사된 데이터가 쓰여졌습니다. 그러나 현재 대상 컨테이너의 정책이 사용되며, 가용성 문제와 불필요한 컨테이너-리conciler 작업을 피할 수 있습니다.
ru: Применены исправления для кросс-политикового копирования объектов. Ранее kopированные данные всегда писались с использованием политики источного контейнера. Теперь используем политику конечного контейнера, избегая проблем доступности и ненужной работы реconcilersа контейнеров.
zh_cn: 修复了交叉策略对象的拷贝。之前，拷贝的数据总是使用源容器的策略写入，现在将使用目标容器的策略写入，从而避免了可用性问题和不必要的容器重conciler工作。

source: Fixed deadlock when logging from a tpool thread.
ja: プールのトレースからロギングする際に死鎖を解決しました。
ko_kr: 풀 deadlock를 해결했습니다. 로그는 t풀 스레드에서 로그를 할 때.
ru: Применены эти переводные правила: 'pool' должен быть переведен как 'пул'.
zh_cn: 修复了死锁问题，来自tpool线程的日志。

source: Fixed deadlock when logging from a tpool thread. The object server runs certain IO-intensive methods outside the main pthread for performance. Previously, if one of those methods tried to log, this can cause a crash that eventually leads to an object server with hundreds or thousands of greenthreads, all deadlocked. The fix is to use a mutex that works across different greenlets and different pthreads.
ja: オブジェクトサーバーが特定のI/O強制的なメソッドをパフォーマンスのために外部の主pthreadで実行します。以前、当之一のメソッドがログイン試みた場合、これはクラッシュにつながります。最終的には、オブジェクトサーバーが数百または千のグリーンスレッドすべてが死結合されます。修正方法は、異なるグリーンスレッドと異なるpthread間で機能するマルチユーザーLOCKを使用することです。
ko_kr: 오브젝트 풀에서 로그를 로그ging 할 때 deadlock이 발생했습니다. 오브젝트 서버는 성능을 위해 메인 스레드 outside main pthread의 IO-중한 메소드를 실행합니다. 이전에, 그 중 하나가 로그를 시도하면, 이로 인해 오브젝트 서버가 수백 또는 수천개의 greenthread가 모두 deadlocked 할 수 있습니다. deadlock을 해결하는 방법은, 다른 greenlet 및 different pthreads에서 작동하는 mutex를 사용하는 것입니다.
ru: Применены корректировки: 'объект' переводится как 'объект', 'пул' — как 'пул', 'сервер' — как 'сервер'.
zh_cn: 固定死锁时从tpool线程中日志。对象服务器执行某些IO密集的方法外部主线程pthread，以提高性能。之前，如果其中一个这些方法尝试日志，这可能会导致崩溃，最终导致对象服务器拥有数百或千个greenlet，所有死锁。修复方案是使用跨不同greenlet和不同pthread的mutex。

source: Fixed encoding issue in ssync where a mix of ascii and non-ascii metadata values would cause an error.
ja: SSYNC のエンコード問題を修正しました。ASCII と非ASCII メタデータ値の混合はエラーを引き起こします。
ko_kr: SSYNC에서 아스키와 비아스키 메타데이터 값이 섞여 있는 경우 오류를 일으킬 수 있는 인코딩 문제가 해결되었습니다.
ru: Решено вопрос об ошибке в кодировании ssync, где mixed ascii и non-ascii значения метаданных привели к ошибке.
zh_cn: 修复了ssync中ASCII和非ASCII元数据值的混合问题，导致存储错误。

source: Fixed error where a container drive error resulted in double space usage on rest drives. When drive with container or account database is unmounted, the bug would create handoff replicas on all remaining drives, increasing the drive space used and filling the cluster.
ja: クラスターの場合、コンテナーは同じホストにすることはできません。
ko_kr: 클러스터에 대해 이 컨테이너 오류가 발생하면, 컨테이너 드라이브 오류로 인해 REST 드라이브의 사용량이 두 번의 공간을 사용하게 되었습니다. 컨테이너 또는 계정 데이터가 언마운트되면, 버그는 모든 남은 드라이브에 하드오프 리플리카를 생성하여 드라이브 공간이 증가하고 클러스터를 가득 차게 합니다.
ru: Применяя эти правила перевода: 'кластер' становится 'кластер', 'контейнер' становится 'контейнер', 'использование' становится 'использование'.
zh_cn: 集群中应用容器时，会导致所有剩余驱动的空间使用增加，并填满整个集群。

source: Fixed issue where bulk requests using xml and expect 100-continue would return a malformed HTTP response.
ja: バulkリクエストをXMLで使用し、100 Continue を期待すると、不正なHTTPレスポンスが返される問題を修正しました。
ko_kr: XML bulk 요청을 사용하여 100-Continue를 예상하는 경우 잘못된 HTTP 응답을 반환하는 문제를修正했습니다.
ru: Решено проблему, гдеbulk запросы с использованием xml и ожидание 100-continue возвращали неправильный ответ по HTTP.
zh_cn: 修复了xmlbulk请求，expect 100-continue时会返回的错误HTTP响应。

source: Fixed listings for sharded containers.
ja: コンテナをシャード化したものの固定リスト。
ko_kr: 공유 컨테이너의 fixed listing.
ru: Установленные списки для шардов контейнеров.
zh_cn: 固定列表为分区的容器。

source: Fixed logging of IP and port in the proxy-server; in particular, internal clients now correctly log about the replication IP/port.
ja: クライアントのロギングが固定されました。IPとポートはプロキシサーバーに記録されています。特に、レプリケーションIP/ポートについても、内側のクライアントから正しくロギングされます。
ko_kr: 클라이언트 로그의 IP 및 포트를 고정하여 프록시 서버에 적용되었으며, 특히 내부 클라이언트는 복제 IP/포트에 대해 올바르게 로그를 작성합니다.
ru: Применение этих переводных правил: 'клиент' становится 'клиент', 'репликация' становится 'репликация', 'сервер' становится 'сервер'.
zh_cn: 修复了代理服务器的日志，特别是内置客户端现在正确地记录了复制IP/端口。

source: Fixed multiple issues in s3api involving Multipart Uploads with non-ASCII names.
ja: Multipartアップロードを使用して、非アシー文字名を持つファイルをアップロードする場合に発生する問題に対して複数の修正を行ったs3api。
ko_kr: Multipart 업로드와 비 아스키 이름을 포함하는 S3 API에 대한 여러 문제를 해결했습니다.
ru: Решено несколько проблем в с3api, связанных с multipart-запросами для загрузок multipart-объектов с не-ASCII именами.
zh_cn: 修复了多个问题，涉及到S3API中的多部分上传，包括非ASCII名称。

source: Fixed non-ASCII account metadata handling.
ja: 非アシー文字のアカウントメタデータハンドリングを修正しました。
ko_kr: non-ASCII 계정 메타데이터 처리를 고정했습니다.
ru: Решено проблему обработки неарабeskого учета аккаунтных метаданных.
zh_cn: 修复了非ASCII账户元数据处理。

source: Fixed non-deterministic suffix updates in hashes.pkl where a partition may be updated much less often than expected.
ja: ハッシュファイル hashes.pkl の非決定性的なサフィックスの更新が固定されました。パーティションが期待どおりに頻繁に更新される可能性は低くなります。
ko_kr: Fixed 비결정적 서브파티 업데이트를 포함한 해시(pkl)에서 서브파티가 अप데이트되는 빈도와 예상하는 것보다 많은 경우를 가질 수 있는 suffix의 업데이트를 고정했습니다.
ru: Решено неопределенные обновления суффиксов в hashes.pkl, где раздел может быть обновлен намного реже, чем ожидалось.
zh_cn: 修复了非确定性的后缀更新在hashes.pkl中，其中一个分区可能会更改的频率远低于预期。

source: Fixed rare socket leak on range requests to erasure-coded objects.
ja: 固定されたレートでエラーコード化したオブジェクトに対する削除リクエストの場合、まれなソケット漏れが修正されました。
ko_kr: 오브젝트에 대한 범위 요청에서 소스코드 오류가 fixed되었습니다.
ru: Применить эти правила перевода: 'object' должно быть переводено как 'объект'.
zh_cn: 修复了范围请求中少量的套接字泄露问题，针对擦除编码对象。

source: Fixed regression in consolidate_hashes that occured when a new file was stored to new suffix to a non-empty partition. This bug was introduced in 2.7.0 and could cause an increase in rsync replication stats during and after upgrade, due to inconsistent hashing of partition suffixes.
ja: 'レプリケーション、複製'
ko_kr: 복제 수준 '%s' cannot have share configured
ru: Применены исправления для репликации в consolidate_hashes, которое произошло когда новый файл был записан на новый суффикс к неэмптической частиции. Эта ошибка была введена в 2.7.0 и могла привести к увеличению статистик репликации rsync во время и после обновления, из-за несовместного шифрования суффиксов частиций.
zh_cn: 修复了在新文件存储到新后缀到非空分区时，consolidate_hashes的bug。这个bug是在2.7.0中引入的，可以导致升级期间和之后的rsync复制统计增加，因为分区后缀的不一致性hash。

source: Fixed regression in consolidate_hashes that occurred when a new file was stored to new suffix to a non-empty partition. This bug was introduced in 2.7.0 and could cause an increase in rsync replication stats during and after upgrade, due to inconsistent hashing of partition suffixes.
ja: レプリケーション、複製。
ko_kr: 복제를 사용하여 파일을 복사하는 데 사용되는 데이터의 일치 여부를 확인하는 기능이 수정되었습니다. 이 버그는 2.7.0에서 도입되었으며, 새로운 파일이 새로운 확장자가 있는 비어있는 파티션에 저장된 경우, consolidate_hashes 함수가 발생했습니다. 이 버그는 업그레이드 중과 업그레이드 후에 rsync 복제 데이터의 수를 증가시킬 수 existed.
ru: Применить эти правила перевода: 'replication' должно быть переведено как 'репликация'.
zh_cn: 修复了在 2.7.0 中引入的 consolidate_hashes 函数中出现的bug，该函数当新文件存储到新后缀到非空分区时会发生。这种bug可能导致升级期间和之后的rsync 复制统计值增加，导致分区前缀的一致性不一致。

source: Let clients request heartbeats during SLO PUTs by including the query parameter ``heartbeat=on``.
ja: クライアントはSLO PUT時にハートビートを求めるようにリクエストを送るために、`heartbeat=on` というパラメーターを含めてください。
ko_kr: 클라이언트가 SLO PUT에 대한 심박수신을 요청하도록 하려면, `heartbeat=on`과 같은 매개 변수를 포함하여請求을 보내세요.
ru: Клиенты должны отправлять пульсации в ходе СЛО ПУТов, включая параметр ``heartbeat=on``.
zh_cn: 客户端在SLO更新时请客户端发送心跳，通过添加 heartbeat=on 的查询参数来实现。

source: Listing containers in accounts with json or xml now includes a `last_modified` time. This does not change any on-disk data, but simply exposes the value to offer consistency with the object listings on containers.
ja: コンテナーをアカウントにリストするには、JSONまたはXML形式のデータが含まれます。現在、リストに `last_modified` のタイムスタンプが追加されます。これは、ディスク上のデータに変化がないものの、オブジェクトのリストと一致させるために値を公開します。
ko_kr: 컨테이너를 사용하는 계정에 JSON 또는 XML을 포함하여 목록을 표시하면 `last_modified` 시간이 추가됩니다. 이는 디스크 데이터에 영향을 주지 않지만 오브젝트 목록과 일치하기 위해 값을 노출합니다.
ru: Списывание контейнеров в учетных записях с json или xml теперь включает в себя значение `last_modified` время. Это не изменяет никакой данных на диске, но просто раскрывает его значение, чтобы обеспечить совместимость с списанием объектов на контейнерах.
zh_cn: 列出账户中的容器（包括磁盘）现在在JSON或XML格式中显示了最后修改时间。这不会改变任何存储在硬盘上的数据，但仅仅是暴露了值，以与对象列表的一致性。

source: Lock timeouts in the container updater are now logged at INFO level, not ERROR.
ja: コンテナーアップデータのロックタイムアウトは、INFOレベルでログされますが、エラーレベルではありません。
ko_kr: 컨테이너 업데이터에서 잠금 타임아웃은 jetzt 정보 수준으로 로그됩니다.
ru: В контейнере обновителя блокировки теперь логируются в уровне INFO, а не в(ERROR).
zh_cn: 锁定在容器更新者中超时时间现在被记录为INFO级别，而不是ERROR级别。

source: Log correct status code for conditional requests.
ja: 条件付きリクエストの場合、正しいステータスコードを記録する。
ko_kr: 상태 코드를 확인하고 조건부 요청에 대한 로그를 적용합니다.
ru: Применить правильный статус-код для условных запросов.
zh_cn: 应用条件请求时的状态代码。

source: Log deprecation warning for ``allow_versions`` in the container server config. Configure the ``versioned_writes`` middleware in the proxy server instead. This option will be ignored in a future release.
ja: コンテナー %(net)s では、固定 IP アドレスが利用可能ではありません。
ko_kr: `` 컨테이너 ''에 대한 allow_versions 옵션의 비고告警이 발생했습니다. `` versioned_writes '' 미들웨어를 ``서버 ''에 구성하여 사용하세요. 이 옵션은 향후 릴리스에서 무시됩니다.
ru: Применить следующие переводы: 'контейнер' должно быть переведено как 'контейнер', 'сервер' должно быть переведено как 'сервер'.
zh_cn: 容器中“allow_versions”配置的警告已被弃用。请在代理服务器上启用“versioned_writes”中间件。这个选项将在未来版本中被忽略。

source: Log deprecation warnings for ``run_pause``. This setting was deprecated in Swift 2.4.0 and is replaced by ``interval``. It may be removed in a future release.
ja: `run_pause` のログの警告を出します。 `run_pause` は、Swift 2.4.0 以降はデプレーションされ、`interval` に置き換えられます。 futer リリースで削除される可能性があります。
ko_kr: `run_pause` 로gende프레션 경고를 표시합니다. `run_pause` 설정은 Swift 2.4.0에서弃기되었으며, `interval`에 대체됩니다. 향후 릴리스에서 제거될 수 있습니다.
ru: Вывод предупреждений о depreciровании для функции ``run_pause''. Этот параметр был deprecated в Swift 2.4.0 и заменен на ``interval''. Он может быть удален в будущем выпуске.
zh_cn: 日志中显示的弃用警告： ``run_pause``。此设置在Swift 2.4.0版本中已被弃用，并且已被 ``interval`` 代替。它可能在未来版本中被移除。

source: Log formats are now more configurable and include support for anonymization. See the ``log_msg_template`` option in ``proxy-server.conf`` and `the Swift documentation <https://docs.openstack.org/swift/latest/logs.html#proxy-logs>`__ for more information.
ja: サーバーでロギングはよりカスタizable になりました。サーバーのログには、`log_msg_template` オプションを使用してアノニマイゼーションを有効にできます。 `proxy-server.conf` において。 Swift ドキュメント <https://docs.openstack.org/swift/latest/logs.html#proxy-logs>`__ を参照して、より詳細な情報が得られます。
ko_kr: 서버에 대한 로그 형식은 이제 더 configurable 하게 되고, 익명화 지원이 포함됩니다. :class:`log_msg_template` 옵션을 ``proxy-server.conf`` 에서 확인하십시오. 더 많은 정보는 <https://docs.openstack.org/swift/latest/logs.html#proxy-logs>`__ Swift 문서에서 확인할 수 있습니다.
ru: Применяются новые правила перевода: 'сервер' становится 'сервер', 'стек' - 'стек', 'шаблон' - 'шаблон'.
zh_cn: 服务器的日志格式现在更可配置化，并且包括了匿名化的支持。查看 ``log_msg_template`` 选项在 ``proxy-server.conf`` 中，了解更多信息：<https://docs.openstack.org/swift/latest/logs.html#proxy-logs>__堆栈块模板

source: Log progress per partition when relinking/cleaning up.
ja: パーティションを再リンク/クリーンアップする際のログは各パーティションごとに表示します。
ko_kr: partition별 로그를 표시하여 재链接/정리하는 경우
ru: Регистрируйте прогресс по разделу при обновлении/очистке.
zh_cn: 在重新链接/清理时，显示每个分区的日志进度。

source: Log the correct request type of a subrequest downstream of copy.
ja: コピー下流のサブリクエストの正しいリクエストタイプをログします。
ko_kr: 로그에 correct request type of a subrequest downstream of copy를 기록하십시오.
ru: Регистрируйте правильный тип запроса подзапроса в下stream от копирования.
zh_cn: 记录子请求 downstream 的复制后正确的请求类型。

source: Logging improvements
ja: ロギングの改善
ko_kr: 로깅 개선
ru: Императивы улучшения логирования
zh_cn: 日志优化

source: Lower bounds of dependencies have been updated to reflect what is actually tested.
ja: 依存性の下限値が実際にテストされていることを反映して更新されました。
ko_kr: 부하의 하한치는 실제로 테스트되는 것을 반영하여 업데이트되었습니다.
ru: Низкие пределы зависимостей были обновлены, чтобы отражать то, что действительно проверяется.
zh_cn: 依赖的下限已经更新，反映了实际被测试的内容

source: Make allowable clock skew configurable, with a default value of 15 minutes to match AWS. Note that this was previously hardcoded at 5 minutes; operators may want to preserve the prior behavior by setting ``allowable_clock_skew = 300`` in the ``[filter:s3api]`` section of their proxy-server.conf.
ja: サーバーを使用する場合、時差は15分まで許容できます。以前は5分に固定されていましたが、オペレーターは以前の機能を維持するために、`allowable_clock_skew = 300` を `filter:s3api` セクションの `proxy-server.conf` に設定してください。
ko_kr: Allowable clock skew를 configurable로 만들고, 기본적으로 AWS와 일치하기 위해 15분으로 설정할 수 있어야 함. 이전에 5분으로 고정되어 있었지만, 운영자는 ``allowable_clock_skew = 300``을 ``[filter:s3api]`` 섹션의.proxy-server.conf에서 설정하여 이전 behavior를 유지할 수 있음.
ru: Применить следующие переводные правила: 'раздел' должен быть переведен как 'раздел', 'сервер' должен быть переведен как 'сервер'.
zh_cn: 部分

source: Make mount_check option usable in containerized environments by adding a check for an ".ismount" file at the root directory of a device.
ja: コンテナー化された環境でマウントチェックオプションを使用できるように、デバイスのルートディレクトリに「.ismount」ファイルがあるかどうかのチェックを追加する必要があります。
ko_kr: 컨테이너 환경에서 mount_check 옵션을 사용하기 위해, 장치의 루트 디렉터리에 ".ismount" 파일이 있는지 확인해야 합니다.
ru: Применить эти переводные правила: 'контейнер' должен быть переведен как 'контейнер', 'устройство' должно быть переведено как 'устройство', 'окружение' должно быть переведено как 'окружение'.
zh_cn: 在容器化的环境中，使 mount_check 选项可用，通过检查设备根目录的“.ismount”文件。

source: Memcache client error-limiting is now configurable. See the ``error_suppression_*`` options in etc/memcache.conf-sample
ja: メモリキャッシュクライアントエラー制限は現在可変化可能です。 `error_suppression_*` オプションを/etc/memcache.conf-sample参照してください。
ko_kr: 캐시 클라이언트 오류 제한은 이제-configurable입니다. see the ``error_suppression_*`` options etc/memcache.conf-sample
ru: Кэш клиент ошибка ограничения кэширования теперь настроек конфигурации. Просмотрите ``error_suppression_*`` опции в etc/memcache.conf-sample.
zh_cn: 缓存客户端错误限度现在可配置。查看 ``error_suppression_*`` 选项在/etc/memcache.conf-sample中。

source: Metrics are now emitted for a variety of S3 error responses, in the form ``s3api.<status_int>.<error_class>[.<reason>]``
ja: メトリクスは現在、S3 エラーのさまざまな種類に対して Emitされています。形式は ``s3api.<状態_int>.<エラークラス>[.<理由>]`` です。
ko_kr: `상태` 상태에 따라 다양한 S3 오류 응답에 대한 mé트릭이 ahora 발행됩니다. 형식은 `s3api.상태_인터 (int).오류_클래스[.사유]`.
ru: Применяются метрики для различных ответов ошибок S3 в форме `s3api.<статус_инт>.<класс_ошибки>[.<причина]>`.
zh_cn: 当前的指标现在包含了多种S3错误响应的各种情况，形式为 `` s3api.状态_int.错误类[.原因] ``。

source: Metrics are now emitted for whether databases used for cleaving were created or already existed, allowing a better understanding of the reason for handoffs in the cluster.
ja: メトリクスは、クリアングに使用されるデータベースがすでに存在していたかどうかで発生する理由をよりよく理解できるように、現在メトリクスが送信されます。クラスター
ko_kr: 클러스터에서 데이터베이스를 사용하여 분할하는 데 사용된 데이터베이스가 이미 존재하거나 생성되었는지 여부에 대한 mé트릭이 now로 보냉니다. 이로 인해 클러스터 내의 옮겨전의 이유에 대한 더 अच्छ은 이해가 가능합니다.
ru: Применяются эти правила перевода: 'кластер' должно быть переведено как 'кластер'.
zh_cn: 现在，指标已经发送了关于用于切割的数据库是否创建或已存在的信息，这有助于更好地理解集群中的转移原因。

source: Metrics improvements:
ja: メトリックの改善
ko_kr: 메트릭스 개선:
ru: Импровизации метрик:
zh_cn: 指标改进：

source: Middleware features:
ja: マiddleware機能:
ko_kr: 미들웨어 기능:
ru: Функции среднего слоя:
zh_cn: 中间件功能：

source: Mirror X-Trans-Id to X-Openstack-Request-Id.
ja: `stack` は `スタック` に置き換えられます。
ko_kr: Mirror X-Trans-Id를 X-Openstack-Request-Id로 대체합니다.
ru: Создать стэк.
zh_cn: 实例 %(instance_id)s 无法接受，原因是： %(reason)s

source: Upgrade liberasurecode on all proxy servers. Newly-written data will now use new fragments. Note that not-yet-upgraded proxies will not be able to read these newly-written fragments but will instead respond ``500 Internal Server Error``.
ja: アップグレードする必要があります。サーバーをすべてアップグレードします。新しく書き込まれたデータは、新しいブロックを使います。注意してくださいが、まだアップグレードされていないプロキシ サーバーは、これまでに書き込まれた新しいブロックを読むことができませんが、代わりに ``500 Internal Server Error`` というエラーを返します。
ko_kr: 서버를 업그레이드하여 liberasurecode를 모든 프록시 서버에 적용하십시오. 새로운 데이터가 이제는 새로운片段을 사용할 것입니다. 그러나 아직 업그레이드되지 않은 프록시服务器은 이러한 새로운 데이터를 읽을 수 없으며 대신 ``500 Internal Server Error``를 trảします.
ru: Используйте обновленную версию liberasurecode на всех прокси-серверах. Новая запись теперь будет использовать новые фрагменты. Примечание: не обновленные proxies не смогут прочитать эти новые фрагменты, но вместо этого ответят ``500 Internal Server Error``.
zh_cn: 升级liberasurecode在所有代理服务器上。新写入的数据现在使用新片段。注意，尚未升级的代理服务器无法读取这些新写入的片段，而是会返回``500 Internal Server Error``。

source: Uploads to containers with object versioning enabled now require a ``Content-Length`` or ``Transfer-Encoding: chunked`` header, similar to other containers.
ja: コンテナーにオブジェクトバージョニングが有効になっている場合、現在は ``Content-Length`` または ``Transfer-Encoding: chunked`` ヘッダーを含む必要があります。
ko_kr: 컨테이너에 오브젝트 버전을 활성화한 경우, ``Content-Length`` 또는 ``Transfer-Encoding: chunked`` 헤더가 필요합니다. 다른 컨테이너와 유사하게.
ru: Загрузки в контейнеры с включенной версией объектов теперь требуют заголовка ``Content-Length`` или ``Transfer-Encoding: chunked``, аналогичных другим контейнерам.
zh_cn: 将对象版本化启用的容器中现在需要包含 ``Content-Length`` 或 ``Transfer-Encoding: chunked`` 头部，类似于其他容器。
